/*
 * 文件名：DictCodeList.java'
 * 版权：Copyright 2017-2018 JoyinTech. Co. Ltd. All Rights Reserved.
 * 描述：理财资管管理系统V2.0
 * 修改人：丁志鹏
 * 修改时间：2018年08月04日
 * 修改内容：新建
 * 系统名称：理财资管管理系统V2.0
 */
package com.joyintech.tams.invest.common.constant;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.List;

import com.joyintech.framework.base.BaseDictCode;
import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

/**
 * 平安数据字典明细
 * @author 丁志鹏
 * @version 1.0 2018年08月04日
 * @see BussinessDictCodeList
 * @since 1.0
 */
public enum BussinessDictCodeList implements BaseDictCodeList {


    /**
     * 提醒类型_大分类_产品端
     */
    提醒类型_大分类_产品端(BussinessDictCode.提醒类型_大分类,"R1","产品端"),
    /**
     * 提醒类型_大分类_315检查
     */
    提醒类型_大分类_315检查(BussinessDictCode.提醒类型_大分类,"R2","315检查"),
    /**
     * 提醒类型_大分类_回款及存续期确认
     */
    提醒类型_大分类_回款及存续期确认(BussinessDictCode.提醒类型_大分类,"R3","回款及存续期确认"),
    /**
     * 提醒类型_大分类_债券覆盖及行权
     */
    提醒类型_大分类_债券覆盖及行权(BussinessDictCode.提醒类型_大分类,"R4","债券覆盖及行权"),
    /**
     * 提醒类型_大分类_风险提醒
     */
    提醒类型_大分类_风险提醒(BussinessDictCode.提醒类型_大分类,"R5","风险提醒"),
    /**
     * 提醒类型_大分类_净值披露
     */
    提醒类型_大分类_披露管理(BussinessDictCode.提醒类型_大分类,"R6","披露管理"),
    /**
     * 提醒类型_大分类_债券评级变动
     */
    提醒类型_大分类_变更提醒(BussinessDictCode.提醒类型_大分类,"R7","变更提醒"),
    /**
     * 提醒类型_大分类_公共数据变更
     */
    提醒类型_大分类_公共数据变更(BussinessDictCode.提醒类型_大分类,"R9","公共数据变更"),
    //add by chenjiaxing 分销缴款提醒 20210727 start
    /**
     * 提醒类型_大分类_分销缴款提醒
     */
    提醒类型_大分类_分销缴款提醒(BussinessDictCode.提醒类型_大分类,"R11","分销缴款提醒"),
    /**
     * 提醒类型_小分类_债券借贷融出的券还本收息
     */
    提醒类型_小分类_分销缴款提醒(BussinessDictCode.提醒类型_小分类,"R11S1","分销缴款提醒"),
    //add by chenjiaxing 分销缴款提醒 20210727 end
    /**
     * 提醒类型_小分类_债券借贷融出的券还本收息
     */
    提醒类型_小分类_债券借贷融出的券还本收息(BussinessDictCode.提醒类型_小分类,"R3S16","债券借贷融出的券还本收息"),
    /**
     * 提醒类型_小分类_债项和主体评级变动
     */
    提醒类型_小分类_债项和主体评级变动(BussinessDictCode.提醒类型_小分类,"R7S1","债项和主体评级变动"),
    /**
     * 提醒类型_小分类_项目类资产标的信息被修改
     */
    提醒类型_小分类_项目类资产标的修改提醒(BussinessDictCode.提醒类型_小分类,"R7S2","项目类资产标的修改提醒"),
    /**
     * 提醒类型_小分类_项目类资产标的信息被修改
     */
    提醒类型_小分类_舆情提醒(BussinessDictCode.提醒类型_小分类,"R7S3","舆情提醒"),


    /**
     * 提醒类型_小分类_净值披露
     */
    提醒类型_小分类_净值披露提醒(BussinessDictCode.提醒类型_小分类,"R6S1","净值披露提醒"),
    /**
     * 提醒类型_小分类_产品正在募集
     */
    提醒类型_小分类_产品正在募集(BussinessDictCode.提醒类型_小分类,"R1S1","产品正在募集"),
    /**
     * 提醒类型_小分类_产品起息
     */
    提醒类型_小分类_产品起息(BussinessDictCode.提醒类型_小分类,"R1S2","产品起息"),
    /**
     * 提醒类型_小分类_产品分红方案登记
     */
    提醒类型_小分类_产品中间付息(BussinessDictCode.提醒类型_小分类,"R1S3","产品中间付息"),
    /**
     * 提醒类型_小分类_子周期强制赎回提醒
     */
    提醒类型_小分类_子周期强制赎回提醒(BussinessDictCode.提醒类型_小分类,"R1S4","子周期强制赎回提醒"),
    /**
     * 提醒类型_小分类_产品到期
     */
    提醒类型_小分类_产品到期(BussinessDictCode.提醒类型_小分类,"R1S5","产品到期"),
    /**
     * 提醒类型_小分类_产品费用支付
     */
    提醒类型_小分类_产品费用支付(BussinessDictCode.提醒类型_小分类,"R1S6","产品费用支付"),
    /**
     * 提醒类型_小分类_产品的最新净值小于1
     */
    提醒类型_小分类_产品的最新净值小于1(BussinessDictCode.提醒类型_小分类,"R1S7","产品的最新净值小于1"),
    /**
     * 提醒类型_小分类_项目类提前5天
     */
    提醒类型_小分类_项目类提前5天(BussinessDictCode.提醒类型_小分类,"R2S1","项目类提前5天"),
    /**
     * 提醒类型_小分类_项目类提前1个月
     */
    提醒类型_小分类_项目类提前1个月(BussinessDictCode.提醒类型_小分类,"R2S2","项目类提前1个月"),
    /**
     * 提醒类型_小分类_项目类提前3个月
     */
    提醒类型_小分类_项目类提前3个月(BussinessDictCode.提醒类型_小分类,"R2S3","项目类提前3个月"),
    /**
     * 提醒类型_小分类_计划类利率型提前5天
     */
    提醒类型_小分类_计划类利率型提前5天(BussinessDictCode.提醒类型_小分类,"R2S4","计划类利率型提前5天"),
    /**
     * 提醒类型_小分类_计划类利率型提前1个月
     */
    提醒类型_小分类_计划类利率型提前1个月(BussinessDictCode.提醒类型_小分类,"R2S5","计划类利率型提前1个月"),
    /**
     * 提醒类型_小分类_计划类利率型提前3个月
     */
    提醒类型_小分类_计划类利率型提前3个月(BussinessDictCode.提醒类型_小分类,"R2S6","计划类利率型提前3个月"),
    /**
     * 提醒类型_小分类_基金类净值型回款确认
     */
    提醒类型_小分类_基金类净值型回款确认(BussinessDictCode.提醒类型_小分类,"R3S1","基金类净值型回款确认"),
    /**
     * 提醒类型_小分类_基金类货币型回款确认
     */
    提醒类型_小分类_基金类货币型回款确认(BussinessDictCode.提醒类型_小分类,"R3S2","基金类货币型回款确认"),
    /**
     * 提醒类型_小分类_基金类净值型回款确认
     */
    提醒类型_小分类_计划类净值型回款确认(BussinessDictCode.提醒类型_小分类,"R3S3","计划类净值型回款确认"),
    /**
     * 提醒类型_小分类_货币基金分红提醒
     */
    提醒类型_小分类_货币基金分红提醒(BussinessDictCode.提醒类型_小分类,"R3S4","货币基金分红提醒"),
    /**
     * 提醒类型_小分类_债券存续期
     */
    提醒类型_小分类_债券存续期(BussinessDictCode.提醒类型_小分类,"R3S5","债券存续期"),
    /**
     * 提醒类型_小分类_债券存续期回款确认
     */
    提醒类型_小分类_债券存续期回款确认(BussinessDictCode.提醒类型_小分类,"R3S6","债券存续期回款确认"),
    /**
     * 提醒类型_小分类_回购回款确认
     */
    提醒类型_小分类_回购回款确认(BussinessDictCode.提醒类型_小分类,"R3S7","回购回款确认"),
    /**
     * 提醒类型_小分类_项目类资产存续期
     */
    提醒类型_小分类_项目类资产存续期(BussinessDictCode.提醒类型_小分类,"R3S8","项目类资产存续期"),
    /**
     * 提醒类型_小分类_项目类资产存续期回款确认
     */
    提醒类型_小分类_项目类资产存续期回款确认(BussinessDictCode.提醒类型_小分类,"R3S9","项目类资产存续期回款确认"),
    /**
     * 提醒类型_小分类_计划类利率型存续期
     */
    提醒类型_小分类_计划类利率型存续期(BussinessDictCode.提醒类型_小分类,"R3S10","计划类利率型存续期"),
    /**
     * 提醒类型_小分类_计划类利率型存续期回款确认
     */
    提醒类型_小分类_计划类利率型存续期回款确认(BussinessDictCode.提醒类型_小分类,"R3S11","计划类利率型存续期回款确认"),
    /**
     * 提醒类型_小分类_计划类利率型存续期回款确认
     */
    提醒类型_小分类_计划类货币型回款确认(BussinessDictCode.提醒类型_小分类,"R3S12","计划类货币型回款确认"),
    /**
     * 提醒类型_小分类_计划类利率型存续期回款确认
     */
    提醒类型_小分类_存款类资产存续期(BussinessDictCode.提醒类型_小分类,"R3S13","存款类资产存续期"),
    /**
     * 提醒类型_小分类_计划类利率型存续期回款确认
     */
    提醒类型_小分类_质押式回购存续期(BussinessDictCode.提醒类型_小分类,"R3S14","质押式回购存续期"),
    /**
     * 提醒类型_小分类_买断式回购存续期
     */
    提醒类型_小分类_买断式回购存续期(BussinessDictCode.提醒类型_小分类,"R3S15","买断式回购存续期"),
    /**
     * 提醒类型_小分类_债券行权
     */
    提醒类型_小分类_债券行权(BussinessDictCode.提醒类型_小分类,"R4S1","债券行权"),
    /**
     * 提醒类型_小分类_债券覆盖
     */
    提醒类型_小分类_债券覆盖(BussinessDictCode.提醒类型_小分类,"R4S2","债券覆盖"),
    /**
     * 提醒类型_小分类_指标预警提醒
     */
    提醒类型_小分类_指标预警提醒(BussinessDictCode.提醒类型_小分类,"R5S1","指标预警提醒"),
    /**
     * 提醒类型_小分类_指标违规提醒
     */
    提醒类型_小分类_指标违规提醒(BussinessDictCode.提醒类型_小分类,"R5S2","指标违规提醒"),
    /**
     * 提醒类型_小分类_数据修改
     */
    提醒类型_小分类_数据修改(BussinessDictCode.提醒类型_小分类,"R9S1","数据修改"),

    /**
     * 债券_提前3个月
     */
    提醒类型_小分类_债券提前3个月(BussinessDictCode.提醒类型_小分类,"S01","债券提前3个月"),

    /**
     * 债券_提前3个月
     */
    提醒类型_小分类_债券提前1个月(BussinessDictCode.提醒类型_小分类,"S02","债券提前1个月"),

    /**
     * 债券_提前5天
     */
    提醒类型_小分类_债券提前5天(BussinessDictCode.提醒类型_小分类,"S03","债券提前5天"),

    /**
     * 基金类（货币型）申购确认
     */
    提醒类型_小分类_基金类货币型申购确认(BussinessDictCode.提醒类型_小分类,"S10","基金类货币型申购确认"),

    /**
     * 基金类（货币型）赎回确认
     */
    提醒类型_小分类_基金类货币型赎回确认(BussinessDictCode.提醒类型_小分类,"S11","基金类货币型赎回确认"),

    /**
     * 基金类（净值型）申购确认
     */
    提醒类型_小分类_基金类净值型申购确认(BussinessDictCode.提醒类型_小分类,"S13","基金类净值型申购确认"),

    /**
     * 基金类（净值型）赎回确认
     */
    提醒类型_小分类_基金类净值型赎回确认(BussinessDictCode.提醒类型_小分类,"S14","基金类净值型赎回确认"),

    /**
     * 计划类（净值型）申购确认
     */
    提醒类型_小分类_计划类净值型申购确认(BussinessDictCode.提醒类型_小分类,"S16","基金类净值型申购确认"),

    /**
     * 计划类（净值型）赎回确认
     */
    提醒类型_小分类_计划类净值型赎回确认(BussinessDictCode.提醒类型_小分类,"S17","计划类净值型赎回确认"),

    /**
     * 债券上市流通操作
     */
    提醒类型_小分类_债券上市流通操作(BussinessDictCode.提醒类型_小分类,"R10S1","债券上市流通操作"),

    /**
     * 资产要素登记修改
     */
    提醒类型_小分类_资产要素登记修改(BussinessDictCode.提醒类型_小分类,"R10S2","资产要素登记修改"),

    /**
     * 标准券额度不足提醒
     */
    提醒类型_大分类_标准券额度不足提醒(BussinessDictCode.提醒类型_小分类,"R12","标准券额度不足提醒"),

    /**
     * 标准券额度不足提醒
     */
    提醒类型_小分类_标准券额度不足提醒(BussinessDictCode.提醒类型_小分类,"R12S1","标准券额度不足提醒"),

    /**
     * 入库
     */
    出入库方向_入库(BussinessDictCode.出入库方向,"01","入库"),
    /**
     * 入库
     */
    出入库方向_出库(BussinessDictCode.出入库方向,"02","出库"),
    /**
     * 净值型资产申购
     */
    共同业务类型_净值型资产申购(BussinessDictCode.共同业务类型,"TRD31","净值型资产申购"),
    /**
     * 净值型资产赎回
     */
    共同业务类型_净值型资产赎回(BussinessDictCode.共同业务类型,"TRD32","净值型资产赎回"),
    /**
     * 货币基金申购
     */
    共同业务类型_货币基金申购(BussinessDictCode.共同业务类型,"TRD29","货币基金申购"),
    /**
     * 货币基金赎回
     */
    共同业务类型_货币基金赎回(BussinessDictCode.共同业务类型,"TRD30","货币基金赎回"),

    /**
     * 逆回购录入
     */
    共同业务类型_逆回购录入(BussinessDictCode.共同业务类型,"TRD27","逆回购录入"),
    /**
     * 正回购录入
     */
    共同业务类型_正回购录入(BussinessDictCode.共同业务类型,"TRD28","正回购录入"),

    /**
     * 计费基数_券面总额
     */
    计费基数_券面总额(BussinessDictCode.计费基数,"01","券面总额"),
    /**
     * 计费基数_成交金额
     */
    计费基数_成交金额(BussinessDictCode.计费基数,"02","成交金额"),

    /**
     * 计息规则
     */
    OPICS参数类型_计息规则(BussinessDictCode.OPICS参数类型,"01","BASIS"),
    /**
     * BRANCK
     */
    OPICS参数类型_BRANCK(BussinessDictCode.OPICS参数类型,"02","BRANCH"),
    /**
     * BROK
     */
    OPICS参数类型_BROK(BussinessDictCode.OPICS参数类型,"03","BROK"),
    /**
     * COST
     */
    OPICS参数类型_COST(BussinessDictCode.OPICS参数类型,"04","COST"),
    /**
     * DEALTYPE
     */
    OPICS参数类型_DEALTYPE(BussinessDictCode.OPICS参数类型,"05","DEALTYPE"),
    /**
     * PORT
     */
    OPICS参数类型_PORT(BussinessDictCode.OPICS参数类型,"06","PORT"),
    /**
     * 业务类型
     */
    OPICS参数类型_业务类型(BussinessDictCode.OPICS参数类型,"07","SENDMODULE"),
    /**
     * VERIND
     */
    OPICS参数类型_VERIND(BussinessDictCode.OPICS参数类型,"08","VERIND"),
    /**
     * 资金信托
     */
    计划类二级分类_信托_资金信托(BussinessDictCode.计划二级分类_信托,"01","资金信托"),
    /**
     * 投资类组合
     */
    组合类型_投资类组合(BussinessDictCode.组合类型,"01","投资类组合"),
    /**
     * 委外组合
     */
    组合类型_委外组合(BussinessDictCode.组合类型,"02","委外组合"),
    /**
     * 自主组合
     */
    组合类型_自主组合(BussinessDictCode.组合类型, "06", "自主组合"),
    /**
     * 基准类型
     */
    基准类型_SAA(BussinessDictCode.基准类型,"01","SAA"),
    /**
     * 基准类型
     */
    基准类型_复合(BussinessDictCode.基准类型,"05","复合"),
    /**z
     * 基准类型
     */
    基准类型_利率(BussinessDictCode.基准类型,"04","利率"),
    /**
     * 基准类型
     */
    基准类型_指数(BussinessDictCode.基准类型,"02","指数"),
    /**
     * 基准类型
     */
    基准类型_曲线(BussinessDictCode.基准类型,"03","曲线"),
    /**
     * 基准类型
     */
     行情类型_利率(BussinessDictCode.行情类型,"04","利率"),
     /**
      * 基准类型
      */
     基准类型_业绩基准(BussinessDictCode.基准类型,"06","业绩基准"),
     /**
      * 其他资产管理计划
      */
     业务编号一级分类_其他资产管理计划(BussinessDictCode.业务编号一级分类,"25","其他资产管理计划"),
     /**
      * 基金资产管理计划
      */
     业务编号一级分类_基金资产管理计划(BussinessDictCode.业务编号一级分类,"21","基金资产管理计划"),
     /**
      * 期货资产管理计划
      */
     业务编号一级分类_期货资产管理计划(BussinessDictCode.业务编号一级分类,"22","期货资产管理计划"),
     /**
      * 非标债权
      */
     业务编号一级分类_非标债权(BussinessDictCode.业务编号一级分类,"08","非标债权"),
     /**
      * 理财直融
      */
     业务编号一级分类_理财直融(BussinessDictCode.业务编号一级分类,"09","理财直融"),
     /**
      * 信贷资产流转项目
      */
     业务编号一级分类_信贷资产流转项目(BussinessDictCode.业务编号一级分类,"10","信贷资产流转项目"),
     /**
      * 基础设施基金
      */
     业务编号一级分类_基础设施基金(BussinessDictCode.业务编号一级分类,"11","基础设施基金"),
     /**
      * 其他产业投资基金
      */
     业务编号一级分类_其他产业投资基金(BussinessDictCode.业务编号一级分类,"12","其他产业投资基金"),
     /**
      * 结构化证券
      */
     业务编号一级分类_结构化证券(BussinessDictCode.业务编号一级分类,"13","结构化证券"),
     /**
      * 股票定向增发
      */
     业务编号一级分类_股票定向增发(BussinessDictCode.业务编号一级分类,"14","股票定向增发"),
     /**
      * 资产受益权投资
      */
     业务编号一级分类_资产受益权投资(BussinessDictCode.业务编号一级分类,"15","资产受益权投资"),
     /**
      * 券商收益凭证
      */
     业务编号一级分类_券商收益凭证(BussinessDictCode.业务编号一级分类,"16","券商收益凭证"),
     /**
      * 股票质押式回购
      */
     业务编号一级分类_股票质押式回购(BussinessDictCode.业务编号一级分类,"17","股票质押式回购"),
     /**
      * 信托产品
      */
     业务编号一级分类_信托产品(BussinessDictCode.业务编号一级分类,"06","信托产品"),
     /**
      * 其他权益类投资
      */
     业务编号一级分类_其他权益类投资(BussinessDictCode.业务编号一级分类,"26","其他权益类投资"),
     /**
      * 保险资产管理计划
      */
     业务编号一级分类_保险资产管理计划(BussinessDictCode.业务编号一级分类,"07","保险资产管理计划"),
    /**
     * 券商资产管理计划
     */
    业务编号一级分类_券商资产管理计划(BussinessDictCode.业务编号一级分类,"05","券商资产管理计划"),
    /**
     * 委托债券
     */
    业务编号一级分类_委托债券(BussinessDictCode.业务编号一级分类,"01","委托债券"),
    /**
     * 委托权益
     */
    业务编号一级分类_委托权益(BussinessDictCode.业务编号一级分类,"02","委托权益"),
    /**
     * 公募计划
     */
    业务编号一级分类_公募计划(BussinessDictCode.业务编号一级分类,"03","公募计划"),
    /**
     * 自主管理
     */
    业务编号一级分类_自主管理(BussinessDictCode.业务编号一级分类,"04","自主管理"),
    /**
     * 同业借款
     */
    业务编号一级分类_同业借款(BussinessDictCode.业务编号一级分类,"18","同业借款"),
    /**
     * 存放同业
     */
    业务编号一级分类_存放同业(BussinessDictCode.业务编号一级分类,"19","存放同业"),
    /**
     * 普通拆借
     */
    业务编号一级分类_普通拆借(BussinessDictCode.业务编号一级分类,"23","普通拆借"),
    /**
     * 特殊目的载体
     */
    业务编号一级分类_特殊目的载体(BussinessDictCode.业务编号一级分类,"24","特殊目的载体"),
    /**
     * 摊余成本类
     */
    投资目的_摊余成本类(BussinessDictCode.投资目的,"AC","摊余成本类"),
    /**
     * 公允价值变动计入其他综合收益
     */
    投资目的_公允价值变动计入其他综合收益(BussinessDictCode.投资目的,"FVOCI","公允价值变动计入其他综合收益"),
    /**
     * 公允价值变动计入当期损益
     */
    投资目的_公允价值变动计入当期损益(BussinessDictCode.投资目的,"FVTPL","公允价值变动计入当期损益"),
    /**
     * 普通拆借
     */
    拆借类型_普通拆借(BussinessDictCode.拆借类型,"L01","普通拆借"),
    /**
     * 特殊目的载体
     */
    拆借类型_特殊目的载体(BussinessDictCode.拆借类型,"L02","特殊目的载体"),
    /**
     * 买入
     */
    交易方向_买入(BussinessDictCode.交易方向,"T01","买入"),
    /**
     * 卖出
     */
    交易方向_卖出(BussinessDictCode.交易方向,"T02","卖出"),
    /**
     * 卖出到账
     */
    交易方向_卖出到账(BussinessDictCode.交易方向,"T40","卖出到账"),

    // 一体化对应etliu start
//    /**
//     * 行权
//     */
    交易方向_行权(BussinessDictCode.交易方向,"T03","行权"),
    /**
     * 交易方向_行权回售
     */
    交易方向_行权回售(BussinessDictCode.交易方向,"T03","行权-回售"),
    /**
     * 交易方向_行权赎回
     */
    交易方向_行权赎回(BussinessDictCode.交易方向,"T39","行权-赎回"),
    // 一体化对应etliu end
    /**
     * 申购
     */
    交易方向_申购(BussinessDictCode.交易方向,"T04","申购"),
    /**
     * 申购确认
     */
    交易方向_申购确认(BussinessDictCode.交易方向,"T05","申购确认"),
    /**
     * 赎回
     */
    交易方向_赎回(BussinessDictCode.交易方向,"T06","赎回"),
    /**
     * 到期
     */
    交易方向_到期(BussinessDictCode.交易方向,"T07","到期"),
    /**
     * 还本
     */
    交易方向_还本(BussinessDictCode.交易方向,"T08","还本"),
    /**
     * 收息
     */
    交易方向_收息(BussinessDictCode.交易方向,"T09","收息"),
    /**
     * 付费
     */
    交易方向_付费(BussinessDictCode.交易方向,"T10","付费"),
    /**
     * 交易方向_现金分红
     */
    交易方向_现金分红(BussinessDictCode.交易方向, "T11", "现金分红"),
    /**
     * 红利再投
     */
    交易方向_红利再投(BussinessDictCode.交易方向,"T12","红利再投"),
    /**
     * 除权登记
     */
    交易方向_除权登记(BussinessDictCode.交易方向, "T13", "除权登记"),
   /** 认购确认
    */
   交易方向_认购确认(BussinessDictCode.交易方向,"T18","认购确认"),
    /**
     * 赎回确认
     */
    交易方向_赎回确认(BussinessDictCode.交易方向,"T19","赎回确认"),
    /**
     * 转入
     */
    交易方向_转入(BussinessDictCode.交易方向,"T20","转入"),
    /**
     * 转出
     */
    交易方向_转出(BussinessDictCode.交易方向,"T21","转出"),
    交易方向_收息到账(BussinessDictCode.交易方向,"T22", "收息到账"),
    交易方向_还本到账(BussinessDictCode.交易方向,"T23","还本到账"),
    /**
     * 赎回确认
     */
    交易方向_赎回到账(BussinessDictCode.交易方向,"T24","赎回到账"),

 // 一体化对应etliu start
//    /**
//     * 交易方向_提前支取
//     */
//    交易方向_提前支取(BussinessDictCode.交易方向,"T28","提前支取"),
    /**
     * 交易方向_提前支取
     */
    交易方向_提前支取(BussinessDictCode.交易方向,"T38","提前支取"),
 // 一体化对应etliu end

    /**
     * 交易方向_收取
     */
    交易方向_收取(BussinessDictCode.交易方向, "T98", "收取"),
    /**
     * 交易方向_支付
     */
    交易方向_支付(BussinessDictCode.交易方向, "T99", "支付"),
    /**
     * 产品认购
     */
    交易方向_产品认购(BussinessDictCode.交易方向,"C1","产品认购"),
    /**
     * 产品申购
     */
    交易方向_产品申购(BussinessDictCode.交易方向, "C2", "产品申购"),
    /**
     * 份额强增
     */
    交易方向_份额强增(BussinessDictCode.交易方向, "C3", "份额强增"),
    /**
     * 产品赎回
     */
    交易方向_产品赎回(BussinessDictCode.交易方向, "C4", "产品赎回"),
    /**
     * 产品到期
     */
    交易方向_产品到期(BussinessDictCode.交易方向,"C5","产品到期"),
    /**
     * 份额强减
     */
    交易方向_份额强减(BussinessDictCode.交易方向, "C6", "份额强减"),
    /**
     * 中间付息
     */
    交易方向_中间付息(BussinessDictCode.交易方向, "C7", "中间付息"),
    /**
     * 交易方向_产品除权登记
     */
    交易方向_产品除权登记(BussinessDictCode.交易方向, "C8", "产品除权登记"),
    /**
     * 产品现金分红
     */
    交易方向_产品现金分红(BussinessDictCode.交易方向, "C9", "产品现金分红"),
    /**
     * 产品红利转投
     */
    交易方向_产品红利转投(BussinessDictCode.交易方向, "C10", "产品红利转投"),
    /**
     * 产品付费
     */
    交易方向_产品付费(BussinessDictCode.交易方向, "C11", "产品付费"),
    // 一体化对应etliu start
    /**
     * 税费缴税
     */
    交易方向_税费缴税(BussinessDictCode.交易方向, "C12", "税费缴税"),
    /**
     * 税费退税
     */
    交易方向_税费退税(BussinessDictCode.交易方向, "C13", "税费退税"),
    // 一体化对应etliu end
    /**
     * 产品到期分红
     */
    交易方向_产品到期分红(BussinessDictCode.交易方向, "C14", "产品到期分红"),
    /**
     * 赎回收益确认
     */
    交易方向_赎回收益确认(BussinessDictCode.交易方向, "C15", "赎回收益确认"),
    /**
     * 行内
     */
    资产来源_行内(BussinessDictCode.资产来源, "01", "行内"),
    /**
     * 行内
     */
    资产来源_行外(BussinessDictCode.资产来源, "02", "行外"),
    /**
     * 正常
     */
    监督状态_正常(BussinessDictCode.监督状态, "NORMAL", "正常"),
    /**
     * 警告
     */
    监督状态_警告(BussinessDictCode.监督状态, "WARNING", "警告"),
    /**
     * 违规
     */
    监督状态_违规(BussinessDictCode.监督状态, "VIOLATION", "违规"),
    /**
     * 指标状态
     */
    指标_状态(BussinessDictCode.指标状态,"INF_KRI_STATUS","指标状态"),
    指标状态_预警(BussinessDictCode.指标状态,"1","预警"),
    指标状态_禁止(BussinessDictCode.指标状态,"3","禁止"),
    指标状态_异常(BussinessDictCode.指标状态,"4","异常"),
    /**
     * 单组合
     */
    组合层次_单组合(BussinessDictCode.组合层次, "01", "单组合"),
    /**
     * 组合包
     */
    组合层次_组合包(BussinessDictCode.组合层次, "02", "组合包"),
    /**
     * 实时
     */
    指标参数粒度_实时(BussinessDictCode.指标参数粒度, "01", "实时"),
    /**
     * 事后
     */
    指标参数粒度_事后(BussinessDictCode.指标参数粒度, "02", "事后"),
    /**
     * SQL
     */
    指标参数实现类型_SQL(BussinessDictCode.指标参数实现类型, "SQL", "SQL"),
    /**
     * 固定值
     */
    指标参数实现类型_固定值(BussinessDictCode.指标参数实现类型, "FIX", "固定值"),
    /**
     * 类名
     */
    指标参数实现类型_类名(BussinessDictCode.指标参数实现类型, "PLUGIN", "类名"),
    /**
     * 指令类型_银证转账_银转证
     */
    指令类型_银证转账_银转证(BussinessDictCode.指令类型, "1001", "银证转账-银转证"),
    /**
     * 指令类型_银证转账_证转银
     */
    指令类型_银证转账_证转银(BussinessDictCode.指令类型, "1002", "银证转账-证转银"),
    /**
     * 指令类型_费用支付
     */
    指令类型_费用支付(BussinessDictCode.指令类型, "03", "费用支付"),
    /**
     * 券商资产管理计划
     */
    计划类资产一级分类_券商资产管理计划(BussinessDictCode.计划类资产一级分类,"N01","券商资产管理计划"),
    /**
     * 信托产品
     */
    计划类资产一级分类_信托产品(BussinessDictCode.计划类资产一级分类,"N02","信托产品"),
    /**
     * 基金资产管理计划
     */
    计划类资产一级分类_基金资产管理计划(BussinessDictCode.计划类资产一级分类,"N03","基金资产管理计划"),
    /**
     * 期货资产管理计划
     */
    计划类资产一级分类_期货资产管理计划(BussinessDictCode.计划类资产一级分类,"N05","期货资产管理计划"),
    /**
     * 其他资产管理计划
     */
    计划类资产一级分类_其他资产管理计划(BussinessDictCode.计划类资产一级分类,"N06","其他资产管理计划"),
    /**
     * 保险资产管理计划
     */
    计划类资产一级分类_保险资产管理计划(BussinessDictCode.计划类资产一级分类,"N04","保险资产管理计划"),

     /**
     * 公募计划
     */
    计划类资产二级分类_公募计划(BussinessDictCode.计划类资产二级分类,"01","公募计划"),
    /**
     * 委托债券
     */
    计划类资产二级分类_委托债券(BussinessDictCode.计划类资产二级分类,"02","委托债券"),
    /**
     * 委托权益
     */
    计划类资产二级分类_委托权益(BussinessDictCode.计划类资产二级分类,"03","委托权益"),
    /**
     * 自主管理
     */
    计划类资产二级分类_自主管理(BussinessDictCode.计划类资产二级分类,"04","自主管理"),
    /**
     * 其他交易流通场所
     */
    交易流通市场_其他交易流通场所(BussinessDictCode.交易流通场所,"99","其他交易流通场所"),
    /**
     * 接口接入
     */
    生成方式_接口接入(BussinessDictCode.生成方式,"01","接口接入"),
    /**
     * 画面录入
     */
    生成方式_画面录入(BussinessDictCode.生成方式,"02","画面录入"),
    /**
     * 主动
     */
    管理方式_主动(BussinessDictCode.管理方式,"01","主动"),
    /**
     * 优先
     */
    购买结构_优先(BussinessDictCode.购买结构,"01","优先"),
    /**
     * 集合
     */
    资管计划属性_集合(BussinessDictCode.资管计划属性,"01","集合"),
    /**
     * 其他
     */
    资管计划属性_其他(BussinessDictCode.资管计划属性,"99","其他"),
    /**
     * 集合
     */
    委外投资属性_集合(BussinessDictCode.委外投资属性,"01","集合管理"),
    /**
     * 其他
     */
    管理方式_其他(BussinessDictCode.管理方式,"99","其他"),
    /**
     * 一级市场
     */
    交易市场_一级市场(BussinessDictCode.交易市场,"01","一级市场"),
    /**
     * 二级市场
     */
    交易市场_二级市场(BussinessDictCode.交易市场,"02","二级市场"),
    /**
     * 深圳证券交易所
     */
    交易场所_深圳证券交易所(BussinessDictCode.交易场所,"04","深圳证券交易所"),
    /**
     * 上海证券交易所
     */
    交易场所_上海证券交易所(BussinessDictCode.交易场所,"03","上海证券交易所"),
    /**
     * 场外
     */
    交易场所_场外(BussinessDictCode.交易场所,"09","场外"),
    /**
     * 银行间
     */
    交易场所_银行间(BussinessDictCode.交易场所,"01","银行间"),
    /**
     * 商业银行柜台市场
     */
    交易场所_商业银行柜台市场(BussinessDictCode.交易场所, "02", "商业银行柜台市场"),
    /**
     * 机构间私募系统
     */
    交易场所_机构间私募系统(BussinessDictCode.交易场所, "05", "机构间私募系统"),
    /**
     * 其他
     */
    交易场所_其他(BussinessDictCode.交易场所, "07", "其他"),
    /**
     * 人工
     */
    委托关闭方式__人工(BussinessDictCode.委托关闭方式,"01","人工"),
    /**
     * 自动
     */
    委托关闭方式__自动(BussinessDictCode.委托关闭方式,"02","自动"),
    /**
     * 删除
     */
    委托操作类型_删除(BussinessDictCode.委托操作类型,"01","删除"),
    /**
     * 修改
     */
    委托操作类型_修改(BussinessDictCode.委托操作类型,"02","修改"),
    /**
     * 撤回
     */
    委托操作类型_撤回(BussinessDictCode.委托操作类型,"03","撤回"),
    /**
     * 分发
     */
    委托操作类型_分发(BussinessDictCode.委托操作类型,"04","分发"),
    /**
     * 接收
     */
    委托操作类型_接收(BussinessDictCode.委托操作类型,"05","接收"),
    /**
     * 退回
     */
    委托操作类型_退回(BussinessDictCode.委托操作类型,"06","退回"),
    /**
     * 关闭
     */
    委托操作类型_关闭(BussinessDictCode.委托操作类型,"07","关闭"),
    /**
     * 完成
     */
    委托操作类型_完成(BussinessDictCode.委托操作类型,"08","完成"),
    /**
     * 取消完成
     */
    委托操作类型_取消完成(BussinessDictCode.委托操作类型,"09","取消完成"),
    /**
     * 新建
     */
    委托状态_新建(BussinessDictCode.委托状态,"01","新建"),
    /**
     * 待接收
     */
    委托状态_待接收(BussinessDictCode.委托状态,"02","待接收"),
    /**
     * 已接收
     */
    委托状态_已接收(BussinessDictCode.委托状态,"03","已接收"),
    /**
     * 已完成
     */
    委托状态_已完成(BussinessDictCode.委托状态,"04","已完成"),
    /**
     * 已退回
     */
    委托状态_已退回(BussinessDictCode.委托状态,"05","已退回"),
    /**
     * 已关闭
     */
    委托状态_已关闭(BussinessDictCode.委托状态,"06","已关闭"),
    /**
     * 已撤回
     */
    委托状态_已撤回(BussinessDictCode.委托状态,"07","已撤回"),
    /**
     * 待接收
     */
    委托接收状态_待接收(BussinessDictCode.委托状态,"02","待接收"),
    /**
     * 已接收
     */
    委托接收状态_已接收(BussinessDictCode.委托状态,"03","已接收"),
    /**
     * 已撤回
     */
    委托接收状态_已撤回(BussinessDictCode.委托状态,"07","已撤回"),
    /**
     * 待审批
     */
    委托状态_流程中(BussinessDictCode.委托状态,"08","流程中"),
    /**
     * 待分发
     */
    委托状态_待分发(BussinessDictCode.委托状态,"09","待分发"),

    /**
     * 已退回
     */
    委托接收状态_已退回(BussinessDictCode.委托状态,"05","已退回"),
    /**
     * 申赎及存续期确认
     */
    提醒类型_大分类_申赎及存续期确认(BussinessDictCode.提醒类型_大分类,"B02","申赎及存续期确认"),
    /**
     * 债券行权
     */
    提醒类型_大分类_债券行权(BussinessDictCode.提醒类型_大分类,"B03","债券行权"),
    /**
     * 债券覆盖
     */
    提醒类型_大分类_债券覆盖(BussinessDictCode.提醒类型_大分类,"B04","债券覆盖"),

    /**
     * 利率型提前3个月
     */
    提醒类型_小分类_计划类_利率型提前3个月 (BussinessDictCode.提醒类型_小分类,"S07","计划类（利率型）-提前3个月"),
    /**
     * 利率型提前1个月
     */
    提醒类型_小分类_计划类_利率型提前1个月 (BussinessDictCode.提醒类型_小分类,"S08","计划类（利率型）-提前1个月"),
    /**
     * 利率型提前5天
     */
    提醒类型_小分类_计划类_利率型提前5天 (BussinessDictCode.提醒类型_小分类,"S09","计划类（利率型）-提前5天"),
    /**
     * 货币型申购确认
     */
    提醒类型_小分类_基金类_货币型申购确认  (BussinessDictCode.提醒类型_小分类,"S10","基金类（货币型）申购确认 "),
    /**
     * 货币型赎回确认
     */
    提醒类型_小分类_基金类_货币型赎回确认 (BussinessDictCode.提醒类型_小分类,"S11","基金类（货币型）赎回确认 "),
    /**
     * 货币型回款确认
     */
    提醒类型_小分类_基金类_货币型回款确认 (BussinessDictCode.提醒类型_小分类,"S12","基金类（货币型）回款确认 "),
    /**
     * 净值型申购确认
     */
    提醒类型_小分类_基金类_净值型申购确认 (BussinessDictCode.提醒类型_小分类,"S13","基金类（净值型）申购确认 "),
    /**
     * 净值型赎回确认
     */
    提醒类型_小分类_基金类_净值型赎回确认 (BussinessDictCode.提醒类型_小分类,"S14","基金类（净值型）赎回确认 "),
    /**
     * 净值型回款确认
     */
    提醒类型_小分类_基金类_净值型回款确认 (BussinessDictCode.提醒类型_小分类,"S15","基金类（净值型）回款确认 "),
    /**
     * 净值型申购确认
     */
    提醒类型_小分类_计划类_净值型申购确认 (BussinessDictCode.提醒类型_小分类,"S16","计划类（净值型）申购确认 "),
    /**
     * 净值型赎回确认
     */
    提醒类型_小分类_计划类_净值型赎回确认 (BussinessDictCode.提醒类型_小分类,"S17","计划类（净值型）赎回确认 "),
    /**
     * 净值型回款确认
     */
    提醒类型_小分类_计划类_净值型回款确认 (BussinessDictCode.提醒类型_小分类,"S18","计划类（净值型）回款确认 "),

    /**
     * 计划类_利率型存续期
     */
    提醒类型_小分类_计划类_利率型存续期 (BussinessDictCode.提醒类型_小分类,"S21","计划类（利率型）存续期"),


    /**
     * 市场日历信息
     */
    共同业务类型_市场日历信息(BussinessDictCode.共同业务类型, "MST01", "市场日历信息"),
    /**
     * 风险权数管理
     */
    共同业务类型_风险权数管理(BussinessDictCode.共同业务类型, "FINPROD25", "风险权数管理"),
    /**
     * 金融产品
     */
    共同业务类型_金融产品(BussinessDictCode.共同业务类型,"01","金融产品"),
    /**
     * 债券估值行情信息
     */
    共同业务类型_债券估值行情信息(BussinessDictCode.共同业务类型, "MST02", "债券估值行情信息"),
    /**
     * 基金类估值行情信息
     */
    共同业务类型_基金类估值行情信息(BussinessDictCode.共同业务类型, "MST03", "基金类估值行情信息"),
    /**
     * 计划类（净值型）资产估值行情信息
     */
    共同业务类型_计划类_净值型_资产估值行情信息(BussinessDictCode.共同业务类型, "MST04", "计划类（净值型）资产估值行情信息"),
    /**
     * 汇率行情信息
     */
    共同业务类型_汇率行情信息(BussinessDictCode.共同业务类型, "MST05", "汇率行情信息"),
    /**
     * 利率行情信息
     */
    共同业务类型_利率行情信息(BussinessDictCode.共同业务类型, "MST06", "利率行情信息"),
    /**
     * 指数行情信息
     */
    共同业务类型_指数行情信息(BussinessDictCode.共同业务类型, "MST07", "指数行情信息"),
    /**
     * 收益率曲线信息
     */
    共同业务类型_收益率曲线信息(BussinessDictCode.共同业务类型, "MST08", "收益率曲线信息"),
    /**
     * 资金账户管理
     */
    共同业务类型_资金账户管理(BussinessDictCode.共同业务类型, "MST09", "资金账户管理"),
    /**
     * 证券账户管理
     */
    共同业务类型_证券账户管理(BussinessDictCode.共同业务类型, "MST10", "证券账户管理"),
    /**
     * 业绩基准管理
     */
    共同业务类型_业绩基准管理(BussinessDictCode.共同业务类型, "MST11", "业绩基准管理"),
    /**
     * 自然人管理
     */
    共同业务类型_自然人管理(BussinessDictCode.共同业务类型, "MST12", "自然人管理"),
    /**
     * 市场机构管理
     */
    共同业务类型_市场机构管理(BussinessDictCode.共同业务类型, "MST13", "市场机构管理"),
    /**
     * 客户性质管理
     */
    共同业务类型_客户性质管理(BussinessDictCode.共同业务类型, "MST14", "客户性质管理"),
    /**
     * 交易对手管理
     */
    共同业务类型_交易对手管理(BussinessDictCode.共同业务类型, "MST15", "交易对手管理"),
    /**
     * 费用品种管理
     */
    共同业务类型_费用品种管理(BussinessDictCode.共同业务类型, "MST16", "费用品种管理"),
    /**
     * 日历类型管理
     */
    共同业务类型_日历类型管理(BussinessDictCode.共同业务类型, "MST17", "日历类型管理"),
    /**
     * OPICS参数维护
     */
    共同业务类型_OPICS参数维护(BussinessDictCode.共同业务类型, "MST18", "OPICS参数维护"),
    /**
     * 复合基准
     */
    共同业务类型_复合基准(BussinessDictCode.共同业务类型, "MST19", "复合基准"),
    /**
     * 资金后台管理
     */
    共同业务类型_资金后台管理(BussinessDictCode.共同业务类型, "STL01", "资金后台管理"),
    /**
     * 流入资金核对
     */
    共同业务类型_流入资金核对(BussinessDictCode.共同业务类型, "STL02", "流入资金核对"),
    /**
     * 流出资金核对
     */
    共同业务类型_流出资金核对(BussinessDictCode.共同业务类型, "STL03", "流出资金核对"),
    /**
     * DVP清算指令管理
     */
    共同业务类型_DVP清算指令管理(BussinessDictCode.共同业务类型, "STL04", "DVP清算指令管理"),
    /**
     * 清算指令管理
     */
    共同业务类型_清算指令管理(BussinessDictCode.共同业务类型, "STL05", "清算指令管理"),
    /**
     * 银行间交易费用设置
     */
    共同业务类型_银行间交易费用设置(BussinessDictCode.共同业务类型, "MST20", "银行间交易费用设置"),
    /**
     * 风险试算
     */
    共同业务类型_风险试算(BussinessDictCode.共同业务类型, "RSK01", "风险试算"),
    /**
     * 授权管理
     */
    共同业务类型_授权管理(BussinessDictCode.共同业务类型, "RSK02", "授权管理"),
    /**
     * 主体授信额度管理
     */
    共同业务类型_主体授信额度管理(BussinessDictCode.共同业务类型, "RSK03", "主体授信额度管理"),
    /**
     * 授信额度调整
     */
    共同业务类型_授信额度调整(BussinessDictCode.共同业务类型, "RSK04", "授信额度调整"),
    /**
     * 额度扣减规则管理
     */
    共同业务类型_额度扣减规则管理(BussinessDictCode.共同业务类型, "RSK05", "额度扣减规则管理"),
    /**
     * 限额指标参数管理
     */
    共同业务类型_限额指标参数管理(BussinessDictCode.共同业务类型, "RSK06", "限额指标参数管理"),
    /**
     * 限额指标表达式管理
     */
    共同业务类型_限额指标表达式管理(BussinessDictCode.共同业务类型, "RSK07", "限额指标表达式管理"),
    /**
     * 限额监督指标管理
     */
    共同业务类型_限额监督指标管理(BussinessDictCode.共同业务类型, "RSK08", "限额监督指标管理"),
    /**
     * 限额组合关联监督指标管理
     */
    共同业务类型_限额组合关联监督指标管理(BussinessDictCode.共同业务类型, "RSK09", "限额组合关联监督指标管理"),
    /**
     * 估值表指标结构映射
     */
    共同业务类型_估值表指标结构映射(BussinessDictCode.共同业务类型, "RSK10", "估值表指标结构映射"),
    /**
     * 估值表资产科目映射
     */
    共同业务类型_估值表资产科目映射(BussinessDictCode.共同业务类型, "RSK11", "估值表资产科目映射"),
    /**
     * 估值表汇总科目映射
     */
    共同业务类型_估值表汇总科目映射(BussinessDictCode.共同业务类型, "RSK12", "估值表汇总科目映射"),
    /**
     * 估值表关联导入映射
     */
    共同业务类型_估值表关联导入映射(BussinessDictCode.共同业务类型, "RSK13", "估值表关联导入映射"),
    /**
     * 估值表导入管理
     */
    共同业务类型_估值表导入管理(BussinessDictCode.共同业务类型, "RSK14", "估值表导入管理"),
    /**
     * 估值表底层资产映射
     */
    共同业务类型_估值表底层资产映射(BussinessDictCode.共同业务类型, "RSK15", "估值表底层资产映射"),
    /**
     * 机构授信
     */
    共同业务类型_机构授信(BussinessDictCode.共同业务类型, "RSK16", "机构授信"),
    /**
     * 资产授信
     */
    共同业务类型_资产授信(BussinessDictCode.共同业务类型, "RSK17", "资产授信"),
    /**
     * 资产系列授信
     */
    共同业务类型_资产系列授信(BussinessDictCode.共同业务类型, "RSK18", "资产系列授信"),
    /**
     * 佣金设置
     */
    共同业务类型_佣金设置(BussinessDictCode.共同业务类型, "MST21", "交易所交易费用设置"),
    /**
     * 预占用管理
     */
    共同业务类型_预占用管理(BussinessDictCode.共同业务类型, "RSK19", "预占用管理"),
    /**
     * 组合管理
     */
    共同业务类型_组合管理(BussinessDictCode.共同业务类型, "PTL01", "组合管理"),
    /**
     * 用户组合管理
     */
    共同业务类型_用户组合管理(BussinessDictCode.共同业务类型, "PTL02", "用户组合管理"),
    /**
     * 活期结息
     */
    共同业务类型_活期结息(BussinessDictCode.共同业务类型, "PTL03", "活期结息"),
    /**
     * 自定义现金流
     */
    共同业务类型_自定义现金流(BussinessDictCode.共同业务类型, "PTL04", "自定义现金流"),
    /**
     * 资金划拨管理
     */
    共同业务类型_资金划拨管理(BussinessDictCode.共同业务类型, "PTL05", "资金划拨管理"),
    /**
     * 账户活期利率管理
     */
    共同业务类型_账户活期利率管理(BussinessDictCode.共同业务类型, "PTL06", "账户活期利率管理"),
    /**
     * 自动指令分发（交易主管）
     */
    共同业务类型_自动指令分发_交易主管_(BussinessDictCode.共同业务类型, "TRD01", "自动指令分发（交易主管）"),
    /**
     * 债券投资交易
     */
    共同业务类型_债券投资交易(BussinessDictCode.共同业务类型, "TRD02", "债券投资交易"),
    /**
     * 拆借投资交易
     */
    共同业务类型_拆借投资交易(BussinessDictCode.共同业务类型, "TRD03", "拆借投资交易"),
    /**
     * 存款类资产投资交易
     */
    共同业务类型_存款类资产投资交易(BussinessDictCode.共同业务类型, "TRD04", "存款类资产投资交易"),
    /**
     * 基金类资产投资交易
     */
    共同业务类型_基金类资产投资交易(BussinessDictCode.共同业务类型, "TRD05", "基金类资产投资交易"),
    /**
     * 计划类资产（净值型）投资交易
     */
    共同业务类型_计划类资产_净值型_投资交易(BussinessDictCode.共同业务类型, "TRD06", "计划类资产（净值型）投资交易"),
    /**
     * 计划类资产（利率型）投资交易
     */
    共同业务类型_计划类资产_利率型_投资交易(BussinessDictCode.共同业务类型, "TRD07", "计划类资产（利率型）投资交易"),
    /**
     * 回购投资交易
     */
    共同业务类型_回购投资交易(BussinessDictCode.共同业务类型, "TRD08", "回购投资交易"),
    /**
     * 项目类资产投资交易
     */
    共同业务类型_项目类资产投资交易(BussinessDictCode.共同业务类型, "TRD09", "项目类资产投资交易"),
    /**
     * 债券存续期交易
     */
    共同业务类型_债券存续期交易(BussinessDictCode.共同业务类型, "TRD10", "债券存续期交易"),
    /**
     * 拆借存续期交易
     */
    共同业务类型_拆借存续期交易(BussinessDictCode.共同业务类型, "TRD11", "拆借存续期交易"),
    /**
     * 存款类资产存续期交易
     */
    共同业务类型_存款类资产存续期交易(BussinessDictCode.共同业务类型, "TRD12", "存款类资产存续期交易"),
    /**
     * 净值型资产存续期交易
     */
    共同业务类型_净值型资产存续期交易(BussinessDictCode.共同业务类型, "TRD13", "净值型资产存续期交易"),
    /**
     * 基金存续期交易
     */
    共同业务类型_基金存续期交易(BussinessDictCode.共同业务类型, "TRD14", "基金存续期交易"),
    /**
     * 计划类资产（利率型）存续期交易
     */
    共同业务类型_计划类资产_利率型_存续期交易(BussinessDictCode.共同业务类型, "TRD15", "计划类资产（利率型）存续期交易"),
    /**
     * 回购存续期交易
     */
    共同业务类型_回购存续期交易(BussinessDictCode.共同业务类型, "TRD16", "回购存续期交易"),
    /**
     * 买断式回购投资交易
     */
    共同业务类型_买断式回购投资交易(BussinessDictCode.共同业务类型, "TRD48", "买断式回购投资交易"),
    /**
     * 买断式回购存续期交易
     */
    共同业务类型_买断式回购存续期交易(BussinessDictCode.共同业务类型, "TRD49","买断式回购存续期交易"),
    /**
     * 项目类资产存续期交易
     */
    共同业务类型_项目类资产存续期交易(BussinessDictCode.共同业务类型, "TRD17", "项目类资产存续期交易"),
    /**
     * 逾期资产管理
     */
    共同业务类型_逾期资产管理(BussinessDictCode.共同业务类型, "TRD18", "逾期资产管理"),
    /**
     * 债券买入
     */
    共同业务类型_债券买入(BussinessDictCode.共同业务类型, "TRD19", "债券买入"),
    /**
     * 债券一级投标委托
     */
    共同业务类型_债券一级投标委托(BussinessDictCode.共同业务类型, "ETR18", "债券一级投标委托"),
    /**
     * 债券卖出
     */
    共同业务类型_债券卖出(BussinessDictCode.共同业务类型, "TRD20", "债券卖出"),
    /**
     * 拆入交易
     */
    共同业务类型_拆入交易(BussinessDictCode.共同业务类型, "TRD22", "拆入交易"),
    /**
     * 特拆交易
     */
    共同业务类型_特拆交易(BussinessDictCode.共同业务类型, "TRD23", "特拆交易"),
    /**
     * 拆出交易
     */
    共同业务类型_拆出交易(BussinessDictCode.共同业务类型, "TRD24", "拆出交易"),
    /**
     * 项目类资产买入
     */
    共同业务类型_项目类资产买入(BussinessDictCode.共同业务类型, "TRD25", "项目类资产买入"),
    /**
     * 项目类资产卖出
     */
    共同业务类型_项目类资产卖出(BussinessDictCode.共同业务类型, "TRD26", "项目类资产卖出"),
    /**
     * 资产存续期交易
     */
    共同业务类型_资产存续期交易(BussinessDictCode.共同业务类型, "TRD46", "资产存续期交易"),
    /**
     * 投资委托管理
     */
    共同业务类型_投资委托管理(BussinessDictCode.共同业务类型, "ETR01", "投资委托管理"),
    /**
     * 债券投资委托
     */
    共同业务类型_债券投资委托(BussinessDictCode.共同业务类型, "ETR02", "债券投资委托"),
    /**
     * 拆借投资委托
     */
    共同业务类型_拆借投资委托(BussinessDictCode.共同业务类型, "ETR03", "拆借投资委托"),
    /**
     * 存款类资产投资委托
     */
    共同业务类型_存款类资产投资委托(BussinessDictCode.共同业务类型, "ETR04", "存款类资产投资委托"),
    /**
     * 基金类资产投资委托
     */
    共同业务类型_基金类资产投资委托(BussinessDictCode.共同业务类型, "ETR05", "基金类资产投资委托"),
    /**
     * 计划类资产（净值型）投资委托
     */
    共同业务类型_计划类资产_净值型_投资委托(BussinessDictCode.共同业务类型, "ETR06", "计划类资产（净值型）投资委托"),
    /**
     * 计划类资产（利率型）投资委托
     */
    共同业务类型_计划类资产_利率型_投资委托(BussinessDictCode.共同业务类型, "ETR07", "计划类资产（利率型）投资委托"),
    /**
     * 回购投资委托
     */
    共同业务类型_回购投资委托(BussinessDictCode.共同业务类型, "ETR08", "回购投资委托"),
    /**
     * 项目类资产投资委托
     */
    共同业务类型_项目类资产投资委托(BussinessDictCode.共同业务类型, "ETR09", "项目类资产投资委托"),
    /**
     * 项目类资产投资委托
     */
    共同业务类型_计划类资产_货币型_投资委托(BussinessDictCode.共同业务类型, "ETR10", "计划类资产（货币型）投资委托"),
    /**
     * 债券类资产管理
     */
    共同业务类型_债券类资产管理(BussinessDictCode.共同业务类型, "FINASSET01", "债券类资产管理"),
    /**
     * 存款类资产管理
     */
    共同业务类型_存款类资产管理(BussinessDictCode.共同业务类型, "FINASSET02", "存款类资产管理"),
    /**
     * 基金类资产管理
     */
    共同业务类型_基金类资产管理(BussinessDictCode.共同业务类型, "FINASSET03", "基金类资产管理"),
    /**
     * 计划类资产（净值型）资产管理
     */
    共同业务类型_计划类资产_净值型_资产管理(BussinessDictCode.共同业务类型, "FINASSET04", "计划类资产（净值型）资产管理"),
    /**
     * 计划类资产（利率型）资产管理
     */
    共同业务类型_计划类资产_利率型_资产管理(BussinessDictCode.共同业务类型, "FINASSET05", "计划类资产（利率型）资产管理"),
    /**
     * 项目类资产管理
     */
    共同业务类型_项目类资产管理(BussinessDictCode.共同业务类型, "FINASSET06", "项目类资产管理"),

    /**
     * 债券类资产利率调整
     */
    共同业务类型_债券类资产利率调整(BussinessDictCode.共同业务类型, "FINASSET07", "债券类资产利率调整"),
    /**
     * 存款类资产利率调整
     */
    共同业务类型_存款类资产利率调整(BussinessDictCode.共同业务类型, "FINASSET08", "存款类资产利率调整"),
    /**
     * 计划类资产利率调整
     */
    共同业务类型_计划类资产利率调整(BussinessDictCode.共同业务类型, "FINASSET09", "计划类资产利率调整"),
    /**
     * 项目类资产利率调整
     */
    共同业务类型_项目类资产利率调整(BussinessDictCode.共同业务类型, "FINASSET10", "项目类资产利率调整"),
    /**
     * 项目类资产利率调整
     */
    共同业务类型_计划类资产_货币型_资产管理(BussinessDictCode.共同业务类型, "FINASSET11", "计划类资产（货币型）资产管理"),
    /**
     * 通道管理
     */
    共同业务类型_通道管理(BussinessDictCode.共同业务类型, "FINASSET12", "通道管理"),
    /**
     * 通道利率调整
     */
    共同业务类型_通道利率调整(BussinessDictCode.共同业务类型, "FINASSET15", "通道利率调整"),
    /**
     * 通道费用支付
     */
    共同业务类型_通道费用支付(BussinessDictCode.共同业务类型, "FINASSET14", "通道费用支付"),
    /**
     * 信息披露模板管理
     */
    共同业务类型_信息披露模板管理(BussinessDictCode.共同业务类型, "FINPROD01", "信息披露模板管理"),
    /**
     * 产品要素模板管理
     */
    共同业务类型_产品要素模板管理(BussinessDictCode.共同业务类型, "FINPROD02", "产品要素模板管理"),
    /**
     * 产品排期管理
     */
    共同业务类型_产品排期管理(BussinessDictCode.共同业务类型, "FINPROD03", "产品排期管理"),
    /**
     * 产品要素管理
     */
    共同业务类型_产品要素管理(BussinessDictCode.共同业务类型, "FINPROD04", "产品要素管理"),
    /**
     * 产品报价管理
     */
    共同业务类型_产品报价管理(BussinessDictCode.共同业务类型, "FINPROD05", "产品报价管理"),
    /**
     * 产品费率报价管理
     */
    共同业务类型_产品费率报价管理(BussinessDictCode.共同业务类型, "FINPROD06", "产品费率报价管理"),
    /**
     * 产品业绩基准报价管理
     */
    共同业务类型_产品业绩基准报价管理(BussinessDictCode.共同业务类型, "FINPROD07", "产品业绩基准报价管理"),
    /**
     * 浮动管理费报价管理
     */
    共同业务类型_浮动管理费报价管理(BussinessDictCode.共同业务类型, "FINPROD08", "浮动管理费报价管理"),
    /**
     * 开放计划调整
     */
    共同业务类型_开放计划调整(BussinessDictCode.共同业务类型, "FINPROD09", "开放计划调整"),
    /**
     * 付息计划调整
     */
    共同业务类型_付息计划调整(BussinessDictCode.共同业务类型, "FINPROD10", "付息计划调整"),
    /**
     * 付费计划调整
     */
    共同业务类型_付费计划调整(BussinessDictCode.共同业务类型, "FINPROD24", "付费计划调整"),
    /**
     * 到期日调整
     */
    共同业务类型_到期日调整(BussinessDictCode.共同业务类型, "FINPROD11", "到期日调整"),
    /**
     * 付息日调整
     */
    共同业务类型_付息日调整(BussinessDictCode.共同业务类型, "FINPROD12", "付息日调整"),
    /**
     * 公告及产品说明书管理
     */
    共同业务类型_公告及产品说明书管理(BussinessDictCode.共同业务类型, "FINPROD13", "公告及产品说明书管理"),
    /**
     * 产品成立管理
     */
    共同业务类型_产品成立管理(BussinessDictCode.共同业务类型, "FINPROD14", "产品成立管理"),
    /**
     * 强增强减管理
     */
    共同业务类型_强增强减管理(BussinessDictCode.共同业务类型, "FINPROD15", "强增强减管理"),
    /**
     * 中间付息管理
     */
    共同业务类型_中间付息管理(BussinessDictCode.共同业务类型, "FINPROD16", "中间付息管理"),
    /**
     * 产品到期管理
     */
    共同业务类型_产品到期管理(BussinessDictCode.共同业务类型, "FINPROD17", "产品到期管理"),
    /**
     * 净值型产品分红方案管理
     */
    共同业务类型_净值型产品分红方案管理(BussinessDictCode.共同业务类型, "FINPROD18", "净值型产品分红方案管理"),
    /**
     * 产品费用支付管理
     */
    共同业务类型_产品费用支付管理(BussinessDictCode.共同业务类型, "FINPROD19", "产品费用支付管理"),
    /**
     * 产品申购
     */
    共同业务类型_产品申购(BussinessDictCode.共同业务类型, "FINPROD20", "产品申购"),
    /**
     * 产品赎回
     */
    共同业务类型_产品赎回(BussinessDictCode.共同业务类型, "FINPROD21", "产品赎回"),
    /**
     * 申报附件方案管理
     */
    共同业务类型_申报附件方案管理(BussinessDictCode.共同业务类型, "FINPROD23", "申报附件方案管理"),
    /**
     * 存款录入
     */
    共同业务类型_存款录入(BussinessDictCode.共同业务类型,"TRD21", "存款录入"),
    /**
     * 计划类（货币型）投资交易
     */
    共同业务类型_计划类_货币型_投资交易(BussinessDictCode.共同业务类型,"TRD47", "计划类（货币型）投资交易"),
    /**
     * 计划类（货币型）存续期
     */
    共同业务类型_计划类_货币型_存续期(BussinessDictCode.共同业务类型,"TRD50", "计划类（货币型）存续期"),
    /**
     * 未行权
     */
    行权状态_未行权(BussinessDictCode.行权状态,"01","未行权"),
    /**
     * 未行权
     */
    行权状态_已行权(BussinessDictCode.行权状态,"02","已行权"),

    /**
     * 托管流水借贷方向_借
     */
    托管流水借贷方向_借(BussinessDictCode.托管流水借贷方向,"01","借"),

    /**
     * 托管流水借贷方向_贷
     */
    托管流水借贷方向_贷(BussinessDictCode.托管流水借贷方向,"02","贷"),

    /**
     * 项目类资产
     */
    金融产品类型_项目类资产(BussinessDictCode.金融产品类型,"F18","项目类资产"),
    /**
     * 计划类资产
     */
    金融产品类型_计划类资产(BussinessDictCode.金融产品类型,"F17","计划类资产"),
    /**
     * 债券(投管用)
     */
    金融产品类型_投管用_债券(BussinessDictCode.金融产品类型_投管用,"F01","债券"),

    /**
     * 金融产品类型_投管用_债券买断式正回购
     */
    金融产品类型_投管用_债券买断式正回购(BussinessDictCode.金融产品类型_投管用, "F04", "债券买断式正回购"),

    /**
     * 金融产品类型_投管用_债券买断式逆回购
     */
    金融产品类型_投管用_债券买断式逆回购(BussinessDictCode.金融产品类型_投管用, "F05", "债券买断式逆回购"),

    /**
     *理财产品 (投管用)
     */
    金融产品类型_投管用_理财产品(BussinessDictCode.金融产品类型_投管用,"F16","理财产品"),
    /**
     * 存款(投管用)
     */
    金融产品类型_投管用_存款(BussinessDictCode.金融产品类型_投管用,"F07","存款"),
    /**
     * 一级投标债券(投管用)
     */
    金融产品类型_投管用_一级投标债券(BussinessDictCode.金融产品类型_投管用,"F32","一级投标债券"),
    /**
     * 固定管理费(投管用)
     */
    金融产品类型_投管用_固定管理费(BussinessDictCode.金融产品类型_投管用, "C03", "固定管理费"),
    /**
     * 浮动管理费(投管用)
     */
    金融产品类型_投管用_浮动管理费(BussinessDictCode.金融产品类型_投管用, "C04", "浮动管理费"),
    /**
     * 托管费(投管用)
     */
    金融产品类型_投管用_托管费(BussinessDictCode.金融产品类型_投管用, "C05", "托管费"),
    /**
     * 销售费(投管用)
     */
    金融产品类型_投管用_销售费(BussinessDictCode.金融产品类型_投管用, "C06", "销售费"),
    /**
     * 税额(投管用)
     */
    金融产品类型_投管用_税额(BussinessDictCode.金融产品类型_投管用, "C07", "税额"),
    /**
     * 代销费(投管用)
     */
    金融产品类型_投管用_代销费(BussinessDictCode.金融产品类型_投管用, "C10", "代销费"),
    /**
     * 债券质押式逆回购
     */
    金融产品类型_投管用_债券质押式逆回购(BussinessDictCode.金融产品类型_投管用,"F03","债券质押式逆回购"),
    /**
     * 债券质押式正回购
     */
    金融产品类型_投管用_债券质押式正回购(BussinessDictCode.金融产品类型_投管用,"F02","债券质押式正回购"),
    /**
     * 拆出
     */
    金融产品类型_投管用_拆出(BussinessDictCode.金融产品类型_投管用,"F09","拆出"),
    /**
     * 拆入
     */
    金融产品类型_投管用_拆入(BussinessDictCode.金融产品类型_投管用,"F08","拆入"),
    /**
     * 特拆拆入
     */
    金融产品类型_投管用_特拆拆入(BussinessDictCode.金融产品类型_投管用,"F25","特拆拆入"),
    /**
     * 理财子产品
     */
    金融产品类型_投管用_理财子产品(BussinessDictCode.金融产品类型_投管用,"F26","理财子产品"),
    /**
     * 项目类资产
     */
    金融产品类型_投管用_项目类资产(BussinessDictCode.金融产品类型_投管用,"F18","项目类资产"),
    /**
     * 自定义现金流
     */
    金融产品类型_投管用_自定义现金流(BussinessDictCode.金融产品类型_投管用,"F23","自定义现金流"),

    /**
     * 理财产品分层
     */
    金融产品类型_投管用_理财产品分层(BussinessDictCode.金融产品类型_投管用,"F24","理财产品分层"),

    /**
     * 清算操作类型_新建
     */
    清算操作类型_新建(BussinessDictCode.清算操作类型,"01","新建"),
    /**
     * 清算操作类型_撤销
     */
    清算操作类型_撤销(BussinessDictCode.清算操作类型,"03","撤销"),

    /**
     * 中间收息
     */
    现金流类型_中间收息(BussinessDictCode.现金流类型,"01","中间收息"),
    /**
     * 中间还本
     */
    现金流类型_中间还本(BussinessDictCode.现金流类型,"02","中间还本"),
    /**
     * 到期还本
     */
    现金流类型_到期还本(BussinessDictCode.现金流类型,"03","到期还本"),
    /**
     * 到期收息
     */
    现金流类型_到期收息(BussinessDictCode.现金流类型,"04","到期收息"),
    /**
     * 费用支付
     */
    现金流类型_费用支付(BussinessDictCode.现金流类型,"05","费用支付"),
    /**
     * 已结算
     */
    结算状态_已结算(BussinessDictCode.结算状态,"01","已结算"),
    /**
     * 未结算
     */
    结算状态_未结算(BussinessDictCode.结算状态,"02","未结算"),
    /**
     * 质押式协议回购
     */
    回购类型_质押式协议回购(BussinessDictCode.回购类型,"H01","质押式协议回购"),
    /**
     * 质押式竞价回购
     */
    回购类型_质押式竞价回购(BussinessDictCode.回购类型,"H02","质押式竞价回购"),
    /**
     * 回购类型_买断式回购
     */
    回购类型_买断式回购(BussinessDictCode.回购类型,"H03","买断式回购"),
    /**
     * 债券
     */
    收益类型_净值(BussinessDictCode.收益类型,"01","净值"),
    /**
     * 预期收益
     */
    收益类型_预期收益(BussinessDictCode.收益类型,"02","预期收益"),
    /**
     * 分层类型_金额分层
     */
    分层类型_金额分层(BussinessDictCode.分层类型,"01","金额分层"),
    /**
     * 分层类型_期限分层
     */
    分层类型_期限分层(BussinessDictCode.分层类型,"02","期限分层"),
    /**
     * 分层类型_客户类型
     */
    分层类型_客户类型(BussinessDictCode.分层类型,"03","客户类型"),

 // 一体化对应etliu start
//    /**
//     * 手工维护
//     */
//    录入方式_手工维护(BussinessDictCode.录入方式,"02","手工维护"),
//    /**
//     *外部接入
//     */
//    录入方式_外部接入(BussinessDictCode.录入方式,"01","外部接入"),
    /**
     * 手工录入
     */
    录入方式_手工录入(BussinessDictCode.录入方式,"01","手工录入"),
    /**
     * 批处理
     */
    录入方式_批处理(BussinessDictCode.录入方式,"04","批处理生成"),
    /**
     *接口导入
     */
    录入方式_接口导入(BussinessDictCode.录入方式,"05","接口导入"),
 // 一体化对应etliu end

    /**
     * 债券
     */
    金融产品类型_债券(BussinessDictCode.金融产品类型,"F01","债券"),
    /**
     * 债券质押式正回购
     */
    金融产品类型_债券质押式正回购(BussinessDictCode.金融产品类型,"F02","债券质押式正回购"),
    /**
     * 债券质押式逆回购
     */
    金融产品类型_债券质押式逆回购(BussinessDictCode.金融产品类型,"F03","债券质押式逆回购"),
    /**
     * 债券买断式正回购
     */
    金融产品类型_债券买断式正回购(BussinessDictCode.金融产品类型,"F04","债券买断式正回购"),
    /**
     * 债券买断式逆回购
     */
    金融产品类型_债券买断式逆回购(BussinessDictCode.金融产品类型,"F05","债券买断式逆回购"),
    /**
     * 存款
     */
    金融产品类型_存款(BussinessDictCode.金融产品类型,"F07","存款"),
    /**
     * 拆入
     */
    金融产品类型_拆入(BussinessDictCode.金融产品类型,"F08","拆入"),
    /**
     * 拆出
     */
    金融产品类型_拆出(BussinessDictCode.金融产品类型,"F09","拆出"),
    /**
     * 股票
     */
    金融产品类型_股票(BussinessDictCode.金融产品类型,"F10","股票"),
    /**
     * 货币
     */
    收益类型_货币(BussinessDictCode.收益类型,"03","货币"),
    /**
     * 是
     */
    是否_是(BussinessDictCode.是否,"Y","是"),
    /**
     * 否
     */
    是否_否(BussinessDictCode.是否,"N","否"),
    /**
     * 自然人
     */
    客户类型_自然人(BussinessDictCode.客户类型,"02","自然人"),
    /**
     * 企业法人
     */
    客户类型_企业法人(BussinessDictCode.客户类型,"01","企业法人"),
    /**
     * 发行人
     */
    客户性质_发行人(BussinessDictCode.客户性质,"01","发行人"),
    /**
     * 融资人
     */
    客户性质_融资人(BussinessDictCode.客户性质,"02","融资人"),
    /**
     * 管理人
     */
    客户性质_管理人(BussinessDictCode.客户性质,"03","管理人"),
    /**
     * 托管人
     */
    客户性质_托管人(BussinessDictCode.客户性质,"04","托管人"),
    /**
     * 担保人
     */
    客户性质_担保人(BussinessDictCode.客户性质,"05","担保人"),
    /**
     * 担保人
     */
    客户性质_承销商(BussinessDictCode.客户性质,"07","承销商"),
    /**
     * 担保人
     */
    客户性质_存放行(BussinessDictCode.客户性质,"08","存放行"),
    /**
     * 担保人
     */
    客户性质_投资顾问(BussinessDictCode.客户性质,"09","投资顾问"),
    /**
     * 担保人
     */
    客户性质_出质人(BussinessDictCode.客户性质,"06","出质人"),

    /**
     * 按单位分红
     */
    分红方案_按单位分红(BussinessDictCode.分红方案,"01","按单位分红"),
    /**
     * 基金(投管用)
     */
    金融产品类型_投管用_基金(BussinessDictCode.金融产品类型_投管用,"F06","基金"),
    /**
     * 计划类资产(投管用)
     */
    金融产品类型_投管用_计划类资产(BussinessDictCode.金融产品类型_投管用,"F17","计划类资产"),
    /**
     * 货币基金
     */
     基金类资产类型_货币基金(BussinessDictCode.基金类资产类型,"F01","货币基金"),
    /**
     * 非货币基金
     */
    基金类资产类型_非货币基金(BussinessDictCode.基金类资产类型,"F02","非货币基金"),
    /**
     * 基金
     */
    金融产品类型_基金(BussinessDictCode.金融产品类型,"F06","基金"),
    /**
     * 美元
     */
    币种_美元(BussinessDictCode.币种,"USD","美元"),
    /**
     * 澳大利亚元
     */
    币种_澳大利亚元(BussinessDictCode.币种,"AUD","澳大利亚元"),
    /**
     * 加拿大元
     */
    币种_加拿大元(BussinessDictCode.币种,"CAD","加拿大元"),
    /**
     * 男
     */
    性别_男(BussinessDictCode.性别,"M","男"),
    /**
     * 女
     */
    性别_女(BussinessDictCode.性别,"W","女"),
    /**
     * 分红方式_现金分红
     */
     分红方式_现金分红(BussinessDictCode.分红方式,"01","现金分红"),
     /**
      * 分红方式_红利再投
      */
      分红方式_红利再投(BussinessDictCode.分红方式,"02","红利再投"),
      /**
       * 交易对手类型_市场机构
       */
      交易对手类型_市场机构(BussinessDictCode.交易对手类型, "01", "市场机构"),
      /**
       * 交易对手类型_资管产品
       */
     交易对手类型_资管产品(BussinessDictCode.交易对手类型, "02", "资管产品"),
    /**
     * 交易对手类型_分行
     */
    交易对手类型_分行(BussinessDictCode.交易对手类型, "04", "分行"),
    /**
     * 交易对手类型_内部交易对手
     */
    交易对手类型_内部交易对手(BussinessDictCode.交易对手类型, "05", "内部交易对手"),
    /**
     * 交易对手类型_通道计划
     */
    交易对手类型_通道计划(BussinessDictCode.交易对手类型, "03", "通道计划"),
    /**
     * 报告主文件
     */
    附件类型_报告主文件(BussinessDictCode.附件类型,"01","报告主文件"),
    /**
     * 静态模板
     */
    模板类型_静态模板(BussinessDictCode.模板类型,"01","静态模板"),
    /**
     * 资产买入
     */
    资金流动类型_资产买入(BussinessDictCode.资金流动类型,"01","资产买入"),
    /**
     * 资产卖出或到期
     */
    资金流动类型_资产卖出或到期(BussinessDictCode.资金流动类型,"02","资产卖出或到期"),
    /**
     * 银行存款到期
     */
    资金流动类型_银行存款到期(BussinessDictCode.资金流动类型,"04","银行存款到期"),
    /**
     * 拆出和逆回购首期
     */
    资金流动类型_拆出和逆回购首期(BussinessDictCode.资金流动类型,"05","拆出和逆回购首期"),
    /**
     * 拆入和正回购首期
     */
    资金流动类型_拆入和正回购首期(BussinessDictCode.资金流动类型,"06","拆入和正回购首期"),
    /**
     * 拆出和逆回购到期
     */
    资金流动类型_拆出和逆回购到期(BussinessDictCode.资金流动类型,"07","拆出和逆回购到期"),
    /**
     * 拆入和正回购到期
     */
    资金流动类型_拆入和正回购到期(BussinessDictCode.资金流动类型,"08","拆入和正回购到期"),
    /**
     * 投资资产所得收益
     */
    资金流动类型_投资资产所得收益(BussinessDictCode.资金流动类型,"09","投资资产所得收益"),
    /**
     * 投资资产支出
     */
    资金流动类型_投资资产支出(BussinessDictCode.资金流动类型,"10","投资资产支出"),
    /**
     * 其他收入
     */
    资金流动类型_其他收入(BussinessDictCode.资金流动类型,"11","其他收入"),
    /**
     * 其他支出
     */
    资金流动类型_其他支出(BussinessDictCode.资金流动类型,"12","其他支出"),
    /**
     * 存入银行存款
     */
    资金流动类型_存入银行存款(BussinessDictCode.资金流动类型,"03","存入银行存款"),
    /**
     * 本金
     */
    现金流一级类型_本金(BussinessDictCode.现金流一级类型,"01","本金"),
    /**
     * 利息
     */
    现金流一级类型_利息(BussinessDictCode.现金流一级类型,"02","利息"),
    /**
     * 费用
     */
    现金流一级类型_费用(BussinessDictCode.现金流一级类型,"03","费用"),
    /**
     * 税额
     */
    现金流一级类型_税额(BussinessDictCode.现金流一级类型,"04","税额"),
    /**
     * 本金
     */
    现金流二级类型_本金(BussinessDictCode.现金流二级类型,"C01","本金"),
    /**
     * 利息
     */
    现金流二级类型_利息(BussinessDictCode.现金流二级类型,"C02","利息"),
    /**
     * 固定管理费
     */
    现金流二级类型_固定管理费(BussinessDictCode.现金流二级类型,"C03","固定管理费"),
    /**
     * 托管费
     */
    现金流二级类型_托管费(BussinessDictCode.现金流二级类型,"C05","托管费"),
    /**
     * 浮动管理费
     */
    现金流二级类型_浮动管理费(BussinessDictCode.现金流二级类型,"C04","浮动管理费"),
    /**
     * 销售费
     */
    现金流二级类型_销售费(BussinessDictCode.现金流二级类型,"C06","销售费"),
    /**
     * 税额
     */
    现金流二级类型_税额(BussinessDictCode.现金流二级类型,"C07","税额"),
    /**
     * 现金流二级类型_资产推荐费
     */
    现金流二级类型_资产推荐费(BussinessDictCode.现金流二级类型,"C08","资产推荐费"),
 // 一体化对应etliu start
    /**
     * 现金流二级类型_外包服务费
     */
    现金流二级类型_外包服务费(BussinessDictCode.现金流二级类型,"C09","外包服务费"),
    /**
     * 现金流二级类型_代销费
     */
    现金流二级类型_代销费(BussinessDictCode.现金流二级类型,"C10","代销费"),
    /**
     * 现金流二级类型_通道托管费
     */
    现金流二级类型_通道托管费(BussinessDictCode.现金流二级类型,"C11","通道托管费"),
    /**
     * 现金流二级类型_通道管理费
     */
    现金流二级类型_通道管理费(BussinessDictCode.现金流二级类型,"C12","通道管理费"),
    /**
     * 现金流二级类型_通道其他费
     */
    现金流二级类型_通道其他费(BussinessDictCode.现金流二级类型,"C13","通道其他费"),
    /**
     * 金融产品
     */
    现金流业务类型_金融产品(BussinessDictCode.现金流业务类型,"01","金融产品"),
    /**
     * 资金账户产品
     */
    现金流业务类型_资金账户产品(BussinessDictCode.现金流业务类型,"02","资金账户产品"),
    /**
     * 投资组合
     */
    现金流业务类型_投资组合(BussinessDictCode.现金流业务类型,"03","投资组合"),

    /**
     * 新建
     */
    指令状态_新建(BussinessDictCode.指令状态, "01", "新建"),
    /**
     * 撤销
     */
    指令状态_撤销(BussinessDictCode.指令状态, "02", "撤销"),
    /**
     * 金融产品
     */
    管理对象类型_金融产品(BussinessDictCode.管理对象类型,"01","金融产品"),
    /**
     * 投资组合
     */
    管理对象类型_投资组合(BussinessDictCode.管理对象类型,"02","投资组合"),
    /**
     * 产品交易
     */
    金融产品交易业务类型_产品交易(BussinessDictCode.金融产品交易业务类型,"01","产品交易"),
    /**
     * 初始
     */
    交易状态_初始(BussinessDictCode.交易状态,"01","初始"),
    /**
     * 交易状态_撤销
     */
    交易状态_撤销(BussinessDictCode.交易状态,"03","撤销"),
    /**
     * 固定利率
     */
    利率类型_固定利率(BussinessDictCode.利率类型,"01","固定利率"),
    /**
     * 浮动利率
     */
    利率类型_浮动利率(BussinessDictCode.利率类型,"02","浮动利率"),
    /**
     * 产品成立公告（横表）
     */
    文件类型_产品成立公告_横表(BussinessDictCode.文件类型,"01","产品成立公告（横表）"),
    /**
     * 产品成立公告（竖表）
     */
    文件类型_产品成立公告_竖表(BussinessDictCode.文件类型,"02","产品成立公告（竖表）"),
    /**
     * 产品到期公告（横表）
     */
    文件类型_产品到期公告_横表(BussinessDictCode.文件类型,"03","产品到期公告（横表）"),
    /**
     * 产品到期公告（竖表）
     */
    文件类型_产品到期公告_竖表(BussinessDictCode.文件类型,"04","产品到期公告（竖表）"),
    /**
     * 人民币
     */
    币种_人民币(BussinessDictCode.币种,"CNY","人民币"),
    /**
     * T+0
     */
    清算速度_T加0(BussinessDictCode.清算速度,"01","T+0"),
    /**
     * T+1
     */
    清算速度_T加1(BussinessDictCode.清算速度,"02","T+1"),
    /**
     * T+2
     */
    清算速度_T加2(BussinessDictCode.清算速度,"03","T+2"),
    /**
     * 尾数处理方式_四舍五入
     */
    尾数处理方式_四舍五入(BussinessDictCode.尾数处理方式,"01","四舍五入"),
    /**
     * 发行状态_发行成功
     */
    发行状态_发行成功(BussinessDictCode.发行状态,"01","发行成功"),
    /**
    * 债券类资产买入
    */
    平安业务类型_债券类资产买入(BussinessDictCode.平安业务类型,"09","债券类资产买入"),
    /**
    * 债券类资产卖出
    */
    平安业务类型_债券类资产卖出(BussinessDictCode.平安业务类型,"10","债券类资产卖出"),
    /**
    * 债券类资产行权
    */
    平安业务类型_债券类资产行权(BussinessDictCode.平安业务类型,"11","债券类资产行权"),
    /**
    * 普通拆入
    */
    平安业务类型_普通拆入(BussinessDictCode.平安业务类型,"14","普通拆入"),
    /**
    * 特拆拆入
    */
    平安业务类型_特拆拆入(BussinessDictCode.平安业务类型,"15","特拆拆入"),
    /**
    * 普通拆出
    */
    平安业务类型_普通拆出(BussinessDictCode.平安业务类型,"16","普通拆出"),
    /**
     * 平安业务类型_逆回购
     */
    平安业务类型_逆回购(BussinessDictCode.平安业务类型,"19","逆回购"),
    /**
     * 平安业务类型_正回购
     */
    平安业务类型_正回购(BussinessDictCode.平安业务类型,"20","正回购"),
    /**
     * 计划类资产（利率型）申购
     */
    平安业务类型_计划类资产_利率型_申购(BussinessDictCode.平安业务类型,"33","计划类资产（利率型）申购"),
    /**
     * 计划类资产（利率型）赎回
     */
    平安业务类型_计划类资产_利率型_赎回(BussinessDictCode.平安业务类型,"34","计划类资产（利率型）赎回"),
    /**
     * 债券中间收息
     */
    平安业务类型_债券中间收息(BussinessDictCode.平安业务类型,"35","债券中间收息"),
    /**
     * 债券中间还本
     */
    平安业务类型_债券中间还本(BussinessDictCode.平安业务类型,"36","债券中间还本"),
    /**
     * 债券到期
     */
    平安业务类型_债券到期(BussinessDictCode.平安业务类型,"37","债券到期"),
    /**
     * 存款中间还本
     */
    平安业务类型_存款中间还本(BussinessDictCode.平安业务类型,"38","存款中间还本"),
    /**
     * 存款中间付息
     */
    平安业务类型_存款中间付息(BussinessDictCode.平安业务类型,"39","存款中间付息"),
    /**
     * 存款到期还本
     */
    平安业务类型_存款到期还本(BussinessDictCode.平安业务类型,"40","存款到期还本"),
    /**
     * 存款提前支取
     */
    平安业务类型_存款提前支取(BussinessDictCode.平安业务类型,"41","存款提前支取"),
    /**
     * 普通拆入到期
     */
      平安业务类型_普通拆入到期(BussinessDictCode.平安业务类型,"42","普通拆入到期"),
    /**
     * 特拆拆入到期
     */
      平安业务类型_特拆拆入到期(BussinessDictCode.平安业务类型,"43","特拆拆入到期"),
    /**
     * 普通拆出到期
     */
      平安业务类型_普通拆出到期(BussinessDictCode.平安业务类型,"44","普通拆出到期"),
    /**
     * 项目类资产中间付息
     */
    平安业务类型_项目类资产中间付息(BussinessDictCode.平安业务类型,"45","项目类资产中间付息"),
    /**
     * 项目类资产中间还本
     */
    平安业务类型_项目类资产中间还本(BussinessDictCode.平安业务类型,"46","项目类资产中间还本"),
    /**
     * 项目类资产到期
     */
    平安业务类型_项目类资产到期(BussinessDictCode.平安业务类型,"47","项目类资产到期"),
    /**
     * 平安业务类型_计划类资产_利率型_中间付息
     */
    平安业务类型_计划类资产_利率型_中间付息(BussinessDictCode.平安业务类型,"48","计划类资产（利率型）中间付息"),
    /**
     * 平安业务类型_计划类资产_利率型_中间还本
     */
    平安业务类型_计划类资产_利率型_中间还本(BussinessDictCode.平安业务类型,"49","计划类资产（利率型）中间还本"),
    /**
     * 平安业务类型_计划类资产_利率型_到期
     */
    平安业务类型_计划类资产_利率型_到期(BussinessDictCode.平安业务类型,"50","计划类资产（利率型）到期"),
    /**
     * 平安业务类型_逆回购到期
     */
    平安业务类型_逆回购到期(BussinessDictCode.平安业务类型,"51","逆回购到期"),
    /**
     * 平安业务类型_正回购到期
     */
    平安业务类型_正回购到期(BussinessDictCode.平安业务类型,"52","正回购到期"),

    /**
     * 平安业务类型_货币基金红利再投
     */
    平安业务类型_货币基金红利再投(BussinessDictCode.平安业务类型,"53","货币基金红利再投"),
    /**
     * 平安业务类型_货币基金现金分红
     */
    平安业务类型_货币基金现金分红(BussinessDictCode.平安业务类型,"54","货币基金现金分红"),
    /**
     * 平安业务类型_非货币基金红利再投
     */
    平安业务类型_非货币基金红利再投(BussinessDictCode.平安业务类型,"55","非货币基金红利再投"),
    /**
     * 平安业务类型_非货币基金现金分红
     */
    平安业务类型_非货币基金现金分红(BussinessDictCode.平安业务类型,"56","非货币基金现金分红"),
    /**
     * 平安业务类型_非货币基金分红除权
     */
    平安业务类型_非货币基金分红除权(BussinessDictCode.平安业务类型,"57","非货币基金分红除权"),
    /**
     * 平安业务类型_计划类资产_净值型_现金分红
     */
    平安业务类型_计划类资产_净值型_现金分红(BussinessDictCode.平安业务类型,"58","计划类资产（净值型）现金分红"),
    /**
     * 平安业务类型_计划类资产_净值型_红利再投
     */
    平安业务类型_计划类资产_净值型_红利再投(BussinessDictCode.平安业务类型,"59","计划类资产（净值型）红利再投"),
    /**
     * 平安业务类型_计划类资产_净值型_分红除权
     */
    平安业务类型_计划类资产_净值型_分红除权(BussinessDictCode.平安业务类型,"60","计划类资产（净值型）分红除权"),
    /**
     * 平安业务类型_活期结息
     */
    平安业务类型_活期结息(BussinessDictCode.平安业务类型,"61","活期结息"),
    /**
     * 平安业务类型_项目类资产_中间付息
     */
    平安业务类型_项目类资产_中间付息(BussinessDictCode.平安业务类型,"45","项目类资产中间付息"),
    /**
     * 平安业务类型_项目类资产_中间还本
     */
    平安业务类型_项目类资产_中间还本(BussinessDictCode.平安业务类型,"46","项目类资产中间还本"),
    /**
     * 平安业务类型_项目类资产_到期
     */
    平安业务类型_项目类资产_到期(BussinessDictCode.平安业务类型,"47","项目类资产到期"),
    /**
     * 平安业务类型_自定义现金流收取
     */
    平安业务类型_自定义现金流收取(BussinessDictCode.平安业务类型,"62","自定义现金流收取"),
    /**
     * 平安业务类型_自定义现金流支付
     */
    平安业务类型_自定义现金流支付(BussinessDictCode.平安业务类型,"63","自定义现金流支付"),
    /**
     *平安业务类型_证银转账
     */
    平安业务类型_证银转账(BussinessDictCode.平安业务类型,"64","资金划拨证银转账"),
    /**
     *平安业务类型_银证转账
     */
    平安业务类型_银证转账(BussinessDictCode.平安业务类型,"65","资金划拨银证转账"),
    /**
     * 平安业务类型_货币基金赎回到账
     */
    平安业务类型_货币基金赎回到账(BussinessDictCode.平安业务类型,"66","货币基金赎回到账"),
    /**
     * 平安业务类型_非货币基金赎回到账
     */
    平安业务类型_非货币基金赎回到账(BussinessDictCode.平安业务类型,"67","非货币基金赎回到账"),
    /**
     * 平安业务类型_计划类_净值型_赎回到账
     */
    平安业务类型_计划类_净值型_赎回到账(BussinessDictCode.平安业务类型,"68","计划类（净值型）赎回到账"),
    /**
     * 平安业务类型_货币基金分红除权
     */
    平安业务类型_货币基金分红除权(BussinessDictCode.平安业务类型, "82", "货币基金分红除权"),
    /**
     * 平安业务类型_计划类货币型红利再投
     */
    平安业务类型_计划类_货币型_红利再投(BussinessDictCode.平安业务类型, "78", "计划类资产（货币型）红利再投"),
    /**
     * 平安业务类型_计划类货币型除权登记
     */
    平安业务类型_计划类_货币型_除权登记(BussinessDictCode.平安业务类型, "79", "计划类资产（货币型）除权登记"),
    /**
     * 平安业务类型_计划类货币型现金分红
     */
    平安业务类型_计划类_货币型_现金分红(BussinessDictCode.平安业务类型, "80", "计划类资产（货币型）现金分红"),
    /**
     * 平安业务类型_DVP划款
     */
    平安业务类型_DVP划款(BussinessDictCode.平安业务类型,"81","DVP划款"),
    /**
     * 平安业务类型_项目类资产卖出到账
     */
    平安业务类型_项目类资产卖出到账(BussinessDictCode.平安业务类型,"83","项目类资产卖出到账"),
    /**
     * 平安业务类型_产品成立
     */
    平安业务类型_产品成立(BussinessDictCode.平安业务类型,"01","产品成立"),
    /**
     * 平安业务类型_产品强增
     */
    平安业务类型_产品强增(BussinessDictCode.平安业务类型,"02","产品强增"),
    /**
     * 平安业务类型_产品强减
     */
    平安业务类型_产品强减(BussinessDictCode.平安业务类型,"03","产品强减"),
    /**
     * 平安业务类型_产品申购
     */
    平安业务类型_产品申购(BussinessDictCode.平安业务类型,"04","产品申购"),
    /**
     * 平安业务类型_产品赎回
     */
    平安业务类型_产品赎回(BussinessDictCode.平安业务类型,"05","产品赎回"),
    /**
     * 平安业务类型_产品中间付息
     */
    平安业务类型_产品中间付息(BussinessDictCode.平安业务类型,"06","产品中间付息"),
    /**
     * 平安业务类型_产品到期
     */
    平安业务类型_产品到期(BussinessDictCode.平安业务类型,"07","产品到期"),
    /**
     * 平安业务类型_产品费用支付
     */
    平安业务类型_产品费用支付(BussinessDictCode.平安业务类型,"08","产品费用支付"),
    /**
     * 平安业务类型_存款类资产买入
     */
    平安业务类型_存款类资产买入(BussinessDictCode.平安业务类型,"12","存款类资产买入"),
    /**
     * 平安业务类型_存款类资产买入
     */
    平安业务类型_存款类资产卖出(BussinessDictCode.平安业务类型,"13","存款类资产卖出"),
    /**
     * 平安业务类型_项目类资产买入
     */
    平安业务类型_项目类资产买入(BussinessDictCode.平安业务类型,"17","项目类资产买入"),
    /**
     * 平安业务类型_项目类资产买入
     */
    平安业务类型_项目类资产卖出(BussinessDictCode.平安业务类型,"18","项目类资产卖出"),
    /**
     * 货币基金申购申请
     */
    平安业务类型_货币基金申购申请(BussinessDictCode.平安业务类型,"21","货币基金申购申请"),
    /**
     * 货币基金申购确认
     */
    平安业务类型_货币基金申购确认(BussinessDictCode.平安业务类型,"22","货币基金申购确认"),
    /**
     * 货币基金赎回申请
     */
    平安业务类型_货币基金赎回申请(BussinessDictCode.平安业务类型,"23","货币基金赎回申请"),
    /**
     * 货币基金赎回确认
     */
    平安业务类型_货币基金赎回确认(BussinessDictCode.平安业务类型,"24","货币基金赎回确认"),
    /**
     * 非货币基金申购申请
     */
    平安业务类型_非货币基金申购申请(BussinessDictCode.平安业务类型,"25","非货币基金申购申请"),
    /**
     * 非货币基金申购确认
     */
    平安业务类型_非货币基金申购确认(BussinessDictCode.平安业务类型,"26","非货币基金申购确认"),
    /**
     * 非货币基金赎回申请
     */
    平安业务类型_非货币基金赎回申请(BussinessDictCode.平安业务类型,"27","非货币基金赎回申请"),
    /**
     * 非货币基金赎回确认
     */
    平安业务类型_非货币基金赎回确认(BussinessDictCode.平安业务类型,"28","非货币基金赎回确认"),
    /**
     * 计划类资产（净值型）申购申请
     */
    平安业务类型_计划类资产净值型_申购申请(BussinessDictCode.平安业务类型,"29","计划类资产（净值型）申购申请"),
    /**
     * 计划类资产（净值型）申购确认
     */
    平安业务类型_计划类资产净值型_申购确认(BussinessDictCode.平安业务类型,"30","计划类资产（净值型）申购确认"),
    /**
     * 计划类资产（净值型）赎回申请
     */
    平安业务类型_计划类资产净值型_赎回申请(BussinessDictCode.平安业务类型,"31","计划类资产（净值型）赎回申请"),
    /**
     * 计划类资产（净值型）赎回确认
     */
    平安业务类型_计划类资产净值型_赎回确认(BussinessDictCode.平安业务类型,"32","计划类资产（净值型）赎回确认"),
    /**
     * 计划类资产（货币型）申购申请
     */
    平安业务类型_计划类资产货币型_申购申请(BussinessDictCode.平安业务类型,"69","计划类资产（货币型）申购申请"),
    /**
     * 计划类资产（货币型）申购确认
     */
    平安业务类型_计划类资产货币型_申购确认(BussinessDictCode.平安业务类型,"70","计划类资产（货币型）申购确认"),
    /**
     * 计划类资产（货币型）赎回申请
     */
    平安业务类型_计划类资产货币型_赎回申请(BussinessDictCode.平安业务类型,"71","计划类资产（货币型）赎回申请"),
    /**
     * 计划类资产（货币型）赎回确认
     */
    平安业务类型_计划类资产货币型_赎回确认(BussinessDictCode.平安业务类型,"72","计划类资产（货币型）赎回确认"),
    /**
     * 计划类资产（货币型）赎回到账
     */
    平安业务类型_计划类资产货币型_赎回到账(BussinessDictCode.平安业务类型,"73","计划类资产（货币型）赎回确认"),
    
    /**
     * 增值税缴纳
     */
    平安业务类型_增值税缴纳(BussinessDictCode.平安业务类型,"116","增值税缴纳"),
    /**
     * 金融产品类型_投管用_系列模板
     */
    金融产品类型_投管用_系列模板(BussinessDictCode.金融产品类型_投管用,"F19","系列模板"),
    /**
     * 本金收益特征_保本
     */
    本金收益特征_保本(BussinessDictCode.本金收益特征,"01","保本"),
    /**
     * 本金收益特征_非保本
     */
    本金收益特征_非保本(BussinessDictCode.本金收益特征,"02","非保本"),
    /**
     * 付息周期_周期
     */
    付息周期_周期(BussinessDictCode.付息周期,"02","周期支付"),
    /**
     * 付息周期_到期
     */
    付息周期_到期(BussinessDictCode.付息周期,"01","到期支付"),

 // 一体化对应etliu start
//    /**
//     * 周期单位_日
//     */
//    周期单位_日(BussinessDictCode.周期单位,"07","日"),
//    /**
//     * 周期单位_月
//     */
//    周期单位_月(BussinessDictCode.周期单位,"05","月"),
//    /**
//     * 周期单位_年
//     */
//    周期单位_年(BussinessDictCode.周期单位,"02","年"),
    /**
     * 周期单位_日
     */
    周期单位_日(BussinessDictCode.周期单位,"01","日"),
    /**
     * 周期单位_月
     */
    周期单位_月(BussinessDictCode.周期单位,"03","月"),
    /**
     * 周期单位_年
     */
    周期单位_年(BussinessDictCode.周期单位,"05","年"),
 // 一体化对应etliu end

    // 一体化对应etliu start
//    /**
//     * 推算方法_起息日向后
//     */
//    推算方法_起息日向后(BussinessDictCode.推算方法,"01","起息日向后"),
//    /**
//     * 推算方法_到期日向前
//     */
//    推算方法_到期日向前(BussinessDictCode.推算方法,"02","到期日向前"),
//    /**
//     * 推算方法_首次开放日
//     */
//    推算方法_首次开放日(BussinessDictCode.推算方法,"03","首次开放日"),
//    /**
//     * 推算方法_首次付息日
//     */
//    推算方法_首次付息日(BussinessDictCode.推算方法,"04","首次付息日"),
//    /**
//     * 推算方法_首次付息日
//     */
//    推算方法_首次分红日(BussinessDictCode.推算方法,"05","首次分红日"),
	/**
	 * 推算方式_起息日向后
	 */
    推算方式_起息日向后(BussinessDictCode.推算方式, "01", "起息日向后"),
	/**
	 * 推算方式_到期日向前
	 */
    推算方式_到期日向前(BussinessDictCode.推算方式, "02", "到期日向前"),
	/**
	 * 推算方式_首次支付日
	 */
    推算方式_首次支付日(BussinessDictCode.推算方式, "03", "首次支付日"),
	/**
	 * 推算方式_首次开放日(和首次支付日对应数据字典明细表同一条记录)
	 */
    推算方式_首次开放日(BussinessDictCode.推算方式, "03", "首次开放日"),
	/**
	 * 推算方式_首次付息日(和首次支付日对应数据字典明细表同一条记录)
	 */
    推算方式_首次付息日(BussinessDictCode.推算方式, "03", "首次付息日"),
	/**
	 * 推算方式_首次分红日(和首次支付日对应数据字典明细表同一条记录)
	 */
    推算方式_首次分红日(BussinessDictCode.推算方式, "03", "首次分红日"),
    // 一体化对应etliu end

    /**
     * 营业日准则_向前调整
     */
    营业日准则_向前调整(BussinessDictCode.营业日准则,"01","向前调整"),
    /**
     * 营业日准则_向后调整
     */
    营业日准则_向后调整(BussinessDictCode.营业日准则,"02","向后调整"),
    /**
     * 营业日准则_调整的调整
     */
    营业日准则_调整的向后调整(BussinessDictCode.营业日准则,"03","调整的向后调整"),
    /**
     * 营业日准则_不调整
     */
    营业日准则_不调整(BussinessDictCode.营业日准则,"04","不调整"),
    /**
     * 画面数据状态_待处理
     */
    画面数据状态_待处理(BussinessDictCode.画面数据状态,"01","待处理"),
    /**
     * 画面数据状态_新建
     */
    画面数据状态_新建(BussinessDictCode.画面数据状态,"02","新建"),
    /**
     * 画面数据状态_流程中
     */
    画面数据状态_流程中(BussinessDictCode.画面数据状态,"03","流程中"),
    /**
     * 画面数据状态_修改
     */
    画面数据状态_修改(BussinessDictCode.画面数据状态,"04","修改"),
    /**
     * 画面数据状态_有效
     */
    画面数据状态_有效(BussinessDictCode.画面数据状态,"05","有效"),
    /**
     * 画面数据状态_撤销
     */
    画面数据状态_撤销(BussinessDictCode.画面数据状态,"06","撤销"),

    /**
     * 交易流程状态_流程中
     */
    交易流程状态_流程中(BussinessDictCode.交易流程状态,"01","流程中"),

    /**
     * 交易流程状态_流程中
     */
    交易流程状态_有效(BussinessDictCode.交易流程状态,"02","有效"),

    /**
     * 交易流程状态_撤销
     */
    交易流程状态_撤销(BussinessDictCode.交易流程状态,"03","撤销"),
    /**
     * 处理状态_已处理
     */
    处理状态_已处理(BussinessDictCode.处理状态,"01","已处理"),
    /**
     * 处理状态_未处理
     */
    处理状态_未处理(BussinessDictCode.处理状态,"02","未处理"),

    /**
     * 有效状态_有效
     */
    有效状态_有效(BussinessDictCode.有效状态,"01","有效"),
    /**
     * 有效状态_待处理
     */
    有效状态_待处理(BussinessDictCode.有效状态,"02","待处理"),
    /**
     * 有效状态_撤销
     */
    有效状态_撤销(BussinessDictCode.有效状态,"03","撤销"),
    /**
     * 同业借款
     */
    存款类资产类型_同业借款(BussinessDictCode.存款类资产类型,"D01","同业借款"),
    /**
     * 存放同业
     */
    存款类资产类型_存放同业(BussinessDictCode.存款类资产类型,"D02","存放同业"),
    /**
     * 开放模式_定期开放
     */
    开放模式_定期开放(BussinessDictCode.开放模式,"01","定期开放"),
    /**
     * 开放模式_高频开放
     */
    开放模式_高频开放(BussinessDictCode.开放模式,"02","高频开放"),

    /**
     * 开放模式_周期开放
     */
    开放模式_周期开放(BussinessDictCode.开放模式,"03","周期开放"),
    /**
     * 收费类型_计提式费用
     */
    收费类型_计提式费用(BussinessDictCode.收费类型,"01","计提式费用"),
    /**
     * 收费类型_不规则费用
     */
    收费类型_不规则费用(BussinessDictCode.收费类型,"02","不规则费用"),
    /**
     * 交易平台_银行间
     */
    交易平台_银行间(BussinessDictCode.交易平台,"01","银行间"),
    /**
     * 交易平台_场内交易
     */
    交易平台_场内交易(BussinessDictCode.交易平台,"02","场内交易"),
    /**
     * 交易平台_其它
     */
    交易平台_其它(BussinessDictCode.交易平台,"99","其它"),
    /**
     * 资金账户类型_托管账户
     */
    资金账户类型_托管账户(BussinessDictCode.资金账户类型,"A01","产品托管户"),
    /**
     * 资金账户类型_销售费账户
     */
    资金账户类型_销售费账户(BussinessDictCode.资金账户类型,"A02","销售费账户"),
    /**
     * 资金账户类型_托管费账户
     */
    资金账户类型_托管费账户(BussinessDictCode.资金账户类型,"A03","托管费账户"),
    /**
     * 资金账户类型_管理费账户
     */
    资金账户类型_管理费账户(BussinessDictCode.资金账户类型,"A04","管理费账户"),
    /**
     * 资金账户类型_交易对手账户
     */
    资金账户类型_交易对手账户(BussinessDictCode.资金账户类型,"A05","交易对手账户"),
    /**
     * 资金账户类型_通道方账户
     */
    资金账户类型_通道方账户(BussinessDictCode.资金账户类型,"A06","通道方账户"),
    /**
     * 资金账户类型_交易所资金账户
     */
    资金账户类型_交易所资金账户(BussinessDictCode.资金账户类型, "A07", "券商资金账户"),
    /**
     * 资金账户类型_甲类户
     */
    资金账户类型_甲类户(BussinessDictCode.资金账户类型, "A08", "甲类户"),
    /**
     * 资金账户类型_上清所DVP账户
     */
    资金账户类型_上清所DVP账户(BussinessDictCode.资金账户类型,"A09","上清所DVP账户"),
    /**
     * 资金账户类型_中债登DVP账户
     */
    资金账户类型_中债登DVP账户(BussinessDictCode.资金账户类型,"A10","中债登DVP账户"),
    /**
     * 资金账户类型_赎回过渡户
     */
    资金账户类型_赎回过渡户(BussinessDictCode.资金账户类型,"A11","赎回过渡户"),
    /**
     * 收入
     */
    收支方向_收入(BussinessDictCode.收支方向,"01","收入"),
    /**
     * 支出
     */
    收支方向_支出(BussinessDictCode.收支方向,"02","支出"),

 // 一体化对应etliu start
//    /**
//     * 托管划款
//     */
//    划款类型_托管划款(BussinessDictCode.划款类型,"01","托管划款"),
//    /**
//     * 清算划款
//     */
//    划款类型_清算划款(BussinessDictCode.划款类型,"02","清算划款"),
//
//    /**
//     * DVP划款
//     */
//    划款类型_DVP划款(BussinessDictCode.划款类型,"03","DVP划款"),
    /**
     * 托管划款
     */
    平安划款类型_托管划款(BussinessDictCode.平安划款类型,"01","托管划款"),
    /**
     * 清算划款
     */
    平安划款类型_清算划款(BussinessDictCode.平安划款类型,"02","清算划款"),

    /**
     * DVP划款
     */
    平安划款类型_DVP划款(BussinessDictCode.平安划款类型,"03","DVP划款"),
 // 一体化对应etliu end

    // 2.0 增加 qiangchengxi start04	通道划款
    /**
     * 通道划款
     */
    平安划款类型_通道划款(BussinessDictCode.平安划款类型,"04", "通道划款"),
    // 2.0 增加 qiangchengxi end

    /**
     * 收益结转频率_按日结转
     */
    收益结转频率_按日结转(BussinessDictCode.收益结转频率,"01","按日结转"),
    /**
     * 收益结转频率_按月结转
     */
    收益结转频率_按月结转(BussinessDictCode.收益结转频率,"02","按月结转"),
    /**
     * 计息基础_A_360
     */
    计息基础_A_360(BussinessDictCode.计息基础,"A/360","A/360"),
    /**
     * 计息基础_A_365
     */
    计息基础_A_365(BussinessDictCode.计息基础,"A/365","A/365"),
    /**
     * 计息基础_A_A
     */
    计息基础_A_A(BussinessDictCode.计息基础,"A/A","A/A"),
    /**
     * 计息基础_A_A_B_COUP
     */
    计息基础_A_A_B_COUP(BussinessDictCode.计息基础,"A/A_B_COUP","A/A(平均分配)"),
    /**
     * 计息基础_A_A_B_DAY
     */
    计息基础_A_A_B_DAY(BussinessDictCode.计息基础,"A/A_B_DAY","A/A(按实际天数分配)"),
    /**
     * 计息基础_30_360
     */
    计息基础_30_360(BussinessDictCode.计息基础,"30/360","30/360"),
    /**
     * 计息基础_A_365F
     */
    计息基础_A_365F(BussinessDictCode.计息基础,"A/365F","A/365F"),
    /**
     * 机构费用类型_本机构费用
     */
    机构费用类型_本机构费用(BussinessDictCode.机构费用类型,"01","本机构费用"),
    /**
     * 机构费用类型_其他机构费用
     */
    机构费用类型_其他机构费用(BussinessDictCode.机构费用类型,"02","其他机构费用"),
    /**
     * 机构费用二级类型_本机构托管费
     */
    机构费用二级类型_本机构托管费(BussinessDictCode.机构费用二级类型,"01","本机构托管费"),
    /**
     * 机构费用二级类型_本机构管理费
     */
    机构费用二级类型_本机构管理费(BussinessDictCode.机构费用二级类型,"02","本机构管理费"),
    /**
     * 机构费用二级类型_本机构销售手续费
     */
    机构费用二级类型_本机构销售手续费(BussinessDictCode.机构费用二级类型,"03","本机构销售手续费"),
    /**
     * 机构费用二级类型_本机构其他费用
     */
    机构费用二级类型_本机构其他费用(BussinessDictCode.机构费用二级类型,"04","本机构其他费用"),
    /**
    /**
     * 机构费用二级类型_其他机构托管费
     */
    机构费用二级类型_其他机构托管费(BussinessDictCode.机构费用二级类型,"05","其他机构托管费"),
    /**
     * 机构费用二级类型_其他机构管理费
     */
    机构费用二级类型_其他机构管理费(BussinessDictCode.机构费用二级类型,"06","其他机构管理费"),
    /**
     * 机构费用二级类型_其他机构销售手续费
     */
    机构费用二级类型_其他机构销售手续费(BussinessDictCode.机构费用二级类型,"07","其他机构销售手续费"),
    /**
     * 机构费用二级类型_投资顾问费用
     */
    机构费用二级类型_投资顾问费用(BussinessDictCode.机构费用二级类型,"08","投资顾问费用"),
    /**
     * 机构费用二级类型_其他机构其他产品费用
     */
    机构费用二级类型_其他机构其他产品费用(BussinessDictCode.机构费用二级类型,"09","其他机构其他产品费用"),
    /**
     * 关联范围_通道
     */
    关联范围_通道(BussinessDictCode.关联范围,"02","通道"),
    /**
     * 关联范围_产品
     */
    关联范围_产品(BussinessDictCode.关联范围,"01","产品"),
    /**
     * 关联范围_其他
     */
    关联范围_其他(BussinessDictCode.关联范围,"99","其他"),
    /**
     * 机构费用类型_托管费
     */
    机构费用类型_托管费(BussinessDictCode.机构费用类型,"01","托管费"),
    /**
     * 机构费用类型_销售手续费
     */
    机构费用类型_销售手续费(BussinessDictCode.机构费用类型,"02","销售手续费"),
    /**
     * 机构费用类型_固定管理费
     */
    机构费用类型_固定管理费(BussinessDictCode.机构费用类型,"03","固定管理费"),
    /**
     * 机构费用类型_浮动管理费
     */
    机构费用类型_浮动管理费(BussinessDictCode.机构费用类型,"12","浮动管理费"),
    /**
     * 机构费用类型_浮动差额中收
     */
    机构费用类型_浮动差额中收(BussinessDictCode.机构费用类型,"04","浮动差额中收"),
    /**
     * 机构费用类型_结算服务费
     */
    机构费用类型_结算服务费(BussinessDictCode.机构费用类型,"07","结算服务费"),
    /**
     * 机构费用类型_账户维护费
     */
    机构费用类型_账户维护费(BussinessDictCode.机构费用类型,"08","账户维护费"),
    /**
     * 机构费用类型_增值附加税费
     */
    机构费用类型_增值附加税费(BussinessDictCode.机构费用类型,"09","增值附加税费"),

    // 一体化对应etliu start
//    /**
//     * 费用类型_托管费
//     */
//    费用类型_托管费(BussinessDictCode.费用类型,"01","托管费"),
//    /**
//     * 费用类型_申购费
//     */
//    费用类型_申购费(BussinessDictCode.费用类型,"11","申购费"),
//    /**
//     * 费用类型_赎回费
//     */
//    费用类型_赎回费(BussinessDictCode.费用类型,"12","赎回费"),
    /**
     * 费用类型_销售手续费
     */
    费用类型_销售手续费(BussinessDictCode.费用类型,"02","销售手续费"),
    /**
     * 费用类型_固定管理费
     */
    费用类型_固定管理费(BussinessDictCode.费用类型,"03","固定管理费"),
//    /**
//     * 费用类型_浮动管理费
//     */
//    费用类型_浮动管理费(BussinessDictCode.费用类型,"04","浮动管理费"),
//    /**
//     * 费用类型_浮动差额中收
//     */
//    费用类型_浮动差额中收(BussinessDictCode.费用类型,"05","浮动差额中收"),
//    /**
//     * 费用类型_通道费
//     */
//    费用类型_通道费(BussinessDictCode.费用类型,"06","通道费"),
//    /**
//     * 费用类型_银行手续费
//     */
//    费用类型_银行手续费(BussinessDictCode.费用类型,"07","银行手续费"),
//    /**
//     * 费用类型_结算服务费
//     */
//    费用类型_结算服务费(BussinessDictCode.费用类型,"08","结算服务费"),
//    /**
//     * 费用类型_账户维护费
//     */
//    费用类型_账户维护费(BussinessDictCode.费用类型,"09","账户维护费"),
//    /**
//     * 费用类型_增值附加税费
//     */
//    费用类型_增值附加税费(BussinessDictCode.费用类型,"10","增值附加税费"),
//    /**
//     * 费用类型_其他费用
//     */
//    费用类型_其他费用(BussinessDictCode.费用类型,"99","其他费用"),
//    /**
//     * 费用类型_城建税
//     */
//    费用类型_城建税(BussinessDictCode.费用类型,"ALT0102","城建税"),
//    /**
//     * 费用类型_教育费
//     */
//    费用类型_教育费(BussinessDictCode.费用类型,"ALT0202","教育费"),
//    /**
//     * 费用类型_地方教育费
//     */
//    费用类型_地方教育费(BussinessDictCode.费用类型,"ALT0302","地方教育费"),
//    /**
//     * 费用类型_利息收入
//     */
//    费用类型_利息收入(BussinessDictCode.费用类型,"TAX0102","利息收入"),
//    /**
//     * 费用类型_红利收入
//     */
//    费用类型_红利收入(BussinessDictCode.费用类型,"TAX0202","红利收入"),
//    /**
//     * 价差收入
//     */
//    费用类型_价差收入(BussinessDictCode.费用类型,"TAX0302","价差收入"),
	/**
	 * 经手费
	 */
	费用类型_经手费(BussinessDictCode.费用类型, "B01", "经手费"),
	/**
	 * 印花税
	 */
	费用类型_印花税(BussinessDictCode.费用类型, "B02", "印花税"),
	/**
	 * 证管费
	 */
	费用类型_证管费(BussinessDictCode.费用类型, "B03", "证管费"),
	/**
	 * 过户费
	 */
	费用类型_过户费(BussinessDictCode.费用类型, "B04", "过户费"),
	/**
	 * 佣金
	 */
	费用类型_佣金(BussinessDictCode.费用类型, "B05", "佣金"),
	/**
	 * 交易手续费
	 */
	费用类型_交易手续费(BussinessDictCode.费用类型, "B06", "交易手续费"),
	/**
	 * 结算费
	 */
	费用类型_结算费(BussinessDictCode.费用类型, "B07", "结算费"),
	/**
	 * 结算手续费
	 */
	费用类型_结算手续费(BussinessDictCode.费用类型, "B08", "结算手续费"),
	/**
	 * 通道费
	 */
	费用类型_通道费(BussinessDictCode.费用类型, "B09", "通道费"),
	/**
	 * 通道管理费
	 */
	费用类型_通道管理费(BussinessDictCode.费用类型, "B10", "通道管理费"),
	/**
	 * 通道销售费
	 */
	费用类型_通道销售费(BussinessDictCode.费用类型, "B11", "通道销售费"),
	/**
	 * 通道托管费
	 */
	费用类型_通道托管费(BussinessDictCode.费用类型, "B12", "通道托管费"),
	/**
	 * 账户维护费
	 */
	费用类型_账户维护费(BussinessDictCode.费用类型, "B13", "账户维护费"),
    /**
     * 费用类型_申购费
    */
    费用类型_申购费(BussinessDictCode.费用类型,"B14","申购费"),
    /**
     * 费用类型_赎回费
     */
    费用类型_赎回费(BussinessDictCode.费用类型,"B15","赎回费"),
	/**
	 * 其他费用
	 */
	费用类型_其他费用(BussinessDictCode.费用类型, "B99", "其他费用"),
 // 一体化对应etliu end
//    中债字段对应 20190416 code值变化 start
    /**
     * 中债_基金类二级资产类别_货币市场基金
     */
    中债_基金类二级资产类别_货币市场基金(BussinessDictCode.中债_基金类二级资产类别,"2401","货币市场基金"),
    /**
     * 中债_基金类二级资产类别_债券基金
     */
    中债_基金类二级资产类别_债券基金(BussinessDictCode.中债_基金类二级资产类别,"1106","债券基金"),
    /**
     * 中债_基金类二级资产类别_股票基金
     */
    中债_基金类二级资产类别_股票基金(BussinessDictCode.中债_基金类二级资产类别,"1303","股票基金"),
    /**
     * 中债_基金类二级资产类别_基金中基金
     */
    中债_基金类二级资产类别_基金中基金(BussinessDictCode.中债_基金类二级资产类别,"2403","基金中基金"),
    /**
     * 中债_基金类二级资产类别_混合基金
     */
    中债_基金类二级资产类别_混合基金(BussinessDictCode.中债_基金类二级资产类别,"2402","混合基金"),
//    中债字段对应删除保本基金
//    /**
//     * 中债_基金类二级资产类别_保本基金
//     */
//    中债_基金类二级资产类别_保本基金(BussinessDictCode.中债_基金类二级资产类别,"06","保本基金"),
    /**
     * 中债_基金类二级资产类别_其他公募基金
     */
    中债_基金类二级资产类别_其他公募基金(BussinessDictCode.中债_基金类二级资产类别,"2499","其他公募基金"),
    //    中债字段对应 20190416 code值变化 start
    /**
     * 基金类资产二级类型_货币市场基金
     */
    基金类资产二级类型_货币市场基金(BussinessDictCode.基金类资产二级类型,"02","货币市场基金"),
    /**
     * 基金类资产二级类型_债券基金
     */
    基金类资产二级类型_债券基金(BussinessDictCode.基金类资产二级类型,"01","债券基金"),
    /**
     * 基金类资产二级类型_股票基金
     */
    基金类资产二级类型_股票基金(BussinessDictCode.基金类资产二级类型,"03","股票基金"),
    /**
     * 基金类资产二级类型_混合基金
     */
    基金类资产二级类型_混合基金(BussinessDictCode.基金类资产二级类型,"04","混合基金"),
    /**
     * 基金类资产二级类型_保本基金
     */
    基金类资产二级类型_保本基金(BussinessDictCode.基金类资产二级类型,"05","保本基金"),
    /**
     * 基金类资产二级类型_其他公募基金
     */
    基金类资产二级类型_其他公募基金(BussinessDictCode.基金类资产二级类型,"06","其他公募基金"),
    /**
     * 基金类资产二级类型_基金中基金
     */
    基金类资产二级类型_基金中基金(BussinessDictCode.基金类资产二级类型,"07","基金中基金"),

    基数日期类型_当日(BussinessDictCode.基数日期类型,"01","当日"),

    // 一体化对应etliu start
//    基数日期类型_前一工作日(BussinessDictCode.基数日期类型,"02","前一工作日"),
//
//    基数日期类型_前一自然日(BussinessDictCode.基数日期类型,"03","前一自然日"),
    基数日期类型_前一自然日(BussinessDictCode.基数日期类型,"02","前一自然日"),

    基数日期类型_前一工作日(BussinessDictCode.基数日期类型,"03","前一工作日"),
 // 一体化对应etliu end


    利息分配方式_按照实际天数分配(BussinessDictCode.利息分配方式,"01","按照实际天数分配"),

    利息分配方式_平均分配(BussinessDictCode.利息分配方式,"02","平均分配"),

    重置类型_基准利率调整规则_基准利率变动后固定间隔生效(BussinessDictCode.重置类型_基准利率调整规则,"01","基准利率变动后固定间隔生效"),

    重置类型_基准利率调整规则_付息后下一计息期生效(BussinessDictCode.重置类型_基准利率调整规则,"02","付息后下一计息期生效"),

    /**
     * 目标客户类型_私人银行客户专属
     */
    目标客户类型_私人银行客户专属(BussinessDictCode.目标客户类型,"01","私人银行客户专属"),

    /**
     * 目标客户类型_机构客户专属
     */
    目标客户类型_机构客户专属(BussinessDictCode.目标客户类型,"02","机构客户专属"),
    /**
     * 目标客户类型_一般个人客户
     */
    目标客户类型_一般个人客户(BussinessDictCode.目标客户类型,"05","一般个人客户"),

    /**
     * 目标客户类型_高资产净值客户
     */
    目标客户类型_高资产净值客户(BussinessDictCode.目标客户类型,"06","高资产净值客户"),

    /**
     * 资金投向地区_境内
     */
    资金投向地区_境内(BussinessDictCode.资金投向地区,"01","境内"),

    /**
     * 资金投向地区_境外
     */
    资金投向地区_境外(BussinessDictCode.资金投向地区,"02","境外"),

    /**
     * 资金投向地区_境内和境外
     */
    资金投向地区_境内和境外(BussinessDictCode.资金投向地区,"03","境内和境外"),

    /**
     * 产品管理模式_资产管理公司为实际管理人
     */
    产品管理模式_资产管理公司为实际管理人(BussinessDictCode.产品管理模式,"03","资产管理公司为实际管理人"),

    /**
     * 产品管理模式_其他机构为实际管理人
     */
    产品管理模式_其他机构为实际管理人(BussinessDictCode.产品管理模式,"02","其他机构为实际管理人"),

    /**
     * 基数类型_存续本金
     */
    基数类型_存续本金(BussinessDictCode.基数类型,"07","存续本金"),
    /**
     * 基数类型_实收资本
     */
    基数类型_实收资本(BussinessDictCode.基数类型,"04","实收资本"),

    /**
     * 开放类型_开放式
     */
    // 一体化对应etliu
//    开放类型_开放式(BussinessDictCode.开放类型,"01","开放式"),
    开放类型_开放式(BussinessDictCode.开放类型,"02","开放式"),

    /**
     * 开放类型_封闭式
     */
    // 一体化对应etliu
//    开放类型_封闭式(BussinessDictCode.开放类型,"02","封闭式"),
    开放类型_封闭式(BussinessDictCode.开放类型,"01","封闭式"),

    /**
     * 有无_有
     */
    有无_有(BussinessDictCode.有无,"01","有"),

    /**
     * 规律开放周期_其他规律开放周期
     */
    规律开放周期_其他规律开放周期(BussinessDictCode.规律开放周期,"99","其他规律开放周期"),

    /**
     * 开放期业务_其他
     */
    开放期业务_其他(BussinessDictCode.开放期业务,"99","其他"),

    /**
     * 处理模式_普通
     */
    处理模式_普通(BussinessDictCode.处理模式,"01","普通"),

    /**
     * 处理模式_滚动
     */
    处理模式_滚动(BussinessDictCode.处理模式,"02","滚动"),

    /**
     * 处理模式_滚动N天
     */
    处理模式_滚动N天(BussinessDictCode.处理模式,"03","滚动N天"),

    /**
     * 处理模式_普通N天
     */
    处理模式_普通N天(BussinessDictCode.处理模式,"04","普通N天"),

    /**
     * 处理模式_开放阶梯
     */
    处理模式_开放阶梯(BussinessDictCode.处理模式,"05","开放阶梯"),

    /**
     * 处理模式_日添利
     */
    处理模式_日添利(BussinessDictCode.处理模式,"06","日添利"),

    /**
     * 处理模式_智能日添利
     */
    处理模式_智能日添利(BussinessDictCode.处理模式,"07","智能日添利"),

    /**
     * 处理模式_货币型
     */
    处理模式_货币型(BussinessDictCode.处理模式,"08","货币型"),

    /**
     * 处理模式_净值型
     */
    处理模式_净值型(BussinessDictCode.处理模式,"09","净值型"),

    // modify by chenzhuo 一体化
//    /**
//     * 周期单位_周
//     */
//    周期单位_周(BussinessDictCode.周期单位,"06","周"),
	/**
	 * 周期单位_周
	 */
	周期单位_周(BussinessDictCode.周期单位,"02","周"),

    /**
     * 发行状态_确认发行
     */
    发行状态_确认发行(BussinessDictCode.发行状态,"03","确认发行"),

    /**
     * 息票品种_附息
     */
    息票品种_附息(BussinessDictCode.息票品种,"01","附息"),

    /**
     * 息票品种_贴现
     */
    息票品种_贴现(BussinessDictCode.息票品种,"02","贴现"),

    /**
     * 息票品种_零息
     */
    息票品种_零息(BussinessDictCode.息票品种,"03","零息"),

    /**
     * 息票品种_利随本清
     */
    息票品种_利随本清(BussinessDictCode.息票品种,"04","利随本清"),
    /**
     * 日期类型_第几工作日
     */
    日期类型_第几工作日(BussinessDictCode.日期类型,"01","第几工作日"),
    /**
     * 日期类型_第几自然日
     */
    日期类型_第几自然日(BussinessDictCode.日期类型,"02","第几自然日"),
    /**
     * 日期类型_周几
     */
    日期类型_周几(BussinessDictCode.日期类型,"03","周几"),
    /**
     * 日期类型_几号
     */
    日期类型_几号(BussinessDictCode.日期类型,"04","几号"),
    /**
     * 日期类型_倒数第几工作日
     */
    日期类型_倒数第几工作日(BussinessDictCode.日期类型,"05","倒数第几工作日"),

 // 一体化对应etliu start
//    /**
//     * 推算规则_开放周期起息日
//     */
//    推算规则_开放周期起息日(BussinessDictCode.推算规则,"01","开放周期起息日"),
//
//    /**
//     * 推算规则_开放周期开始日
//     */
//    推算规则_开放周期开始日(BussinessDictCode.推算规则,"02","开放周期开始日"),
//
//    /**
//     * 推算规则_开放周期结束日
//     */
//    推算规则_开放周期结束日(BussinessDictCode.推算规则,"03","开放周期结束日"),
    /**
     * 推算方法_开放周期起息日
     */
    推算方法_开放周期起息日(BussinessDictCode.推算方法,"01","开放周期起息日"),

    /**
     * 推算方法_开放周期开始日
     */
    推算方法_开放周期开始日(BussinessDictCode.推算方法,"02","开放周期开始日"),

    /**
     * 推算方法_开放周期结束日
     */
    推算方法_开放周期结束日(BussinessDictCode.推算方法,"03","开放周期结束日"),
 // 一体化对应etliu end

    /**
     * 持仓类型_可用
     */
    持仓类型_可用(BussinessDictCode.持仓类型,"01","可用"),

    /**
     * 持仓类型_在途
     */
    持仓类型_在途(BussinessDictCode.持仓类型,"02","在途"),

    /**
     * 持仓类型_实际
     */
    持仓类型_实际(BussinessDictCode.持仓类型,"03","实际"),
    /**
     * 持仓类型_质押
     */
    持仓类型_质押(BussinessDictCode.持仓类型,"04","质押"),
    /**
     * 持仓类型_融入
     */
    持仓类型_融入(BussinessDictCode.持仓类型,"05","融入"),
    /**
     * 持仓类型_融出
     */
    持仓类型_融出(BussinessDictCode.持仓类型,"06","融出"),
    /**
     * 申赎开放类型_申赎开放
     */
    申赎开放类型_申赎开放(BussinessDictCode.申赎开放类型,"03","申赎开放"),
    /**
     * 申赎开放类型_申购开放
     */
    申赎开放类型_申购开放(BussinessDictCode.申赎开放类型,"01","申购开放"),
    /**
     * 计费基数_费用品种_存续本金
     */
    计费基数_费用品种_存续本金(BussinessDictCode.计费基数_费用品种,"04","存续本金"),
    /**
     * 计费基数_费用品种_资产规模
     */
    计费基数_费用品种_资产规模(BussinessDictCode.计费基数_费用品种,"03","资产规模"),
    /**
     * 现金流单位_百元法
     */
    现金流单位_百元法(BussinessDictCode.现金流单位,"01","百元法"),
    /**
     * 现金流单位_总额法
     */
    现金流单位_总额法(BussinessDictCode.现金流单位,"02","总额法"),

 // 一体化对应etliu start
//    /**
//     * 支付频率_付息频率_到期支付
//     */
//    支付频率_付息频率_到期支付(BussinessDictCode.支付频率_付息频率,"01","到期支付"),
//    /**
//     * 支付频率_付息频率_年付
//     */
//    支付频率_付息频率_年付(BussinessDictCode.支付频率_付息频率,"02","年付"),
//    /**
//     * 支付频率_付息频率_半年付
//     */
//    支付频率_付息频率_半年付(BussinessDictCode.支付频率_付息频率,"03","半年付"),
//    /**
//     * 支付频率_付息频率_季付
//     */
//    支付频率_付息频率_季付(BussinessDictCode.支付频率_付息频率,"04","季付"),
//    /**
//     * 支付频率_付息频率_月付
//     */
//    支付频率_付息频率_月付(BussinessDictCode.支付频率_付息频率,"05","月付"),
//    /**
//     * 支付频率_付息频率_周付
//     */
//    支付频率_付息频率_周付(BussinessDictCode.支付频率_付息频率,"06","周付"),
//    /**
//     * 支付频率_付息频率_日付
//     */
//    支付频率_付息频率_日付(BussinessDictCode.支付频率_付息频率,"07","日付"),
//    /**
//     * 支付频率_付息频率_申购同频
//     */
//    支付频率_付息频率_申购同频(BussinessDictCode.支付频率_付息频率,"08","申购同频"),
//    /**
//     * 支付频率_付息频率_不规则
//     */
//    支付频率_付息频率_不规则(BussinessDictCode.支付频率_付息频率,"09","不规则"),
//    /**
//     * 支付频率_付息频率_到期一次性还本
//     */
//    支付频率_付息频率_到期一次性还本(BussinessDictCode.支付频率_付息频率,"10","到期一次性还本"),
//    /**
//     * 支付频率_付息频率_每半年等额还本
//     */
//    支付频率_付息频率_每半年等额还本(BussinessDictCode.支付频率_付息频率,"11","每半年等额还本"),
//    /**
//     * 支付频率_付息频率_每月等额还本
//     */
//    支付频率_付息频率_每月等额还本(BussinessDictCode.支付频率_付息频率,"12","每月等额还本"),
//    /**
//     * 支付频率_付息频率_每季等额还本
//     */
//    支付频率_付息频率_每季等额还本(BussinessDictCode.支付频率_付息频率,"13","每季等额还本"),
//    /**
//     * 支付频率_付息频率_每年等额还本
//     */
//    支付频率_付息频率_每年等额还本(BussinessDictCode.支付频率_付息频率,"14","每年等额还本"),
//    /**
//     * 支付频率_付息频率_按批复要求的项目进度还本
//     */
//    支付频率_付息频率_按批复要求的项目进度还本(BussinessDictCode.支付频率_付息频率,"15","按批复要求的项目进度还本"),
//    /**
//     * 支付频率_付息频率_按批复要求的项目进度还本
//     */
//    支付频率_付息频率_按明确时间的还款计划还本(BussinessDictCode.支付频率_付息频率,"15","按明确时间的还款计划还本"),
    /**
     * 频率_日
     */
    频率_日(BussinessDictCode.频率,"01","日"),
    /**
     * 频率_周
     */
    频率_周(BussinessDictCode.频率,"02","周"),
    /**
     * 频率_月
     */
    频率_月(BussinessDictCode.频率,"03","月"),
    /**
     * 频率_季
     */
    频率_季(BussinessDictCode.频率,"04","季"),
    /**
     * 频率_年
     */
    频率_年(BussinessDictCode.频率,"05","年"),
    /**
     * 频率_半年
     */
    频率_半年(BussinessDictCode.频率,"06","半年"),
    /**
     * 频率_到期一次
     */
    频率_到期一次(BussinessDictCode.频率,"07","到期一次"),
    /**
     * 频率_不规则
     */
    频率_不规则(BussinessDictCode.频率,"08","不规则"),
    /**
     * 频率_每半年等额还本
     */
    频率_每半年等额还本(BussinessDictCode.频率,"11","每半年等额还本"),
    /**
     * 频率_每月等额还本
     */
    频率_每月等额还本(BussinessDictCode.频率,"12","每月等额还本"),
    /**
     * 频率_每季等额还本
     */
    频率_每季等额还本(BussinessDictCode.频率,"13","每季等额还本"),
    /**
     * 频率_每年等额还本
     */
    频率_每年等额还本(BussinessDictCode.频率,"14","每年等额还本"),
    /**
     * 频率_按批复要求的项目进度还本
     */
    频率_按批复要求的项目进度还本(BussinessDictCode.频率,"15","按批复要求的项目进度还本"),
    /**
     * 频率_按明确时间的还款计划还本
     */
    频率_按明确时间的还款计划还本(BussinessDictCode.频率,"16","按明确时间的还款计划还本"),
 // 一体化对应etliu end

    /**
     * 分红规则 _到期
     */
    分红规则_到期(BussinessDictCode.分红规则,"01","到期支付"),
    /**
     * 分红规则 _周期
     */
    分红规则_周期(BussinessDictCode.分红规则,"02","周期支付"),
    /**
     * 分红规则 _每日
     */
    分红规则_每日(BussinessDictCode.分红规则,"07","日付"),
    /**
     * 分红规则 _申购同频
     */
    分红规则_申购同频(BussinessDictCode.分红规则,"08","申购同频"),
    /**
     * 分红规则 _不规则
     */
    分红规则_不规则(BussinessDictCode.分红规则,"09","不规则"),

    // 一体化对应etliu start
//    /**
//     * 付费规则_不规则
//     */
//    付费规则_不规则(BussinessDictCode.付费规则,"09","不规则"),
//    /**
//     * 付费规则_月
//     */
//    付费规则_月(BussinessDictCode.付费规则,"05","月付"),
//    /**
//     * 付费规则_季
//     */
//    付费规则_季(BussinessDictCode.付费规则,"04","季付"),
//    /**
//     * 付费规则_半年
//     */
//    付费规则_半年(BussinessDictCode.付费规则,"03","半年付"),
//    /**
//     * 付费规则_年
//     */
//    付费规则_年(BussinessDictCode.付费规则,"02","年付"),
//    /**
//     * 付费规则_到期
//     */
//    付费规则_到期(BussinessDictCode.付费规则,"01","到期支付"),
    // 一体化对应etliu end

    /**
     * 回购拆借方向_拆入
     */
    回购拆借方向_拆入(BussinessDictCode.回购拆借方向, "01", "拆入"),
    /**
     * 回购拆借方向_拆出
     */
    回购拆借方向_拆出(BussinessDictCode.回购拆借方向, "02", "拆出"),
    /**
     * 回购拆借方向_正回购
     */
    回购拆借方向_正回购(BussinessDictCode.回购拆借方向, "03", "正回购"),
    /**
     * 回购拆借方向_逆回购
     */
    回购拆借方向_逆回购(BussinessDictCode.回购拆借方向, "04", "逆回购"),
    /**
     * 角色岗位_领导
     */
    角色岗位_领导(BussinessDictCode.角色岗位, "01", "领导"),
    /**
     * 角色岗位_投资处长
     */
    角色岗位_投资处长(BussinessDictCode.角色岗位, "02", "投资处长"),
    /**
     * 角色岗位_交易处长
     */
    角色岗位_交易处长(BussinessDictCode.角色岗位, "03", "交易处长"),
    /**
     * 角色岗位_交易员
     */
    角色岗位_交易员(BussinessDictCode.角色岗位, "06", "交易员"),
    /**
     * 角色岗位_清算岗
     */
    角色岗位_清算岗(BussinessDictCode.角色岗位, "09","清算岗"),
    /**
     * 角色岗位_交易员_资本境外岗
     */
    角色岗位_交易员岗_资本境外(BussinessDictCode.角色岗位, "27", "交易员(资本境外)岗"),
    /**
     * 角色岗位_交易员_资本境内岗
     */
    角色岗位_交易员岗_资本境内(BussinessDictCode.角色岗位, "28", "交易员(资本境内)岗"),
    /**
     * 角色岗位_投资经理
     */
    角色岗位_投资经理(BussinessDictCode.角色岗位, "05", "投资经理"),
    /**
     * 角色岗位_项目经理岗
     */
    角色岗位_项目经理岗(BussinessDictCode.角色岗位, "12", "项目经理岗"),
    /**
     * 排期发行方式_集合
     */
    排期发行方式_集合(BussinessDictCode.排期发行方式, "01", "集合"),
    /**
     * 排期发行方式_单一
     */
    排期发行方式_单一(BussinessDictCode.排期发行方式, "02", "单一"),
    /**
     * 产品收益标识_非保本浮动收益
     */
    产品收益标识_非保本浮动收益(BussinessDictCode.产品收益标识, "03", "非保本浮动收益"),
    /**
     * 募集方式_公募
     */
    募集方式_公募(BussinessDictCode.募集方式, "01", "公募"),
    /**
     * 投资性质_固定收益类
     */
    投资性质_固定收益类(BussinessDictCode.投资性质, "01", "固定收益类"),
    /**
     * 产品风险等级_一级
     */
    产品风险等级_一级(BussinessDictCode.产品风险等级, "01", "一级（低）"),
    /**
     * 提前观察单位_延后时间单位_自然日
     */
    提前观察单位_延后时间单位_自然日(BussinessDictCode.提前观察单位_延后时间单位, "01", "自然日"),
    /**
     * 提前观察单位_延后时间单位_工作日
     */
    提前观察单位_延后时间单位_工作日(BussinessDictCode.提前观察单位_延后时间单位, "02", "工作日"),
    /**
     * 提前观察单位_延后时间单位_自然月
     */
    提前观察单位_延后时间单位_自然月(BussinessDictCode.提前观察单位_延后时间单位, "03", "自然月"),
    /**
     * 期限品种_产品端_T_PLUS_0
     */
    期限品种_产品端_T_PLUS_0(BussinessDictCode.期限品种_产品端, "01", "T+0"),
    /**
     * 期限品种_产品端_7天含以内
     */
    期限品种_产品端_7天含以内(BussinessDictCode.期限品种_产品端, "02", "7 天（含）以内"),
    /**
     * 期限品种_产品端_7天至1个月含
     */
    期限品种_产品端_7天至1个月含(BussinessDictCode.期限品种_产品端, "03", "7 天-1 个月（含）"),
    /**
     * 期限品种_产品端_1至3个月含
     */
    期限品种_产品端_1至3个月含(BussinessDictCode.期限品种_产品端, "04", "1-3 个月（含）"),
    /**
     * 期限品种_产品端_3至6个月含
     */
    期限品种_产品端_3至6个月含(BussinessDictCode.期限品种_产品端, "05", "3-6个月(含)"),
    /**
     * 期限品种_产品端_6至12个月含
     */
    期限品种_产品端_6至12个月含(BussinessDictCode.期限品种_产品端, "06", "6-12 个月（含）"),
    /**
     * 期限品种_产品端_1年以上
     */
    期限品种_产品端_1年以上(BussinessDictCode.期限品种_产品端, "07", "1 年以上"),
 // 一体化对应etliu start
//    /**
//     * 业绩基准规则_业绩基准
//     */
//    业绩基准规则_业绩基准(BussinessDictCode.业绩基准规则, "01" ,"业绩基准"),
//    /**
//     * 业绩基准规则_高水位法
//     */
//    业绩基准规则_高水位法(BussinessDictCode.业绩基准规则, "02" ,"高水位法"),
    /**
     * 业绩报酬计算规则_业绩基准
     */
    业绩报酬计算规则_业绩基准(BussinessDictCode.业绩报酬计算规则, "01" ,"业绩基准"),
    /**
     * 业绩基准规则_高水位法
     */
    业绩报酬计算规则_高水位法(BussinessDictCode.业绩报酬计算规则, "02" ,"高水位法"),
 // 一体化对应etliu end
    /**
     * 开放状态_开放
     */
    开放状态_开放(BussinessDictCode.开放状态,"01","开放"),
    /**
     * 项目类一级分类_非标债权
     */
    项目类一级分类_非标债权(BussinessDictCode.项目类一级分类,"P01","非标债权"),
    /**
     * 项目类一级分类_结构化证券
     */
    项目类一级分类_结构化证券(BussinessDictCode.项目类一级分类,"P02","结构化证券"),
    /**
     * 项目类一级分类_其他权益类投资
     */
    项目类一级分类_其他权益类投资(BussinessDictCode.项目类一级分类,"P03","其他权益类投资"),
    /**
     * 项目类一级分类_其他产业投资基金
     */
    项目类一级分类_其他产业投资基金(BussinessDictCode.项目类一级分类,"P04","其他产业投资基金"),
    /**
     * 项目类一级分类_股票定向增发投资
     */
    项目类一级分类_股票定向增发投资(BussinessDictCode.项目类一级分类,"P05","股票定向增发投资"),
    /**
     * 项目类一级分类_基础设施基金
     */
    项目类一级分类_基础设施基金(BussinessDictCode.项目类一级分类,"P06","基础设施基金"),
    /**
     * 项目类一级分类_券商债权收益权投资
     */
    项目类一级分类_券商债权收益权投资(BussinessDictCode.项目类一级分类,"P07","券商债权收益权投资"),
    /**
     * 项目类一级分类_信贷资产流转项目
     */
    项目类一级分类_信贷资产流转项目(BussinessDictCode.项目类一级分类,"P08","信贷资产流转项目"),
    /**
     * 项目类一级分类_券商收益凭证
     */
    项目类一级分类_券商收益凭证(BussinessDictCode.项目类一级分类,"P09","券商收益凭证"),
    /**
     * 项目类一级分类_股票质押式回购
     */
    项目类一级分类_股票质押式回购(BussinessDictCode.项目类一级分类,"P10","股票质押式回购"),
    /**
     * 项目类一级分类_理财直接融资工具
     */
    项目类一级分类_理财直接融资工具(BussinessDictCode.项目类一级分类,"P11","理财直接融资工具"),
    /**
     * 项目类一级分类_保险资产管理计划
     */
    项目类一级分类_保险资产管理计划(BussinessDictCode.项目类一级分类,"P12","保险资产管理计划"),
    /**
     *  分类维度_收益类型
     */
    分类维度_收益类型(BussinessDictCode.分类维度,"01","收益类型"),
    /**
     *  分类维度_开放类型
     */
    分类维度_开放类型(BussinessDictCode.分类维度,"02","开放类型"),
    /**
     *  分类维度_收益类型
     */
    分类维度_募集方式(BussinessDictCode.分类维度,"03","募集方式"),
    /**
     *  分类维度_投资性质
     */
    分类维度_投资性质(BussinessDictCode.分类维度,"04","投资性质"),
    /**
     *  使用状态_启用
     */
    使用状态_启用(BussinessDictCode.使用状态,"01","启用"),
    /**
     *  使用状态_停用
     */
    使用状态_停用(BussinessDictCode.使用状态,"02","停用"),
    /**
     *  一次性费用类型_交易手续费
     */
    一次性费用类型_交易手续费(BussinessDictCode.一次性费用类型,"02","交易手续费"),
    /**
     *  一次性费用类型_资产推荐费
     */
    一次性费用类型_资产推荐费(BussinessDictCode.一次性费用类型,"04","资产推荐费"),
    /**
     * 一次性费用类型_税费
     */
    一次性费用类型_税费(BussinessDictCode.一次性费用类型,"05","税费"),
    /**
     * 一次性费用类型_通道费
     */
    一次性费用类型_通道费(BussinessDictCode.一次性费用类型,"03", "通道费"),
    /**
     * 平安资产类型_债券
     */
    平安资产类型_债券(BussinessDictCode.平安资产类型,"F01","债券"),
    /**
     * 平安资产类型_基金
     */
    平安资产类型_基金(BussinessDictCode.平安资产类型,"F02","基金"),
    /**
     * 平安资产类型_计划类资产(利率型)
     */
    平安资产类型_计划类资产_利率型(BussinessDictCode.平安资产类型,"F03","计划类资产_利率型"),
    /**
     * 平安资产类型_计划类资产(净值型)
     */
    平安资产类型_计划类资产_净值型(BussinessDictCode.平安资产类型,"F04","计划类资产_净值型"),
    /**
     * 平安资产类型_存款
     */
    平安资产类型_存款(BussinessDictCode.平安资产类型,"F05","存款"),
    /**
     * 平安资产类型_项目类资产
     */
    平安资产类型_项目类资产(BussinessDictCode.平安资产类型,"F06","项目类资产"),
    /**
     * 平安资产类型_回购
     */
    平安资产类型_回购(BussinessDictCode.平安资产类型,"F07","质押式回购"),
    /**
     * 平安资产类型_拆借
     */
    平安资产类型_拆借(BussinessDictCode.平安资产类型,"F08","拆借"),
    /**
     * 平安资产类型_计划类资产_净值型
     */
    平安资产类型_计划类资产_货币型(BussinessDictCode.平安资产类型,"F09","平安资产类型_计划类资产_货币型"),
    /**
     * 平安资产类型_买断式回购
     */
    平安资产类型_买断式回购(BussinessDictCode.平安资产类型,"F10","买断式回购"),
    // add by wangguoxian 交易所交易费用设置 20190717 start
    /**
     * 平安资产类型_股票
     */
    平安资产类型_股票(BussinessDictCode.平安资产类型,"F11","股票"),
    // add by wangguoxian 交易所交易费用设置 20190717 end
    /**
     * 二级资产类别_票据类
     */
    二级资产类别_票据类(BussinessDictCode.二级资产类别,"1201","票据类"),
    /**
     * 二级资产类别_信用证
     */
    二级资产类别_信用证(BussinessDictCode.二级资产类别,"1210","信用证"),
    /**
     * 二级资产类别_其他非标准化债权类投资
     */
    二级资产类别_其他非标准化债权类投资(BussinessDictCode.二级资产类别,"1299","其他非标准化债权类投资"),
    /**
     * 拆出
     */
    二级资产类别_拆出(BussinessDictCode.二级资产类别,"1107","拆出"),
    /**
     * 本行存款
     */
    二级资产类别_本行存款(BussinessDictCode.二级资产类别,"1002","本行存款"),
    /**
     * 他行存款
    */
   二级资产类别_他行存款(BussinessDictCode.二级资产类别,"1003","他行存款"),
   /**
    * 本行发行的大额存单
    */
   二级资产类别_本行发行的大额存单(BussinessDictCode.二级资产类别,"1004","本行发行的大额存单"),
   /**
    * 他行发行的大额存单
    */
   二级资产类别_他行发行的大额存单(BussinessDictCode.二级资产类别,"1005","他行发行的大额存单"),
    /**
     * 自定义现金流类型_逾期利息
     */
    自定义现金流类型_逾期利息(BussinessDictCode.自定义现金流类型,"04","逾期利息"),
    /**
     * 自定义现金流类型_费用
     */
    自定义现金流类型_费用(BussinessDictCode.自定义现金流类型,"05","费用"),
    /**
     * 销售部门_零售
     */
    销售部门_零售(BussinessDictCode.销售部门,"01","零售产品管理部"),
    /**
     * 金融同业部
     */
    销售部门_同业(BussinessDictCode.销售部门,"02","金融同业部"),
    /**
     * 销售部门_对公
     */
    销售部门_对公(BussinessDictCode.销售部门,"03","对公产品"),
    /**
     * 销售部门_现金管理部
     */
    销售部门_现金(BussinessDictCode.销售部门,"04","现金管理部"),
    /**
     * 销售部门_统一TA
     */
    销售部门_统一TA(BussinessDictCode.销售部门,"05","统一TA"),
    /**
     * 业务表_金融产品交易表
     */
    业务表_金融产品交易表(BussinessDictCode.业务表,"01","金融产品交易表"),
    /**
     * 业务表_交易资金指令表
     */
    业务表_交易资金指令表(BussinessDictCode.业务表,"02","交易资金指令表"),
    /**
     * 机构类型_按规模划分_大型企业
     */
    机构类型_按规模划分_大型企业(BussinessDictCode.机构类型_按规模划分,"02","02 大型企业"),
    /**
     * 日期规则_平台日期
     */
    日期规则_平台日期(BussinessDictCode.日期规则,"01","平台日期"),
    /**
     * 日期规则_AP服务器日期
     */
    日期规则_AP服务器日期(BussinessDictCode.日期规则,"02","系统日期（AP服务器日期）"),
    /**
     * 日期规则_DB日期
     */
    日期规则_DB日期(BussinessDictCode.日期规则,"03","系统日期（DB日期）"),
    /**
     * 产品投资国家或地区_CHN_中国
     */
    产品投资国家或地区_CHN_中国(BussinessDictCode.产品投资国家或地区,"CHN","CHN 中国"),
    /**
     * 合作模式_独立运作
     */
    合作模式_独立运作(BussinessDictCode.合作模式,"01","独立运作"),
    /**
     * 产品运作模式_封闭式净值型
     */
    产品运作模式_封闭式净值型(BussinessDictCode.产品运作模式,"01","封闭式净值型"),
    /**
     * 产品运作模式_封闭式非净值型
     */
    产品运作模式_封闭式非净值型(BussinessDictCode.产品运作模式,"02","封闭式非净值型"),
    /**
     * 产品运作模式_开放式净值型
     */
    产品运作模式_开放式净值型(BussinessDictCode.产品运作模式,"03","开放式净值型"),
    /**
     * 产品运作模式_开放式非净值型
     */
    产品运作模式_开放式非净值型(BussinessDictCode.产品运作模式,"04","开放式非净值型"),
    /**
     * 指标类型_限制投资金额类
     */
    指标类型_限制投资金额类(BussinessDictCode.指标类型,"LIMIT_AMOUNT","限制投资-金额类"),
	/**
     * 指标类型_制投资比例类
     */
    指标类型_限制投资比例类(BussinessDictCode.指标类型,"LIMIT_RATIO","限制投资-比例类"),
	/**
     * 指标类型_限制投资期限类
     */
    指标类型_限制投资期限类(BussinessDictCode.指标类型,"LIMIT_DEADLINE","限制投资-期限类"),
	/**
     * 指标类型_禁止投资-资产类型
     */
    指标类型_禁止投资资产类型(BussinessDictCode.指标类型,"FORBID_ASSETTYPE","禁止投资-资产类型"),
	/**
     * 指标类型_禁止投资-债券二级类型
     */
    指标类型_禁止投资债券二级类型(BussinessDictCode.指标类型,"FORBID_BONDTYPE","禁止投资-债券二级类型"),
	/**
     * 指标类型_禁止投资-基金类型
     */
    指标类型_禁止投资基金类型(BussinessDictCode.指标类型,"FORBID_FUNDTYPE","禁止投资-基金类型"),
	/**
     * 指标类型_禁止投资-资产类型
     */
    指标类型_禁止投资债项评级(BussinessDictCode.指标类型,"FORBID_DEBTRATE","禁止投资-债项评级"),
	/**
     * 指标类型_禁止投资-主体评级
     */
    指标类型_禁止投资主体评级(BussinessDictCode.指标类型,"FORBID_BODYRATE","禁止投资-主体评级"),
    /**
     * 指标类型_禁止投资-行业负面清单
     */
    指标类型_禁止投资行业负面清单(BussinessDictCode.指标类型,"FORBID_INDUSTRY","禁止投资-行业负面清单"),
    /**
     * 匹配状态_未匹配
     */
    匹配状态_未匹配(BussinessDictCode.匹配状态,"02","未匹配"),
    /**
     * 费用品种类型_托管费
     */
    费用品种类型_托管费(BussinessDictCode.费用品种类型,"01","托管费"),
    /**
     * 费用品种类型_销售手续费
     */
    费用品种类型_销售手续费(BussinessDictCode.费用品种类型,"02","销售手续费"),
    /**
     * 费用品种类型_固定管理费
     */
    费用品种类型_固定管理费(BussinessDictCode.费用品种类型,"03","固定管理费"),
    /**
     * 费用品种类型_浮动差额中收
     */
    费用品种类型_浮动差额中收(BussinessDictCode.费用品种类型,"04","浮动差额中收"),
    /**
     * 费用品种类型_浮动管理费
     */
    费用品种类型_浮动管理费(BussinessDictCode.费用品种类型,"12","浮动管理费"),
    /**
     * 费用品种类型_代销费
     */
    费用品种类型_代销费(BussinessDictCode.费用品种类型,"05","代销费"),
    /**
     * 费用品种类型_交易手续费
     */
    费用品种类型_交易手续费(BussinessDictCode.费用品种类型,"06","交易手续费"),
    /**
     * 费用品种类型_结算服务费
     */
    费用品种类型_结算服务费(BussinessDictCode.费用品种类型,"07","结算服务费"),
    /**
     * 费用品种类型_账户维护费
     */
    费用品种类型_账户维护费(BussinessDictCode.费用品种类型,"08","账户维护费"),
    /**
     * 费用品种类型_增值附加税费
     */
    费用品种类型_增值附加税费(BussinessDictCode.费用品种类型,"09","增值附加税费"),
    /**
     * 费用品种类型_通道托管费
     */
    费用品种类型_通道托管费(BussinessDictCode.费用品种类型,"10","通道托管费"),
    /**
     * 费用品种类型_通道管理费
     */
    费用品种类型_通道管理费(BussinessDictCode.费用品种类型,"11","通道管理费"),
    /**
     * 费用品种类型_外包服务费
     */
    费用品种类型_外包服务费(BussinessDictCode.费用品种类型,"13","外包服务费"),
    /**
     * 费用品种类型_其他费用
     */
    费用品种类型_其他费用(BussinessDictCode.费用品种类型,"99","其他费用"),
    /**
     * 匹配状态_已匹配
     */
    匹配状态_已匹配(BussinessDictCode.匹配状态,"01","已匹配"),
    /**
     * 连接符_并且
     */
    连接符_并且(BussinessDictCode.连接符,"AND","并且"),
    /**
     * 连接符_或
     */
    连接符_或(BussinessDictCode.连接符,"OR","或"),
    /**
     * 单位_万元
     */
    单位_万元(BussinessDictCode.连接符,"WRMB","万元"),
    /**
     * 单位_百分比
     */
    单位_百分比(BussinessDictCode.连接符,"PERCENT","%"),
    /**
     * 监督时分_委托监控
     */
    监督时分_委托监控(BussinessDictCode.监督时分,"01","委托监控"),
    /**
     * 监督时分_交易监控
     */
    监督时分_交易监控(BussinessDictCode.监督时分,"02","交易监控"),
    /**
     * 监督时分_事后监控
     */
    监督时分_事后监控(BussinessDictCode.监督时分,"03","事后监控"),

    // 一体化对应etliu start
    /**
     * WIND二级分类_含债券二级分类等_同业存单
     */
    WIND一级分类_含债券一级分类等_同业存单(BussinessDictCode.WIND一级分类_含债券一级分类等,"B04","同业存单"),
    // 一体化对应etliu end

    /**
     * WIND二级分类_含债券二级分类等_金融债
     */
    WIND一级分类_含债券一级分类等_金融债(BussinessDictCode.WIND一级分类_含债券一级分类等,"B05","金融债"),
    /**
     * WIND二级分类_含债券二级分类等_短期融资券
     */
    WIND一级分类_含债券一级分类等_短期融资券(BussinessDictCode.WIND一级分类_含债券一级分类等,"B09","短期融资券"),
    /**
     * WIND二级分类_含债券二级分类等_定向工具
     */
    WIND一级分类_含债券一级分类等_定向工具(BussinessDictCode.WIND一级分类_含债券一级分类等,"B10","定向工具"),
    /**
     * WIND二级分类_含债券二级分类等_中期票据
     */
    WIND一级分类_含债券一级分类等_中期票据(BussinessDictCode.WIND一级分类_含债券一级分类等,"B08","中期票据"),
    /**
     * WIND二级分类_含债券二级分类等_企业债
     */
    WIND一级分类_含债券一级分类等_企业债(BussinessDictCode.WIND一级分类_含债券一级分类等,"B06","企业债"),
    /**
     * WIND二级分类_含债券二级分类等_公司债
     */
    WIND一级分类_含债券一级分类等_公司债(BussinessDictCode.WIND一级分类_含债券一级分类等,"B07","公司债"),
    /**
     * WIND二级分类_含债券二级分类等_资产支持证券
     */
    WIND一级分类_含债券一级分类等_资产支持证券(BussinessDictCode.WIND一级分类_含债券一级分类等,"B13","资产支持证券"),
    /**
     * 中央国债登记结算有限责任公司
     */
    中债_登记托管机构_中央国债登记结算有限责任公司(BussinessDictCode.中债_登记托管机构,"01","中央国债登记结算有限责任公司"),
    /**
     * 上海清算所
     */
    中债_登记托管机构_上海清算所(BussinessDictCode.中债_登记托管机构,"02","上海清算所"),
    /**
     * 中国证券登记结算有限责任公司
     */
    中债_登记托管机构_中国证券登记结算有限责任公司(BussinessDictCode.中债_登记托管机构,"03","中国证券登记结算有限责任公司"),
    /**
     * 其他
     */
    中债_登记托管机构_其他(BussinessDictCode.中债_登记托管机构,"99","其他"),
    /**
     * 估值来源_中债登
     */
    估值来源_中债登(BussinessDictCode.估值来源,"CBC","中债登"),
    /**
     * 估值来源_中证登
     */
    估值来源_中证登(BussinessDictCode.估值来源,"CSD","中证登"),
    /**
     * 估值来源_上清所
     */
    估值来源_上清所(BussinessDictCode.估值来源,"SCH","上清所"),
    /**
     * 币种钞汇标志_钞
     */
    币种钞汇标志_钞(BussinessDictCode.币种钞汇标志,"01","钞"),

    /**
     * 资产附件类型_批复文件
     */
    资产附件类型_批复文件(BussinessDictCode.资产附件类型,"01","批复文件"),
    /**
     * 资产附件类型_CMS批复文件
     */
    资产附件类型_CMS批复文件(BussinessDictCode.币种钞汇标志,"02","CMS批复文件"),

    授权类型_不授权(BussinessDictCode.授权类型,"01","不授权"),
    /**
     * 授权
     */
    授权类型_授权(BussinessDictCode.授权类型,"02","授权"),
    /**
     * 无限授权
     */
    授权类型_无限授权(BussinessDictCode.授权类型,"03","无限授权"),
    /**
     * 中债_项目类二级资产类别_理财直接融资工具
     */
    中债_项目类二级资产类别_理财直接融资工具(BussinessDictCode.中债_项目类二级资产类别,"2101","理财直接融资工具"),
    /**
     * 中债_项目类二级资产类别_基础设施基金
     */
    中债_项目类二级资产类别_基础设施基金(BussinessDictCode.中债_项目类二级资产类别,"2612","基础设施基金"),
    /**
     * 境内外_境内
     */
    境内外_境内(BussinessDictCode.境内外,"01","境内"),
    /**
     * 境内外_境外
     */
    境内外_境外(BussinessDictCode.境内外,"02","境外"),
    /**
     * 回购期限品种_GC001(上交所)
     */
    回购期限品种_GC001(BussinessDictCode.回购期限品种,"GC001","GC001"),
    /**
     * 回购期限品种_GC002(上交所)
     */
    回购期限品种_GC002(BussinessDictCode.回购期限品种,"GC002","GC002"),
    /**
     * 回购期限品种_GC003(上交所)
     */
    回购期限品种_GC003(BussinessDictCode.回购期限品种,"GC003","GC003"),
    /**
     * 回购期限品种_GC004(上交所)
     */
    回购期限品种_GC004(BussinessDictCode.回购期限品种,"GC004","GC004"),
    /**
     * 回购期限品种_GC007(上交所)
     */
    回购期限品种_GC007(BussinessDictCode.回购期限品种,"GC007","GC007"),
    /**
     * 回购期限品种_GC014(上交所)
     */
    回购期限品种_GC014(BussinessDictCode.回购期限品种,"GC014","GC014"),
    /**
     * 回购期限品种_GC028(上交所)
     */
    回购期限品种_GC028(BussinessDictCode.回购期限品种,"GC028","GC028"),
    /**
     * 回购期限品种_GC091(上交所)
     */
    回购期限品种_GC091(BussinessDictCode.回购期限品种,"GC091","GC091"),
    /**
     * 回购期限品种_GC182(上交所)
     */
    回购期限品种_GC182(BussinessDictCode.回购期限品种,"GC182","GC182"),
    /**
     * 回购期限品种_R-001(深交所)
     */
    回购期限品种_R_001(BussinessDictCode.回购期限品种,"R-001","R-001"),
    /**
     * 回购期限品种_R-002(深交所)
     */
    回购期限品种_R_002(BussinessDictCode.回购期限品种,"R-002","R-002"),
    /**
     * 回购期限品种_R-003(深交所)
     */
    回购期限品种_R_003(BussinessDictCode.回购期限品种,"R-003","R-003"),
    /**
     * 回购期限品种_R-004(深交所)
     */
    回购期限品种_R_004(BussinessDictCode.回购期限品种,"R-004","R-004"),
    /**
     * 回购期限品种_R-007(深交所)
     */
    回购期限品种_R_007(BussinessDictCode.回购期限品种,"R-007","R-007"),
    /**
     * 回购期限品种_R-014(深交所)
     */
    回购期限品种_R_014(BussinessDictCode.回购期限品种,"R-014","R-014"),
    /**
     * 回购期限品种_R-028(深交所)
     */
    回购期限品种_R_028(BussinessDictCode.回购期限品种,"R-028","R-028"),
    /**
     * 回购期限品种_R-091(深交所)
     */
    回购期限品种_R_091(BussinessDictCode.回购期限品种,"R-091","R-091"),
    /**
     * 回购期限品种_R-182(深交所)
     */
    回购期限品种_R_182(BussinessDictCode.回购期限品种,"R-182","R-182"),
    /**
     * 回购期限品种_RC001(深交所)
     */
    回购期限品种_RC001(BussinessDictCode.回购期限品种,"RC001","RC001"),
    /**
     * 回购期限品种_RC003(深交所)
     */
    回购期限品种_RC003(BussinessDictCode.回购期限品种,"RC003","RC003"),
    /**
     * 回购期限品种_RC007(深交所)
     */
    回购期限品种_RC007(BussinessDictCode.回购期限品种,"RC007","RC007"),
    /**
     * 回购期限品种_R001(银行间)
     */
    回购期限品种_R001(BussinessDictCode.回购期限品种,"R001","R001"),
    /**
     * 回购期限品种_R007(银行间)
     */
    回购期限品种_R007(BussinessDictCode.回购期限品种,"R007","R007"),
    /**
     * 回购期限品种_R014(银行间)
     */
    回购期限品种_R014(BussinessDictCode.回购期限品种,"R014","R014"),
    /**
     * 回购期限品种_R021(银行间)
     */
    回购期限品种_R021(BussinessDictCode.回购期限品种,"R021","R021"),
    /**
     * 回购期限品种_R1M(银行间)
     */
    回购期限品种_R1M(BussinessDictCode.回购期限品种,"R1M","R1M"),
    /**
     * 回购期限品种_R2M(银行间)
     */
    回购期限品种_R2M(BussinessDictCode.回购期限品种,"R2M","R2M"),
    /**
     * 回购期限品种_R3M(银行间)
     */
    回购期限品种_R3M(BussinessDictCode.回购期限品种,"R3M","R3M"),
    /**
     * 回购期限品种_R4M(银行间)
     */
    回购期限品种_R4M(BussinessDictCode.回购期限品种,"R4M","R4M"),
    /**
     * 回购期限品种_R6M(银行间)
     */
    回购期限品种_R6M(BussinessDictCode.回购期限品种,"R6M","R6M"),
    /**
     * 账户来源_理财
     */
    账户来源_理财(BussinessDictCode.账户来源,"01","理财"),
    /**
     * 账户来源_自营
     */
    账户来源_自营(BussinessDictCode.账户来源,"02","自营"),
    /**
     * 映射状态_未映射
     */
    映射状态_未映射(BussinessDictCode.映射状态,"01","未映射"),
    /**
     * 映射状态_已映射
     */
    映射状态_已映射(BussinessDictCode.映射状态,"02","已映射"),
    /**
     * 估值资产来源_系统内
     */
    估值资产来源_系统内(BussinessDictCode.估值资产来源,"01","系统内"),
    /**
     * 估值资产来源_WIND债券
     */
    估值资产来源_WIND债券(BussinessDictCode.估值资产来源,"02","WIND债券"),
    /**
     * 估值资产来源_WIND基金
     */
    估值资产来源_WIND基金(BussinessDictCode.估值资产来源,"03","WIND基金"),
    /**
     * 资产科目类别_债券
     */
    资产科目类别_债券(BussinessDictCode.资产科目类别,"ZQ","债券"),
    /**
     * 资产科目类别_基金
     */
    资产科目类别_基金(BussinessDictCode.资产科目类别,"JJ","基金"),
 // 一体化对应etliu start
    /**
     * 含权债摊销日_最近行权日）（一体化对应etliu）
     */
    含权债摊销日_最近行权日(BussinessDictCode.含权债摊销日,"01","最近行权日"),
    /**
     * 税类型_利息收入
     */
    税类型_利息收入(BussinessDictCode.税类型,"TAX0102","利息收入"),
    /**
     * 税类型_红利收入
     */
    税类型_红利收入(BussinessDictCode.税类型,"TAX0202","红利收入"),
    /**
     * 税类型_价差收入
     */
    税类型_价差收入(BussinessDictCode.税类型,"TAX0302","价差收入"),
    /**
     * 税类型_城建税
     */
    税类型_城建税(BussinessDictCode.税类型,"ALT0102","城建税"),
    /**
     * 税类型_教育费
     */
    税类型_教育费(BussinessDictCode.税类型,"ALT0202","教育费"),
    /**
     * 税类型_地方教育费
     */
    税类型_地方教育费(BussinessDictCode.税类型,"ALT0302","地方教育费"),
    
    /**
     * 税类型_水利基金税
     */
    税类型_水利基金税(BussinessDictCode.税类型,"ALT0402","水利基金税"),
    /**
     * 动作标志_新增
     */
    动作标志_新增(BussinessDictCode.动作标志,"01","新增"),
    /**
     * 动作标志_修改
     */
    动作标志_修改(BussinessDictCode.动作标志,"02","修改"),
    /**
     * 动作标志_删除
     */
    动作标志_删除(BussinessDictCode.动作标志,"03","删除"),
    /**
     * 估值舍入规则_进位
     */
    估值舍入规则_进位(BussinessDictCode.估值舍入规则,"01","进位"),
    /**
     * 估值舍入规则_舍位
     */
    估值舍入规则_舍位(BussinessDictCode.估值舍入规则,"02","舍位"),
    /**
     * 估值舍入规则_四舍五入
     */
    估值舍入规则_四舍五入(BussinessDictCode.估值舍入规则,"03","四舍五入"),
    /**
     * 计提类型_高频
     */
    计提类型_高频(BussinessDictCode.计提类型,"01","高频"),
    /**
     * 计提类型_固定频率
     */
    计提类型_固定频率(BussinessDictCode.计提类型,"02","固定频率"),
    /**
     * 导入方式_手工
     */
    导入方式_手工(BussinessDictCode.导入方式,"01","手工"),
    /**
     * 导入方式_自动
     */
    导入方式_自动(BussinessDictCode.导入方式,"02","自动"),

    /**
     * 回购标的类型_中债_债券
     */
    回购标的类型_中债_债券(BussinessDictCode.回购标的类型_中债,"01","债券"),
    /**
     * 回购标的类型_中债_股票
     */
    回购标的类型_中债_股票(BussinessDictCode.回购标的类型_中债,"02","股票"),
    /**
     * 回购标的类型_中债_基金类产品
     */
    回购标的类型_中债_基金类产品(BussinessDictCode.回购标的类型_中债,"03","基金类产品"),
    /**
     * 回购标的类型_中债_其他
     */
    回购标的类型_中债_其他(BussinessDictCode.回购标的类型_中债,"04","其他"),
    /**
     * 业务类型_拆借交易
     */
    业务类型_拆借交易(BussinessDictCode.业务类型,"01","拆借交易"),
    /**
     * 业务类型_银行间债券交易
     */
    业务类型_银行间债券交易(BussinessDictCode.业务类型,"02","银行间债券交易"),
    /**
     * 业务类型_存款类资产交易
     */
    业务类型_存款类资产交易(BussinessDictCode.业务类型,"03","存款类资产交易"),
    /**
     * 业务类型_债券质押式回购交易
     */
    业务类型_债券质押式回购交易(BussinessDictCode.业务类型,"04","债券质押式回购交易"),
    /**
     * 业务类型_债券买断式回购交易
     */
    业务类型_债券买断式回购交易(BussinessDictCode.业务类型,"05","债券买断式回购交易"),
    /**
     * 业务类型_货币基金交易_货基类货基资产交易
     */
    业务类型_货币基金交易_货基类货基资产交易(BussinessDictCode.业务类型,"06","货币基金交易（货基、类货基资产交易）"),
    /**
     * 业务类型_非货币基金交易（非货基、非类货基资产交易）
     */
    业务类型_非货币基金交易_非货基非类货基资产交易(BussinessDictCode.业务类型,"07","非货币基金交易（非货基、非类货基资产交易）"),
    /**
     * 业务类型_计划类资产交易（类债券资产交易）
     */
    业务类型_计划类资产交易_类债券资产交易(BussinessDictCode.业务类型,"09","计划类资产交易（类债券资产交易）"),
    /**
     * 业务类型_活期存款交易
     */
    业务类型_活期存款交易(BussinessDictCode.业务类型,"15","活期存款交易"),
    /**
     * 业务类型_增值税交易
     */
    业务类型_增值税交易(BussinessDictCode.业务类型,"16","增值税交易"),
    /**
     * 业务类型_净值型TA交易
     */
    业务类型_净值型TA交易(BussinessDictCode.业务类型,"17","净值型TA交易"),
    /**
     * 业务类型_产品费用交易
     */
    业务类型_产品费用交易(BussinessDictCode.业务类型,"18","产品费用交易"),
    /**
     * 业务类型_指令交易
     */
    业务类型_指令交易(BussinessDictCode.业务类型,"19","指令交易"),
    /**
     * 业务类型_货币型TA交易
     */
    业务类型_货币型TA交易(BussinessDictCode.业务类型,"21","货币型TA交易"),
    /**
     * 业务类型_预期收益型TA交易
     */
    业务类型_预期收益型TA交易(BussinessDictCode.业务类型,"27","预期收益型TA交易"),
    /**
     * 估值资金账户类型_托管户
     */
    估值资金账户类型_托管户(BussinessDictCode.估值资金账户类型,"A01","托管户"),
    /**
     * 估值资金账户类型_通道账户
     */
    估值资金账户类型_通道账户(BussinessDictCode.估值资金账户类型,"A02","通道账户"),
    /**
     * 估值资金账户类型_结算备付金
     */
    估值资金账户类型_结算备付金(BussinessDictCode.估值资金账户类型,"A04","结算备付金"),
    /**
     * 金融产品类型_理财产品
     */
    金融产品类型_理财产品(BussinessDictCode.金融产品类型,"F16","理财产品"),
    /**
     * 金融产品类型_投资组合
     */
    金融产品类型_投资组合(BussinessDictCode.金融产品类型,"F18","投资组合"),
    /**
     * 金融产品类型_理财子产品
     */
    金融产品类型_理财子产品(BussinessDictCode.金融产品类型,"F22","理财子产品"),
    
	/**
	 * 金融产品类型_通道
	 */
	金融产品类型_通道(BussinessDictCode.金融产品类型, "F26", "通道"),

    /**
     * 资金账户
     */
    金融产品类型_投管用_资金账户(BussinessDictCode.金融产品类型_投管用,"F21","资金账户"),
 // 一体化对应etliu end

    /**
     * 中债_项目类二级资产类别_票据类
     */
    中债_项目类二级资产类别_票据类(BussinessDictCode.中债_项目类二级资产类别,"1201","票据类"),
    /**
     * 中债_项目类二级资产类别_信用证
     */
    中债_项目类二级资产类别_信用证(BussinessDictCode.中债_项目类二级资产类别,"1210","信用证"),
    /**
     * 重置规则_期初
     */
    重置规则_期初(BussinessDictCode.重置规则,"01","期初"),
    /**
    * 重置规则_期末
    */
   重置规则_期末(BussinessDictCode.重置规则,"02","期末"),
   /**
   * 重置规则_当期生效
   */
  重置规则_当期生效(BussinessDictCode.重置规则,"03","当期生效"),
    /**
     * 到期结算方式_券款对付
     */
    到期结算方式_券款对付(BussinessDictCode.到期结算方式,"DVP","券款对付"),
    /**
     * 资产投资性质_债权类
     */
    资产投资性质_债权类(BussinessDictCode.资产投资性质,"01","债权类"),
    /**
     * 资产投资性质_权益类
     */
    资产投资性质_权益类(BussinessDictCode.资产投资性质,"02","权益类"),
    /**
     * 资产投资性质_商品及金融衍生品类
     */
    资产投资性质_商品及金融衍生品类(BussinessDictCode.资产投资性质,"03","商品及金融衍生品类"),
    /**
     * 机构类型_按经济类型划分_国有企业
     */
    机构类型_按经济类型划分_国有企业(BussinessDictCode.机构类型_按经济类型划分,"01","01 国有企业"),
    /**
     * 机构类型_按经济类型划分_集体企业
     */
    机构类型_按经济类型划分_集体企业(BussinessDictCode.机构类型_按经济类型划分,"02","02 集体企业"),
    /**
     * 机构类型_按经济类型划分_私营企业
     */
    机构类型_按经济类型划分_私营企业(BussinessDictCode.机构类型_按经济类型划分,"03","03 私营企业"),
    /**
     * 机构类型_按经济类型划分_其他
     */
    机构类型_按经济类型划分_其他(BussinessDictCode.机构类型_按经济类型划分,"99","99 其他"),
    /**
     * 评级类型_主体评级
     */
    评级类型_主体评级(BussinessDictCode.评级类型,"01","主体评级"),
    /**
     * 评级类型_债项评级
     */
    评级类型_债项评级(BussinessDictCode.评级类型,"02","债项评级"),

    /**
     * 是否需要监控授信开关
     */
    监控授信开关_关(BussinessDictCode.是否占用授信, "N", "否"),
    /**
     * 授信使用条件开关_关
     */
    授信使用条件开关_关(BussinessDictCode.是否占用授信, "N", "否"),
  /**
   * 发行方式_公开发行
   */
  发行方式_公开发行(BussinessDictCode.发行方式,"01","公开发行"),
  /**
   * 税类型_非公开发行
   */
  发行方式_非公开发行(BussinessDictCode.发行方式,"02","非公开发行"),
  /**
   * 中债_是否_是
   */
  中债_是否_是(BussinessDictCode.中债_是否,"01","是"),
  /**
   * 中债_是否_否
   */
  中债_是否_否(BussinessDictCode.中债_是否,"02","否"),
  /**
   * 中债_二级资产类别_同业拆入
   */
  中债_二级资产类别_同业拆入(BussinessDictCode.二级资产类别,"1901","同业拆入"),
  /**
   * 中债_二级资产类别_卖出回购
   */
  中债_二级资产类别_卖出回购(BussinessDictCode.二级资产类别,"1902","卖出回购"),
  /**
   * 中债_二级资产类别_拆放同业
   */
  中债_二级资产类别_拆放同业(BussinessDictCode.二级资产类别,"1107","拆放同业"),
  /**
   * 中债_二级资产类别_买入返售
   */
  中债_二级资产类别_买入返售(BussinessDictCode.二级资产类别,"1108","买入返售"),
  /**
   * 中债_二级资产类别_货币市场基金
   */
  中债_二级资产类别_货币市场基金(BussinessDictCode.二级资产类别,"2401","货币市场基金"),
  /**
   * 中债_二级资产类别_债券基金
   */
  中债_二级资产类别_债券基金(BussinessDictCode.二级资产类别,"1106","债券基金"),
  /**
   * 中债_二级资产类别_股票基金
   */
  中债_二级资产类别_股票基金(BussinessDictCode.二级资产类别,"1303","股票基金"),
  /**
   * 中债_二级资产类别_基金中基金
   */
  中债_二级资产类别_基金中基金(BussinessDictCode.二级资产类别,"2403","基金中基金"),
  /**
   * 中债_二级资产类别_混合基金
   */
  中债_二级资产类别_混合基金(BussinessDictCode.二级资产类别,"2402","混合基金"),
  /**
   * 中债_二级资产类别_其他公募基金
   */
  中债_二级资产类别_其他公募基金(BussinessDictCode.二级资产类别,"2499","其他公募基金"),
  /**
   * 全国银行间同业拆借市场
   */
  交易流通市场_全国银行间同业拆借市场(BussinessDictCode.交易流通场所,"17","全国银行间同业拆借市场"),
  /**
   * 银行间债券市场
   */
  交易流通市场_银行间债券市场(BussinessDictCode.交易流通场所,"01","银行间债券市场"),
  /**
   * 上海证券交易所
   */
  交易流通市场_上海证券交易所(BussinessDictCode.交易流通场所,"03","上海证券交易所"),
  /**
   * 深圳证券交易所
   */
  交易流通市场_深圳证券交易所(BussinessDictCode.交易流通场所,"04","深圳证券交易所"),
  /**
   * 中债_计息基础_ACT366
   */
  中债_计息基础_ACT366(BussinessDictCode.中债_计息基础,"01","ACT/366"),
  /**
   * 中债_计息基础_ACT360
   */
  中债_计息基础_ACT360(BussinessDictCode.中债_计息基础,"02","ACT/360"),
  /**
   * 中债_计息基础_ACT365
   */
  中债_计息基础_ACT365(BussinessDictCode.中债_计息基础,"03","ACT/365"),
  /**
   * 中债_计息基础_ACTACT
   */
  中债_计息基础_ACTACT(BussinessDictCode.中债_计息基础,"04","ACT/ACT"),
  /**
   * 中债_计息基础_30360
   */
  中债_计息基础_30360(BussinessDictCode.中债_计息基础,"05","30/360"),
  /**
   * 产品资产配置方式_单一资产配置
   */
  产品资产配置方式_单一资产配置(BussinessDictCode.产品资产配置方式,"01","单一资产配置"),
  /**
   * 产品资产配置方式_组合配置
   */
  产品资产配置方式_组合配置(BussinessDictCode.产品资产配置方式,"02","组合配置"),
  /**
   * 产品资产配置方式_其他
   */
  产品资产配置方式_其他(BussinessDictCode.产品资产配置方式,"03","其他"),

  /**
   * 展示层级_01
   */
  展示层级_01(BussinessDictCode.展示层级,"01","一级"),
  /**
   * 展示层级_02
   */
  展示层级_02(BussinessDictCode.展示层级,"02","二级"),
  /**
   * 展示层级_03
   */
  展示层级_03(BussinessDictCode.展示层级,"03","三级"),
  /**
   * 展示层级_04
   */
  展示层级_04(BussinessDictCode.展示层级,"04","四级"),

//sjj add 授信参数传值方式修改  start
  /**
   * 机构授信
   */
  授信配置代码_机构授信(BussinessDictCode.授信配置代码, "0001", "机构授信"),
  /**
   * 资产授信
   */
  授信配置代码_资产授信(BussinessDictCode.授信配置代码, "0002", "资产授信"),
  /**
   * 系列授信
   */
  授信配置代码_系列授信(BussinessDictCode.授信配置代码, "0003", "系列授信"),
  /**
   * 品种授信
   */
  授信配置代码__品种授信(BussinessDictCode.授信配置代码, "0004", "品种授信"),
  /**
   * 共同业务类型_期次管理
   */
  共同业务类型_期次管理(BussinessDictCode.共同业务类型, "FINASSET13", "期次管理"),
  //sjj add 授信参数传值方式修改  end
  /**
   * 金融产品类型_投管_母资管计划
   */
  金融产品类型_投管用_母资管计划(BussinessDictCode.金融产品类型,"F27","母资管计划"),
  /**
   * 金融产品类型_投管_通道
   */
  金融产品类型_投管用_通道(BussinessDictCode.金融产品类型,"F28","通道"),
    /**
     * 池类型_资产池
     */
    池类型_资产池(BussinessDictCode.池类型,"01" , "资产池"),
    /**
     * 池类型_机构池
     */
    池类型_机构池(BussinessDictCode.池类型,"02" , "机构池"),

    /**
     * 机构类型_总行
     */
    机构类型_省联社(BussinessDictCode.机构类型, "01", "省联社"),
    /**
     * 出入项类型_资产
     */
    出入项类型_资产(BussinessDictCode.出入项类型,"01" , "资产"),
    /**
     * 出入项类型_机构
     */
    出入项类型_机构(BussinessDictCode.出入项类型,"02" , "机构"),
    /**
     * 出入类型_入池
     */
    出入类型_入池(BussinessDictCode.出入类型,"01" , "入池"),
    /**
     * 出入类型_出池
     */
    出入类型_出池(BussinessDictCode.出入类型,"02" , "出池"),
    /**
     * 划款方式_逐笔划款
     */
	划款方式_逐笔划款(BussinessDictCode.划款方式,"01" , "逐笔划款"),

    /**
     * 划款方式_一次性划款
     */
	划款方式_一次性划款(BussinessDictCode.划款方式,"02" , "一次性划款"),
  /**
   * 逆回购到期
   */
  共同业务类型_逆回购到期(BussinessDictCode.共同业务类型,"TRD42","逆回购到期"),
  /**
   * 正回购到期
   */
  共同业务类型_正回购到期(BussinessDictCode.共同业务类型,"TRD43","正回购到期"),
  /**
   * 通道资金划拨管理
   */
  共同业务类型_通道资金划拨管理(BussinessDictCode.共同业务类型,"PTL10","通道资金划拨管理"),
  /**
   * 通道划款
   */
  交易方向_通道划款(BussinessDictCode.交易方向,"HK09","通道划款"),
  /**
   * 通道回款
   */
  交易方向_通道回款(BussinessDictCode.交易方向,"HK10","通道回款"),
  /**
   * 成功失败标志_成功
   */
  成功失败标志_成功(BussinessDictCode.成功失败标志,"01","成功"),
  /**
   * 平安业务类型_通道划款
   */
  平安业务类型_通道划款(BussinessDictCode.平安业务类型,"86","通道划款"),
  /**
   * 平安业务类型_通道回款
   */
  平安业务类型_通道回款(BussinessDictCode.平安业务类型,"87","通道回款"),


  /**
   * 银证转账
   */
  交易方向_银证转账(BussinessDictCode.交易方向,"HK01","银证转账"),
  /**
   * 证银转账
   */
  交易方向_证银转账(BussinessDictCode.交易方向,"HK02","证银转账"),

  /**
   * 项目类资产付息计划调整
   */
  共同业务类型_项目类资产付息计划调整(BussinessDictCode.共同业务类型, "FINASSET16", "项目类资产付息计划调整"),
  /**
   * 项目类资产还本计划调整
   */
  共同业务类型_项目类资产还本计划调整(BussinessDictCode.共同业务类型, "FINASSET17", "项目类资产还本计划调整"),

  /**
   * 托管户-上清DVP
   */
  交易方向_托管户_上清DVP(BussinessDictCode.交易方向,"HK03","托管户-上清DVP"),
  /**
   * 托管户-中债DVP
   */
  交易方向_托管户_中债DVP(BussinessDictCode.交易方向,"HK04","托管户-中债DVP"),
  /**
   * 上清DVP-托管户
   */
  交易方向_上清DVP_托管户(BussinessDictCode.交易方向,"HK05","上清DVP-托管户"),
  /**
   * 中债DVP-托管户
   */
  交易方向_中债DVP_托管户(BussinessDictCode.交易方向,"HK06","中债DVP-托管户"),
  /**
   * 上清DVP-中债DVP
   */
  交易方向_上清DVP_中债DVP(BussinessDictCode.交易方向,"HK07","上清DVP-中债DVP"),
  /**
   * 中债DVP-上清DVP
   */
  交易方向_中债DVP_上清DVP(BussinessDictCode.交易方向,"HK08","中债DVP-上清DVP"),

  /**
   * DVP资金调拨管理
   */
  共同业务类型_DVP资金调拨管理(BussinessDictCode.共同业务类型, "PTL09", "DVP资金调拨管理"),
  /**
   * 中央国债登记结算有限责任公司
   */
  登记托管机构_中央国债登记结算有限责任公司(BussinessDictCode.登记托管机构,"01","中央国债登记结算有限责任公司"),
  /**
   * 上海清算所
   */
  登记托管机构_上海清算所(BussinessDictCode.登记托管机构,"02","上海清算所"),

  /**
   * 平安业务类型_DVP资金调拨_托管户_上清DVP
   */
  平安业务类型_DVP资金调拨_托管户_上清DVP(BussinessDictCode.平安业务类型,"88","DVP资金调拨-托管户-上清DVP"),
  /**
   * 平安业务类型_DVP资金调拨_托管户_中债DVP
   */
  平安业务类型_DVP资金调拨_托管户_中债DVP(BussinessDictCode.平安业务类型,"89","DVP资金调拨-托管户-中债DVP"),
  /**
   * 平安业务类型_DVP资金调拨_上清DVP_托管户
   */
  平安业务类型_DVP资金调拨_上清DVP_托管户(BussinessDictCode.平安业务类型,"90","DVP资金调拨-上清DVP-托管户"),
  /**
   * 平安业务类型_DVP资金调拨_中债DVP_托管户
   */
  平安业务类型_DVP资金调拨_中债DVP_托管户(BussinessDictCode.平安业务类型,"91","DVP资金调拨-中债DVP-托管户"),
  /**
   * 平安业务类型_DVP资金调拨_上清DVP_中债DVP
   */
  平安业务类型_DVP资金调拨_上清DVP_中债DVP(BussinessDictCode.平安业务类型,"92","DVP资金调拨-上清DVP-中债DVP"),
  /**
   * 平安业务类型_DVP资金调拨_中债DVP_上清DVP
   */
  平安业务类型_DVP资金调拨_中债DVP_上清DVP(BussinessDictCode.平安业务类型,"93","DVP资金调拨-中债DVP-上清DVP"),

    /**
     * 计费类型_固定费率
     */
    计费类型_固定费率(BussinessDictCode.计费类型,"01","固定费率"),
    /**
     * 计费类型_固定金额
     */
    计费类型_固定金额(BussinessDictCode.计费类型,"02","固定金额"),
  /**
   * 销售模式_直销
   */
  销售模式_直销(BussinessDictCode.销售模式,"01","销售模式_直销"),
  
	/**
	 * 业务类型_债券交易
	 */
	业务类型_债券交易(BussinessDictCode.业务类型, "02", "债券交易"),


  // etliu add 上农商版本添加 start
  /**
   * 处理模式_周期型
   */
  处理模式_周期型(BussinessDictCode.处理模式,"10","周期型"),
  /**
   * 处理模式_分档
   */
  处理模式_分档(BussinessDictCode.处理模式,"11","分档"),
  /**
   * 处理模式_分档周期型
   */
  处理模式_分档周期型(BussinessDictCode.处理模式,"12","分档周期型"),
  当期亏损处理_缩减当前份额(BussinessDictCode.当期亏损处理,"01","缩减当前份额"),
  当期亏损处理_延至下期处理(BussinessDictCode.当期亏损处理,"02","延至下期处理"),
  /**
   * 调整类型_提前终止
   */
  调整类型_提前终止(BussinessDictCode.调整类型,"01","提前终止"),
  /**
   * 调整类型_产品展期
   */
  调整类型_产品展期(BussinessDictCode.调整类型,"02","产品展期"),
  /**
   * 调整类型_到期调整
   */
  调整类型_到期调整(BussinessDictCode.调整类型,"03","到期调整"),
  费用类型_申购费后端(BussinessDictCode.费用类型,"B16","申购费(后端)"),
  费用类型_赎回费产品留存(BussinessDictCode.费用类型,"B17","赎回费(产品留存)"),
  费用类型_违约金(BussinessDictCode.费用类型,"B18","违约金"),
  /**
   * 净值型产品存续期交易新建
   */
  共同业务类型_净值型产品存续期交易(BussinessDictCode.共同业务类型, "FINPROD99", "净值型产品存续期交易"),
  /**
   * 计划类型_申购计划
   */
  计划类型_申购计划(BussinessDictCode.计划类型,"01","申购计划"),
  /**
   * 计划类型_赎回计划
   */
  计划类型_赎回计划(BussinessDictCode.计划类型,"02","赎回计划"),
  /**
   * 计提方式_每日
   */
  计提方式_每日(BussinessDictCode.计提方式,"01","每日"),
  /**
   * 计提方式_区间
   */
  计提方式_区间(BussinessDictCode.计提方式,"02","区间"),
  交易方向_产品提前终止(BussinessDictCode.交易方向, "C16", "产品提前终止"),
  交易方向_产品提前赎回(BussinessDictCode.交易方向, "C17", "产品提前赎回"),
  交易方向_产品违约赎回(BussinessDictCode.交易方向, "C18", "产品违约赎回"),

  指令业务类型_产品认购(BussinessDictCode.指令业务类型,"01","产品认购"),
  指令业务类型_产品申购(BussinessDictCode.指令业务类型,"02","产品申购"),
  指令业务类型_产品赎回(BussinessDictCode.指令业务类型,"03","产品赎回/提前赎回/违约赎回"),
  指令业务类型_产品到期(BussinessDictCode.指令业务类型,"04","产品到期/提前终止"),
  指令业务类型_产品分红(BussinessDictCode.指令业务类型,"05","产品分红"),
  指令业务类型_强增(BussinessDictCode.指令业务类型,"06","强增"),
  指令业务类型_强减(BussinessDictCode.指令业务类型,"07","强减"),
  指令业务类型_产品托管费支付(BussinessDictCode.指令业务类型,"08","产品托管费支付"),
  指令业务类型_产品管理费支付(BussinessDictCode.指令业务类型,"09","产品管理费支付"),
  指令业务类型_产品销售费支付(BussinessDictCode.指令业务类型,"10","产品销售费支付"),
  指令业务类型_产品其他费用(BussinessDictCode.指令业务类型,"11","产品其他费用"),
  /**
   * 申赎开放类型_申购开放
   */
  申赎开放类型_赎回开放(BussinessDictCode.申赎开放类型,"02","赎回开放"),
  /**
   * 有效状态_有效
   */
  有效状态_流程中(BussinessDictCode.有效状态,"04","流程中"),
  // etliu add 上农商版本添加 end

    /**
     * 中标状态_待投标
     */
    中标状态_待投标(BussinessDictCode.中标状态,"01","待投标"),
    /**
     * 中标状态_已投标
     */
    中标状态_已投标(BussinessDictCode.中标状态,"02","已投标"),
    /**
     * 中标状态_待投标
     */
    中标状态_未中标(BussinessDictCode.中标状态,"N","未中标"),
    /**
     * 中标状态_已中标
     */
    中标状态_已中标(BussinessDictCode.中标状态,"Y","已中标"),

    /**
     * 缴款方式_一级分销
     */
    缴款方式_一级分销(BussinessDictCode.缴款方式,"01","一级分销"),
    /**
     * 缴款方式_一级缴款
     */
    缴款方式_一级缴款(BussinessDictCode.缴款方式,"02","一级缴款"),
    /**
     * 缴款方式_二级交易
     */
    缴款方式_二级交易(BussinessDictCode.缴款方式,"03","二级交易"),

    确认状态_未确认(BussinessDictCode.确认状态,"01","未确认"),
    确认状态_已确认(BussinessDictCode.确认状态,"02","已确认"),
    确认状态_未中标(BussinessDictCode.确认状态,"03","未中标"),
    确认状态_已中标(BussinessDictCode.确认状态,"04","已中标"),
    /**
     * 中标结果维护与确认
     */
    共同业务类型_中标结果确认(BussinessDictCode.共同业务类型, "TRD60", "中标结果确认"),
    共同业务类型_一级投标确认_申购_登记(BussinessDictCode.共同业务类型, "TRD95", "一级投标确认-申购-登记"),
    共同业务类型_一级投标确认_投标_自主投标(BussinessDictCode.共同业务类型, "TRD96", "一级投标确认-投标-自主投标"),
    共同业务类型_一级投标确认_投标_分销买入(BussinessDictCode.共同业务类型, "TRD97", "一级投标确认-投标-分销买入"),
    共同业务类型_一级投标确认_投标_代投代缴(BussinessDictCode.共同业务类型, "TRD98", "一级投标确认-投标-代投代缴"),

    共同业务类型_中标结果维护(BussinessDictCode.共同业务类型, "TRD61", "中标结果维护"),

    /**
     * 新债标的
     */
    共同业务类型_新债标的(BussinessDictCode.共同业务类型, "TRD99", "新债标的"),
    共同业务类型_上市流通(BussinessDictCode.共同业务类型, "TRD100", "上市流通"),
    共同业务类型_上市流通撤销(BussinessDictCode.共同业务类型, "TRD101", "上市流通撤销"),

    缴款状态_流程中(BussinessDictCode.缴款状态, "01", "流程中"),
    缴款状态_待二级交易(BussinessDictCode.缴款状态, "02", "待二级交易"),
    缴款状态_待一级分销(BussinessDictCode.缴款状态, "03", "待一级分销"),
    缴款状态_待一级缴款(BussinessDictCode.缴款状态, "04", "待一级缴款"),
    缴款状态_已完成(BussinessDictCode.缴款状态, "05", "已完成"),
    /**
     * 债券类资产管理
     */
    共同业务类型_一级投标债券类资产管理(BussinessDictCode.共同业务类型, "FINASSET18", "一级投标债券类资产管理"),
    /**
     * 平安资产类型_一级投标债券
     */
    平安资产类型_一级投标债券(BussinessDictCode.平安资产类型,"F17","一级投标债券"),
    /**
     * wind交易场所_场外
     */
    wind交易场所_场外(BussinessDictCode.wind交易场所,"OF","场外"),
    /**
     * wind交易场所_银行间
     */
    wind交易场所_银行间(BussinessDictCode.wind交易场所,"IB","银行间"),
    /**
     * wind交易场所_上交所
     */
    wind交易场所_上交所(BussinessDictCode.wind交易场所,"SH","上交所"),
    /**
     * wind交易场所_深交所
     */
    wind交易场所_深交所(BussinessDictCode.wind交易场所,"SZ","深交所"),
    回购交易_质押式(BussinessDictCode.回购交易类型,"PLEDGE","质押式"),
    回购交易_买断式(BussinessDictCode.回购交易类型,"BUYOUT","买断式"),
    因子停启_因子停用(BussinessDictCode.因子启停,"RISK02","因子停用"),
    因子停启_因子启动(BussinessDictCode.因子启停,"RISK01","因子启动"),
    /**
     * 情景管理 Added by JIAOXUJIN on 2019-08-26
     */
    情景管理_新建情景(BussinessDictCode.情景管理, "SCE01", "情景新建"),
    情景管理_修改情景(BussinessDictCode.情景管理, "SCE02", "情景修改"),
    情景管理_删除情景(BussinessDictCode.情景管理, "SCE03", "情景删除"),
    情景启用状态_启用(BussinessDictCode.情景启用状态, "01", "启用"),
    情景启用状态_停用(BussinessDictCode.情景启用状态, "02", "停用"),
    /**
     * 行内资产二级分类
     */
    行内资产二级分类_同业存单(BussinessDictCode.行内资产二级分类, "01", "同业存单"),
    行内资产二级分类_债券(BussinessDictCode.行内资产二级分类, "02", "债券"),
    行内资产二级分类_理财直接融资工具(BussinessDictCode.行内资产二级分类, "03", "理财直接融资工具"),
    行内资产二级分类_权益类投资(BussinessDictCode.行内资产二级分类, "04", "权益类投资"),
    行内资产二级分类_现金及银行存款(BussinessDictCode.行内资产二级分类, "05", "现金及银行存款"),
    行内资产二级分类_拆放同业及买入返售(BussinessDictCode.行内资产二级分类, "06", "拆放同业及买入返售"),
    行内资产二级分类_公募基金(BussinessDictCode.行内资产二级分类, "07", "公募基金"),
    行内资产二级分类_新增可投资资产(BussinessDictCode.行内资产二级分类, "08", "新增可投资资产"),
    行内资产二级分类_非标准化债权类资产(BussinessDictCode.行内资产二级分类, "09", "非标准化债权类资产"),
    行内资产二级分类_同业拆入及卖出回购(BussinessDictCode.行内资产二级分类, "12", "同业拆入及卖出回购"),
    行内资产二级分类_金融衍生品(BussinessDictCode.行内资产二级分类, "14", "金融衍生品"),
    行内资产二级分类_资产管理产品(BussinessDictCode.行内资产二级分类, "15", "资产管理产品"),
    行内资产二级分类_委外投资协议方式(BussinessDictCode.行内资产二级分类, "16", "委外投资——协议方式"),
    行内资产二级分类_私募基金(BussinessDictCode.行内资产二级分类, "18", "私募基金"),
    /**
     * 行内资产三级分类
     */
    行内资产三级分类_本行发行的同业存单(BussinessDictCode.行内资产三级分类, "01", "本行发行的同业存单"),
    行内资产三级分类_他行发行的同业存单(BussinessDictCode.行内资产三级分类, "02", "他行发行的同业存单"),
    行内资产三级分类_国债(BussinessDictCode.行内资产三级分类, "03", "国债"),
    行内资产三级分类_地方政府债(BussinessDictCode.行内资产三级分类, "04", "地方政府债"),
    行内资产三级分类_央票(BussinessDictCode.行内资产三级分类, "05", "央票"),
    行内资产三级分类_政策性金融债(BussinessDictCode.行内资产三级分类, "06", "政策性金融债"),
    行内资产三级分类_政府支持机构债券(BussinessDictCode.行内资产三级分类, "07", "政府支持机构债券"),
    行内资产三级分类_商业性金融债(BussinessDictCode.行内资产三级分类, "08", "商业性金融债"),
    行内资产三级分类_企业债券(BussinessDictCode.行内资产三级分类, "09", "企业债券"),
    行内资产三级分类_公司债券(BussinessDictCode.行内资产三级分类, "10", "公司债券"),
    行内资产三级分类_企业债务融资工具(BussinessDictCode.行内资产三级分类, "11", "企业债务融资工具"),
    行内资产三级分类_资产支持证券(BussinessDictCode.行内资产三级分类, "12", "资产支持证券"),
    行内资产三级分类_外国债券(BussinessDictCode.行内资产三级分类, "13", "外国债券"),
    行内资产三级分类_理财直接融资工具(BussinessDictCode.行内资产三级分类, "14", "理财直接融资工具"),
    行内资产三级分类_其他理财直接融资工具(BussinessDictCode.行内资产三级分类, "15", "其他理财直接融资工具"),
    行内资产三级分类_股票一级市场(BussinessDictCode.行内资产三级分类, "16", "股票（一级市场）"),
    行内资产三级分类_现金及活期存款(BussinessDictCode.行内资产三级分类, "17", "现金及活期存款"),
    行内资产三级分类_本行存款(BussinessDictCode.行内资产三级分类, "18", "本行存款"),
    行内资产三级分类_他行存款(BussinessDictCode.行内资产三级分类, "19", "他行存款"),
    行内资产三级分类_本行发行的大额存单(BussinessDictCode.行内资产三级分类, "20", "本行发行的大额存单"),
    行内资产三级分类_他行发行的大额存单(BussinessDictCode.行内资产三级分类, "21", "他行发行的大额存单"),
    行内资产三级分类_拆放同业(BussinessDictCode.行内资产三级分类, "22", "拆放同业"),
    行内资产三级分类_债券基金(BussinessDictCode.行内资产三级分类, "23", "债券基金"),
    行内资产三级分类_货币市场基金(BussinessDictCode.行内资产三级分类, "24", "货币市场基金"),
    行内资产三级分类_股票基金(BussinessDictCode.行内资产三级分类, "25", "股票基金"),
    行内资产三级分类_基金中基金(BussinessDictCode.行内资产三级分类, "26", "基金中基金"),
    行内资产三级分类_混合基金(BussinessDictCode.行内资产三级分类, "27", "混合基金"),
    行内资产三级分类_其他公募基金(BussinessDictCode.行内资产三级分类, "28", "其他公募基金"),
    行内资产三级分类_信贷资产流转项目(BussinessDictCode.行内资产三级分类, "29", "信贷资产流转项目"),
    行内资产三级分类_其他新增可投资资产(BussinessDictCode.行内资产三级分类, "30", "其他新增可投资资产"),
    行内资产三级分类_票据类(BussinessDictCode.行内资产三级分类, "31", "票据类"),
    行内资产三级分类_信用证(BussinessDictCode.行内资产三级分类, "32", "信用证"),
    行内资产三级分类_信托贷款(BussinessDictCode.行内资产三级分类, "33", "信托贷款"),
    行内资产三级分类_委托贷款(BussinessDictCode.行内资产三级分类, "34", "委托贷款"),
    行内资产三级分类_信贷资产转让(BussinessDictCode.行内资产三级分类, "35", "信贷资产转让"),
    行内资产三级分类_收受益权(BussinessDictCode.行内资产三级分类, "36", "收/受益权"),
    行内资产三级分类_委托债权(BussinessDictCode.行内资产三级分类, "37", "委托债权"),
    行内资产三级分类_应收账款(BussinessDictCode.行内资产三级分类, "38", "应收账款"),
    行内资产三级分类_带回购条款的股权性融资(BussinessDictCode.行内资产三级分类, "39", "带回购条款的股权性融资"),
    行内资产三级分类_债权融资类产品(BussinessDictCode.行内资产三级分类, "40", "债权融资类产品"),
    行内资产三级分类_其他非标准化债权类投资(BussinessDictCode.行内资产三级分类, "41", "其他非标准化债权类投资"),
    行内资产三级分类_股权(BussinessDictCode.行内资产三级分类, "42", "股权"),
    行内资产三级分类_其他权益类投资(BussinessDictCode.行内资产三级分类, "43", "其他权益类投资"),
    行内资产三级分类_买入返售(BussinessDictCode.行内资产三级分类, "44", "买入返售"),
    行内资产三级分类_卖出回购(BussinessDictCode.行内资产三级分类, "45", "卖出回购"),
    行内资产三级分类_同业拆入(BussinessDictCode.行内资产三级分类, "46", "同业拆入"),
    行内资产三级分类_股票二级市场(BussinessDictCode.行内资产三级分类, "47", "股票（二级市场）"),
    行内资产三级分类_互换(BussinessDictCode.行内资产三级分类, "48", "互换"),
    行内资产三级分类_远期(BussinessDictCode.行内资产三级分类, "49", "远期"),
    行内资产三级分类_债券借贷(BussinessDictCode.行内资产三级分类, "50", "债券借贷"),
    行内资产三级分类_信托产品(BussinessDictCode.行内资产三级分类, "51", "信托产品"),
    行内资产三级分类_券商资产管理计划(BussinessDictCode.行内资产三级分类, "52", "券商资产管理计划"),
    行内资产三级分类_基金资产管理计划(BussinessDictCode.行内资产三级分类, "53", "基金资产管理计划"),
    行内资产三级分类_期货资产管理计划(BussinessDictCode.行内资产三级分类, "54", "期货资产管理计划"),
    行内资产三级分类_保险资产管理计划(BussinessDictCode.行内资产三级分类, "55", "保险资产管理计划"),
    行内资产三级分类_其他资产管理计划(BussinessDictCode.行内资产三级分类, "56", "其他资产管理计划"),
    行内资产三级分类_银行(BussinessDictCode.行内资产三级分类, "57", "银行"),
    行内资产三级分类_信托公司(BussinessDictCode.行内资产三级分类, "58", "信托公司"),
    行内资产三级分类_证券公司(BussinessDictCode.行内资产三级分类, "59", "证券公司"),
    行内资产三级分类_基金公司(BussinessDictCode.行内资产三级分类, "60", "基金公司"),
    行内资产三级分类_期货公司(BussinessDictCode.行内资产三级分类, "61", "期货公司"),
    行内资产三级分类_保险公司(BussinessDictCode.行内资产三级分类, "62", "保险公司"),
    行内资产三级分类_其他(BussinessDictCode.行内资产三级分类, "63", "其他"),
    行内资产三级分类_信贷资产收益权转让(BussinessDictCode.行内资产三级分类, "64", "信贷资产收益权转让"),
    行内资产三级分类_小微企业信贷资产流转和收益权转让(BussinessDictCode.行内资产三级分类, "65", "小微企业信贷资产流转和收益权转让"),
    行内资产三级分类_私募股权投资基金(BussinessDictCode.行内资产三级分类, "66", "私募股权投资基金"),
    行内资产三级分类_即期(BussinessDictCode.行内资产三级分类, "67", "即期"),
    行内资产三级分类_掉期(BussinessDictCode.行内资产三级分类, "68", "掉期"),
    指令业务类型_银证转账(BussinessDictCode.指令业务类型, "49", "银证转账"),
    指令业务类型_证银转账(BussinessDictCode.指令业务类型, "50", "证银转账"),

    /**
     * 行权方式_回售
     */
    行权方式_回售(BussinessDictCode.行权方式, "02", "回售"),
    /**
     * 国债
     */
    债券类型_国债(BussinessDictCode.WIND一级分类_含债券一级分类等, "B01", "国债"),

    /**
     * 地方政府债
     */
    地方政府债(BussinessDictCode.WIND一级分类_含债券一级分类等, "B02", "地方政府债"),
    /**
     * 央行票据
     */
    央行票据(BussinessDictCode.WIND一级分类_含债券一级分类等, "B03", "央行票据"),

    /**
     * 授信对象_金额
     */
    授信对象_金额(BussinessDictCode.授信对象, "01", "授信对象_金额"),
    /**
     * 授信对象_份额
     */
    授信对象_份额(BussinessDictCode.授信对象, "02", "授信对象_份额"),
    //add by yufei 20200629 end
    // 资产授信新建增加字段  add by yufei 20200630 start
    行内资产三级分类_私募股权基金(BussinessDictCode.行内资产三级分类, "87", "私募股权基金"),
    // 资产授信新建增加字段  add by yufei 20200630 end
    //zhangliang hefei 银行间上行 20200512 add start

    /**
     * 结算方式
     */
    结算方式_见券付款(BussinessDictCode.结算方式, "01", "见券付款"),
    结算方式_见款付券(BussinessDictCode.结算方式, "02", "见款付券"),
    结算方式_券款对付(BussinessDictCode.结算方式, "03", "券款对付"),
    /**
     * 共同业务类型_CFETS账户关联
     */
    共同业务类型_CFETS账户关联(BussinessDictCode.共同业务类型, "MST22", "CFETS账户关联"),

    /**
     * 报价方式_对话报价
     */
    报价方式_对话报价(BussinessDictCode.报价方式, "01", "对话报价"),
    /**
     * 报价方式_请求报价
     */
    报价方式_请求报价(BussinessDictCode.报价方式, "02", "请求报价"),
    /**
     * 报价方式_登记报价
     */
    报价方式_登记报价(BussinessDictCode.报价方式, "04", "登记报价"),
    /**
     * 清算类型_净额清算
     */
    清算类型_净额清算(BussinessDictCode.清算类型, "02", "净额清算"),
    /**
     * 清算类型_全额清算
     */
    清算类型_全额清算(BussinessDictCode.清算类型, "01", "全额清算"),
    /**
     * 银行间上行本方角色_询价方
     */
    银行间上行本方角色_询价方(BussinessDictCode.银行间上行本方角色, "01", "询价方"),
    /**
     * 银行间上行本方角色_回复方
     */
    银行间上行本方角色_回复方(BussinessDictCode.银行间上行本方角色, "02", "回复方"),
    /**
     * 银行间上行本方角色_非做市方
     */
    银行间上行本方角色_非做市方(BussinessDictCode.银行间上行本方角色, "03", "非做市方"),
    /**
     * 银行间上行本方角色_做市方
     */
    银行间上行本方角色_做市方(BussinessDictCode.银行间上行本方角色, "04", "做市方"),
    /**
     * 银行间上行回复查询方式_指定交易员可见
     */
    银行间上行回复查询方式_指定交易员可见(BussinessDictCode.银行间上行回复查询方式, "02", "指定交易员可见"),
    /**
     * 银行间上行回复查询方式_全部交易员可见
     */
    银行间上行回复查询方式_全部交易员可见(BussinessDictCode.银行间上行回复查询方式, "01", "全部交易员可见"),
    /**
     * 银行间上行发送状态_待发送
     */
    银行间上行发送状态_待发送(BussinessDictCode.银行间上行发送状态, "00", "待发送"),
    /**
     * 银行间上行发送状态_已发送
     */
    银行间上行发送状态_已发送(BussinessDictCode.银行间上行发送状态, "01", "已发送"),
    /**
     * 银行间上行发送状态_成功
     */
    银行间上行发送状态_成功(BussinessDictCode.银行间上行发送状态, "02", "成功"),
    /**
     * 银行间上行发送状态_失败
     */
    银行间上行发送状态_失败(BussinessDictCode.银行间上行发送状态, "03", "失败"),
    /**
     * 银行间上行报价状态_新增中
     */
    银行间上行报价状态_新增中(BussinessDictCode.银行间上行报价状态, "01", "新增中"),
    /**
     * 银行间上行报价状态_已新增
     */
    银行间上行报价状态_已新增(BussinessDictCode.银行间上行报价状态, "02", "已新增"),
    /**
     * 银行间上行报价状态_修改中
     */
    银行间上行报价状态_修改中(BussinessDictCode.银行间上行报价状态, "03", "修改中"),
    /**
     * 银行间上行报价状态_已修改
     */
    银行间上行报价状态_已修改(BussinessDictCode.银行间上行报价状态, "04", "已修改"),
    /**
     * 银行间上行报价状态_撤回中
     */
    银行间上行报价状态_撤回中(BussinessDictCode.银行间上行报价状态, "05", "撤回中"),
    /**
     * 银行间上行报价状态_已撤回
     */
    银行间上行报价状态_已撤回(BussinessDictCode.银行间上行报价状态, "06", "已撤回"),
    /**
     * 银行间上行报价状态_已成交
     */
    银行间上行报价状态_已成交(BussinessDictCode.银行间上行报价状态, "07", "已成交"),
    /**
     * 银行间上行报价状态_已终止
     */
    银行间上行报价状态_已终止(BussinessDictCode.银行间上行报价状态, "08", "已终止"),
    /**
     * 银行间上行报价状态_待回复
     */
    银行间上行报价状态_待回复(BussinessDictCode.银行间上行报价状态, "09", "待回复"),
    /**
     * 银行间上行报价状态_成交中
     */
    银行间上行报价状态_成交中(BussinessDictCode.银行间上行报价状态, "10", "成交中"),
    /**
     * 银行间上行报价状态_终止中
     */
    银行间上行报价状态_终止中(BussinessDictCode.银行间上行报价状态, "11", "终止中"),
    /**
     * 银行间上行报价状态_已回复
     */
    银行间上行报价状态_已回复(BussinessDictCode.银行间上行报价状态, "12", "已回复"),
    /**
     * 银行间上行报价状态_已过期
     */
    银行间上行报价状态_已过期(BussinessDictCode.银行间上行报价状态, "13", "已过期"),
    /**
     * 银行间上行报价状态_已拒绝
     */
    银行间上行报价状态_已拒绝(BussinessDictCode.银行间上行报价状态, "14", "已拒绝"),
    /**
     * 银行间上行报价状态_已撤销
     */
    银行间上行报价状态_已撤销(BussinessDictCode.银行间上行报价状态, "15", "已撤销"),
    /**
     * 银行间上行报价状态_拒绝中
     */
    银行间上行报价状态_拒绝中(BussinessDictCode.银行间上行报价状态, "16", "拒绝中"),
    /**
     * 银行间上行报价状态_回复中
     */
    银行间上行报价状态_回复中(BussinessDictCode.银行间上行报价状态, "17", "回复中"),
    /**
     * 银行间上行报价状态_交谈中
     */
    银行间上行报价状态_交谈中(BussinessDictCode.银行间上行报价状态, "18", "交谈中"),
    /**
     * 银行间上行报价状态_已交谈
     */
    银行间上行报价状态_已交谈(BussinessDictCode.银行间上行报价状态, "19", "已交谈"),
    /**
     * 计算选择方式_净价
     */
    计算选择方式_净价(BussinessDictCode.计算选择方式, "01", "净价"),
    /**
     * 计算选择方式_到期收益率
     */
    计算选择方式_到期收益率(BussinessDictCode.计算选择方式, "02", "到期收益率"),
    /**
     * 计算选择方式_行权收益率
     */
    计算选择方式_行权收益率(BussinessDictCode.计算选择方式, "03", "行权收益率"),
    /**
     * 计算选择方式_全价总额
     */
    计算选择方式_全价总额(BussinessDictCode.计算选择方式, "04", "全价总额"),
    //zhangliang hefei 银行间上行 20200512 add end

    //2020-05-29 银行间上行 add start
    /**
     * 成交状态_未成交
     */
    银行间成交状态_未成交(BussinessDictCode.银行间成交状态, "01", "未成交"),
    /**
     * 成交状态_已成交
     */
    银行间成交状态_已成交(BussinessDictCode.银行间成交状态, "02", "已成交"),
    /**
     * 报价系统区分类型_现券对话报价
     */
    报价系统区分类型_现券对话报价(BussinessDictCode.报价系统区分类型, "01", "现券对话报价"),
    /**
     * 报价系统区分类型_现券请求报价
     */
    报价系统区分类型_现券请求报价(BussinessDictCode.报价系统区分类型, "02", "现券请求报价"),
    /**
     * 报价系统区分类型_质押式回购对话报价
     */
    报价系统区分类型_质押式回购对话报价(BussinessDictCode.报价系统区分类型, "03", "质押式回购对话报价"),
    /**
     * 共同业务类型_银行间上行
     */
    共同业务类型_银行间上行(BussinessDictCode.共同业务类型, "TRD77", "银行间上行"),
    //2020-05-29 银行间上行 add end
    //add by xindi 2020.06.11 start
    请求类型_RFT(BussinessDictCode.请求类型, "RFT", "RFT"),
    请求类型_RFQ(BussinessDictCode.请求类型, "RFQ", "RFQ"),
    请求类型_IOI_RFT(BussinessDictCode.请求类型, "IOI_RFT", "IOI_RFT"),
    请求类型_IOI_RFQ(BussinessDictCode.请求类型, "IOI_RFQ", "IOI_RFQ"),

    IN_OR_OUT_IN(BussinessDictCode.IN_OR_OUT, "IN", "IN"),
    N_OR_OUT_OUT(BussinessDictCode.IN_OR_OUT, "ON", "OUT"),

    类型_请求(BussinessDictCode.类型, "1", "请求"),
    类型_订阅(BussinessDictCode.类型, "2", "订阅"),

    状态_状态(BussinessDictCode.状态, "0", "状态"),
    状态_成功(BussinessDictCode.状态, "1", "成功"),
    状态_失败(BussinessDictCode.状态, "2", "失败"),
    状态_未知(BussinessDictCode.状态, "9", "未知"),
    //add by xindi 2020.06.11 end
    //add by chendong in 2020-07-07 start
    完成状态_未完成(BussinessDictCode.完成状态, "01", "未完成"),
    完成状态_已完成(BussinessDictCode.完成状态, "02", "已完成"),
    //add by chendong in 2020-07-07 end

    // add by yeyang 20200714 start 托管户活期利率增加分段计息规则
    TD_LAT_ALL(BussinessDictCode.TD_LAT, "01", "全额套档"),
    TD_LAT_LEVEL(BussinessDictCode.TD_LAT, "02", "分层套档"),
    INT_CALC_TYPE_FIXED(BussinessDictCode.INT_CALC_TYPE, "01", "固定"),
    INT_CALC_TYPE_FLOAT(BussinessDictCode.INT_CALC_TYPE, "02", "浮动"),
    // add by yeyang 20200714 end
    //数据来源_画面录入(BussinessDictCode.数据来源, "01", "画面录入"),
    //数据来源_文件导入(BussinessDictCode.数据来源, "02", "文件导入"),
    //add by chendong in 2020-07-20 start
    /**
     * 交易日历_银行间
     */
    交易日历_银行间(BussinessDictCode.交易日历, "IB", "银行间"),
    /**
     * 交易日历_上交所
     */
    交易日历_上交所(BussinessDictCode.交易日历, "SH", "上交所"),
    /**
     * 交易日历_深交所
     */
    交易日历_深交所(BussinessDictCode.交易日历, "SZ", "深交所"),
    //add by chendong in 2020-07-20 end
    /**
     * 是否特殊委托_全部 add by wangguangyu317
     */
    是否特殊委托_全部(BussinessDictCode.是否特殊委托,"01","全部"),
    /**
     * 是否特殊委托_是 add by wangguangyu317
     */
    是否特殊委托_是(BussinessDictCode.是否特殊委托,"02","是"),
    /**
     * 是否特殊委托_否 add by wangguangyu317
     */
    是否特殊委托_否(BussinessDictCode.是否特殊委托,"03","否"),
    平安资产一级分类_资产支持证券(BussinessDictCode.平安资产一级分类, "B13", "资产支持证券"),
    期限品种_利率互换_1Y(BussinessDictCode.期限品种_利率互换, "1Y", "1Y"),
    期限品种_利率互换_2Y(BussinessDictCode.期限品种_利率互换, "2Y", "2Y"),
    期限品种_利率互换_6M(BussinessDictCode.期限品种_利率互换, "6M", "6M"),
    期限品种_利率互换_3M(BussinessDictCode.期限品种_利率互换, "3M", "3M"),
    期限品种_利率互换_1M(BussinessDictCode.期限品种_利率互换, "1M", "1M"),
    期限品种_利率互换_9M(BussinessDictCode.期限品种_利率互换, "9M", "9M"),
    /**
     * 投资目的_卖空
     */
    投资目的_卖空(BussinessDictCode.投资目的, "SELL", "SELL"),
    /**
     * 成本法
     */
    组合估值方法_成本法(BussinessDictCode.组合估值方法, "01", "成本法"),
    /**
     * 市价法
     */
    组合估值方法_市价法(BussinessDictCode.组合估值方法, "02", "市价法"),
    /**
     * 其他
     */
    组合估值方法_其他(BussinessDictCode.组合估值方法, "03", "其他"),
    
    /**
     * 匹配状态_未匹配
     */
    匹配状态_部分匹配(BussinessDictCode.匹配状态,"03","部分匹配"),
	 /**
     * 持仓类型_卖空
     */
    持仓类型_卖空(BussinessDictCode.持仓类型, "07", "卖空"),

    //add by chenjiaxing 固定值参数更新提醒 20210726
    提醒类型_小分类_固定值参数更新提醒(BussinessDictCode.提醒类型_小分类,"R5S3","固定值参数更新提醒"),
    //add by chenjiaxing 固定值参数更新提醒 20210726
    提醒类型_大分类_债券上市流通(BussinessDictCode.提醒类型_大分类,"R10","债券上市流通"),
  ;
	//add by gaopeng 20191024 start
	//add by gaopeng 20191024 end

    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private BaseDictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;
    BussinessDictCodeList(BaseDictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static BussinessDictCodeList from(BaseDictCode dictCode, String value) {
        BussinessDictCodeList[] values = BussinessDictCodeList.values();
        for (BussinessDictCodeList code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode().equals(dictCode)) {
                return code;
            }
        }
        return null;
    }

    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(BaseDictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        BussinessDictCodeList[] values = BussinessDictCodeList.values();
        for (BussinessDictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(BaseDictCode dictCode) {
        List<String> result = new ArrayList<>();
        BussinessDictCodeList[] values = BussinessDictCodeList.values();
        for (BussinessDictCodeList code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public BaseDictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }
    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }
    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }
    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }
    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }
    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }
    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }
}
