package com.joyintech.tams.exchange.common.constant.joyin;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * 数据字典明细枚举
 *
 * @author chenzhuo
 * @version 1.0 2016年11月12日
 * @see DictCodeListExt3
 * @since 1.0
 */
public enum DictCodeListExt3 implements BaseDictCodeList {
    //add by lishuping 20191106 start
    质押券状态_正常(DictCode.质押券状态, "01", "正常"),
    质押券状态_触发预警(DictCode.质押券状态, "02", "触发预警"),
    质押券状态_触发平仓(DictCode.质押券状态, "03", "触发平仓"),
    //add by lishuping 20191106 end
    共通业务类型_产品端轧差划款(DictCode.共通业务类型, "PTL16", "产品端轧差划款"),
    //添加价格类别 add by tanxuan
    价格类别_净价(DictCode.价格类别, "01", "净价"),
    价格类别_全价(DictCode.价格类别, "02", "全价"),
    增值税品种_产品增值税(DictCode.增值税品种, "01", "产品增值税"),
    增值税品种_通道增值税(DictCode.增值税品种, "02", "通道增值税"),
    平安业务类型_融入债券付息还本_付(DictCode.平安业务类型, "137", "融入债券付息还本（付）"),
    平安业务类型_融出债券付息还本_收(DictCode.平安业务类型, "138", "融出债券收息还本（收）"),

    需求发起端_产品端(DictCode.需求发起端, "01", "产品端"),
    需求发起端_投资端(DictCode.需求发起端, "02", "投资端"),
    需求发起端_客户端(DictCode.需求发起端, "03", "客户端"),
    可行性状态_可行(DictCode.可行性状态, "01", "可行"),
    可行性状态_不可行(DictCode.可行性状态, "02", "不可行"),
    可行性状态_待定(DictCode.可行性状态, "03", "待定"),
    可行需求分类_原有系列(DictCode.可行需求分类, "01", "原有系列"),
    可行需求分类_新研发系列(DictCode.可行需求分类, "02", "新研发系列"),

    投管业务类型_竞价交易(DictCode.投管业务类型,"EX001","竞价交易"),
    投管业务类型_大宗交易(DictCode.投管业务类型,"EX002","大宗交易"),
    投管业务类型_行权(DictCode.投管业务类型,"EX003","行权"),
    投管业务类型_债转股(DictCode.投管业务类型,"EX004","债转股"),
    投管业务类型_质押券出入库(DictCode.投管业务类型,"EX005","质押券出入库"),
    投管业务类型_配债(DictCode.投管业务类型,"EX006","配债"),
    投管业务类型_可转债申购(DictCode.投管业务类型,"EX007","可转债申购"),
    投管业务类型_配股(DictCode.投管业务类型,"EX008","配股"),
    投管业务类型_新股申购(DictCode.投管业务类型,"EX009","新股申购"),
    投管业务类型_首期(DictCode.投管业务类型,"EX010","首期"),
    投管业务类型_提前购回(DictCode.投管业务类型,"EX011","提前购回"),
    投管业务类型_到期购回(DictCode.投管业务类型,"EX012","到期购回"),
    投管业务类型_到期续做(DictCode.投管业务类型,"EX013","到期续做"),
    投管业务类型_中途换券(DictCode.投管业务类型,"EX014","中途换券"),
    投管业务类型_解除质押(DictCode.投管业务类型,"EX015","解除质押"),
    投管业务类型_协议现券(DictCode.投管业务类型,"EX016","协议现券"),
    投管业务类型_现券交易(DictCode.投管业务类型,"EX017","现券交易"),
    投管业务类型_通用式质押回购(DictCode.投管业务类型,"EX018","通用式质押回购"),
    投管业务类型_信用保护凭证(DictCode.投管业务类型,"EX019","信用保护凭证"),

    /***add by liepeng 20191106 start**/
    基准日_巨额赎回调整日(DictCode.基准日, "12", "分红确认日"),
    基准日_募集上线调整日(DictCode.基准日, "13", "分红确认日"),
    披露发送标识_发送状态(DictCode.披露发送标识, "01", "发送状态"),
    披露发送标识_反馈状态(DictCode.披露发送标识, "02", "反馈状态"),
    披露发送状态_成功(DictCode.披露发送状态, "01", "成功"),
    披露发送状态_失败(DictCode.披露发送状态, "02", "失败"),
    披露发送状态_不披露(DictCode.披露发送状态, "99", "不披露"),
    披露反馈状态_成功(DictCode.披露反馈状态, "01", "成功"),
    披露反馈状态_失败(DictCode.披露反馈状态, "02", "失败"),
    /***add by liepeng 20191106 end**/
    /**
     * 指令新建业务类型 yzg 20191106
     */
    共通业务类型_指令新建(DictCode.共通业务类型, "PTL15", "指令新建"),
    共通业务类型_产品申报登记要素管理(DictCode.共通业务类型, "FINPROD28", "产品申报登记要素管理"),
    共通业务类型_资产配置计划(DictCode.共通业务类型, "PRDPLAN03", "资产配置计划"),

    匹配状态_已匹配(DictCode.匹配状态, "01", "已匹配"),
    匹配状态_未匹配(DictCode.匹配状态, "02", "未匹配"),
    匹配状态_部分匹配(DictCode.匹配状态, "03", "部分匹配"),
    //add by gaopeng 20191108 start 增加债转股业务类型以及交易方向
    平安业务类型_债转股(DictCode.平安业务类型, "139", "债转股"),
    交易方向_债转股(DictCode.交易方向, "T49", "债转股"),
    //add by gaopeng 20191108 end 增加债转股业务类型以及交易方向
    交易方向_投资端_提前终止(DictCode.交易方向, "T54", "提前终止"),
    交易方向_投资端_逾期返售(DictCode.交易方向, "T55", "逾期返售"),
    代码类型_产品(DictCode.代码类型, "01", "产品"),
    代码类型_资产(DictCode.代码类型, "02", "资产"),

    /**
     * 利率上下限区分
     **/

    利率上下限区分_利率上限(DictCode.利率上下限区分, "01", "利率上限"),
    利率上下限区分_利率下限(DictCode.利率上下限区分, "02", "利率下限"),

    平安业务类型_货币基金认购申请(DictCode.平安业务类型, "127", "货币基金认购申请"),
    平安业务类型_非货币基金认购申请(DictCode.平安业务类型, "128", "非货币基金认购申请"),
    平安业务类型_货币基金认购确认(DictCode.平安业务类型, "129", "货币基金认购确认"),
    平安业务类型_非货币基金认购确认(DictCode.平安业务类型, "130", "非货币基金认购确认"),
    平安业务类型_货币基金买入(DictCode.平安业务类型, "133", "货币基金买入"),
    平安业务类型_非货币基金买入(DictCode.平安业务类型, "134", "非货币基金买入"),
    平安业务类型_货币基金卖出(DictCode.平安业务类型, "135", "货币基金卖出"),
    平安业务类型_非货币基金卖出(DictCode.平安业务类型, "136", "非货币基金卖出"),
    //add by nixiukuan 20191113 start 质押式回购交易、债券借贷交易 -》质押券置换
    共通业务类型_质押券置换(DictCode.共通业务类型, "126", "质押券置换"),
    质押券置换_置换方向_换入(DictCode.置换方向, "01", "换入"),
    质押券置换_置换方向_换出(DictCode.置换方向, "02", "换出"),
    质押券置换_置换结果_置换前(DictCode.置换结果, "01", "置换前"),
    质押券置换_置换结果_置换后(DictCode.置换结果, "02", "置换后"),
    交易方向_费用计提(DictCode.交易方向, "T57", "费用计提"),
    业务类型_费用计提交易(DictCode.业务类型, "36", "费用计提交易"),
    //add by nixiukuan 20191113 end 质押式回购交易、债券借贷交易 -》质押券置换
    共通业务类型_可转债转股交易(DictCode.共通业务类型, "TRD63", "可转债转股交易"),

    共通业务类型_立项指令(DictCode.共通业务类型, "TRD75", "立项指令"),

    // add by leipeng 20191123
    资产_负债类别_公募和私募基金(DictCode.资产_负债类别, "L01", "公募基金/私募基金"),


    //added by shaohuchen 2019/11/23 start
    人行资产一级分类_现金(DictCode.人行资产一级分类, "P01", "现金"),
    人行资产一级分类_存款(DictCode.人行资产一级分类, "P02", "存款"),
    人行资产一级分类_可转让存单(DictCode.人行资产一级分类, "P03", "可转让存单"),
    人行资产一级分类_债务证券(DictCode.人行资产一级分类, "P04", "债务证券"),
    人行资产一级分类_贷款(DictCode.人行资产一级分类, "P05", "贷款"),
    人行资产一级分类_资产收益权(DictCode.人行资产一级分类, "P06", "资产收益权"),
    人行资产一级分类_股权及特定目的载体份额(DictCode.人行资产一级分类, "P07", "股权及特定目的载体份额"),
    人行资产一级分类_金融衍生品(DictCode.人行资产一级分类, "P08", "金融衍生品"),
    人行资产一级分类_黄金(DictCode.人行资产一级分类, "P09", "黄金"),
    人行资产一级分类_非金融资产(DictCode.人行资产一级分类, "P10", "非金融资产"),
    人行资产一级分类_应收账款(DictCode.人行资产一级分类, "P11", "应收账款"),
    人行资产一级分类_应付账款(DictCode.人行资产一级分类, "P12", "应付账款"),
    人行资产一级分类_其他负债(DictCode.人行资产一级分类, "P13", "其他负债"),

    人行资产二级分类_境内存款(DictCode.人行资产二级分类, "C01", "境内存款"),
    人行资产二级分类_境外存款(DictCode.人行资产二级分类, "C02", "境外存款"),
    人行资产二级分类_非金融资产(DictCode.人行资产二级分类, "F01", "非金融资产"),
    人行资产二级分类_黄金(DictCode.人行资产二级分类, "H01", "黄金"),
    人行资产二级分类_境内金融衍生品(DictCode.人行资产二级分类, "J01", "境内(金融衍生品)"),
    人行资产二级分类_境外金融衍生品(DictCode.人行资产二级分类, "J02", "境外(金融衍生品)"),
    人行资产二级分类_同业存单(DictCode.人行资产二级分类, "K01", "同业存单"),
    人行资产二级分类_大额存单(DictCode.人行资产二级分类, "K02", "大额存单"),
    人行资产二级分类_应收账款(DictCode.人行资产二级分类, "P11", "应收账款"),
    人行资产二级分类_应付账款(DictCode.人行资产二级分类, "P12", "应付账款"),
    人行资产二级分类_其他负债(DictCode.人行资产二级分类, "P13", "其他负债"),
    人行资产二级分类_贷款收益权(DictCode.人行资产二级分类, "Q01", "贷款收益权"),
    人行资产二级分类_债务证券收益权(DictCode.人行资产二级分类, "Q02", "债务证券收益权"),
    人行资产二级分类_应收账款收益权(DictCode.人行资产二级分类, "Q03", "应收账款收益权"),
    人行资产二级分类_其他债权收益权(DictCode.人行资产二级分类, "Q04", "其他债权收益权"),
    人行资产二级分类_股票收益权(DictCode.人行资产二级分类, "Q05", "股票收益权"),
    人行资产二级分类_其他股权收益权(DictCode.人行资产二级分类, "Q06", "其他股权收益权"),
    人行资产二级分类_物权资产收益权(DictCode.人行资产二级分类, "Q07", "物权资产收益权"),
    人行资产二级分类_拆借和回购(DictCode.人行资产二级分类, "R01", "拆借和回购"),
    人行资产二级分类_除回购或拆借外贷款(DictCode.人行资产二级分类, "R02", "除回购或拆借外贷款"),
    人行资产二级分类_政府债券(DictCode.人行资产二级分类, "S01", "政府债券"),
    人行资产二级分类_中央银行债券(DictCode.人行资产二级分类, "S02", "中央银行债券"),
    人行资产二级分类_政策性金融债券(DictCode.人行资产二级分类, "S03", "政策性金融债券"),
    人行资产二级分类_其他金融债券(DictCode.人行资产二级分类, "S04", "其他金融债券"),
    人行资产二级分类_企业债券(DictCode.人行资产二级分类, "S05", "企业债券"),
    人行资产二级分类_票据(DictCode.人行资产二级分类, "S06", "票据"),
    人行资产二级分类_资产支持证券(DictCode.人行资产二级分类, "S07", "资产支持证券"),
    人行资产二级分类_境外债券(DictCode.人行资产二级分类, "S08", "境外债券"),
    人行资产二级分类_股票(DictCode.人行资产二级分类, "T01", "股票"),
    人行资产二级分类_特定目的载体份额(DictCode.人行资产二级分类, "T02", "特定目的载体份额"),
    人行资产二级分类_其他股权(DictCode.人行资产二级分类, "T03", "其他股权"),
    人行资产二级分类_境外股权(DictCode.人行资产二级分类, "T04", "境外股权"),
    人行资产二级分类_现金(DictCode.人行资产二级分类, "X01", "现金"),

    人行资产三级分类_境内存款(DictCode.人行资产三级分类, "C01", "境内存款"),
    人行资产三级分类_境外存款(DictCode.人行资产三级分类, "C02", "境外存款"),
    人行资产三级分类_非金融资产(DictCode.人行资产三级分类, "F01", "非金融资产"),
    人行资产三级分类_非金融企业股票(DictCode.人行资产三级分类, "G01", "非金融企业股票"),
    人行资产三级分类_金融机构股票(DictCode.人行资产三级分类, "G02", "金融机构股票"),
    人行资产三级分类_黄金(DictCode.人行资产三级分类, "H01", "黄金"),
    人行资产三级分类_境内金融衍生品资产(DictCode.人行资产三级分类, "J01", "境内(金融衍生品)资产"),
    人行资产三级分类_境外金融衍生品资产(DictCode.人行资产三级分类, "J02", "境外(金融衍生品)资产"),
    人行资产三级分类_境内金融衍生品负债(DictCode.人行资产三级分类, "J03", "境内(金融衍生品)负债"),
    人行资产三级分类_境外金融衍生品负债(DictCode.人行资产三级分类, "J04", "境外(金融衍生品)负债"),
    人行资产三级分类_同业存单(DictCode.人行资产三级分类, "K01", "同业存单"),
    人行资产三级分类_大额存单(DictCode.人行资产三级分类, "K02", "大额存单"),
    人行资产三级分类_住户(DictCode.人行资产三级分类, "L01", "住户"),
    人行资产三级分类_广义政府(DictCode.人行资产三级分类, "L02", "广义政府"),
    人行资产三级分类_非金融企业(DictCode.人行资产三级分类, "L03", "非金融企业  "),
    人行资产三级分类_银行业存款类金融机构(DictCode.人行资产三级分类, "L04", "银行业存款类金融机构"),
    人行资产三级分类_银行业非存款类金融机构(DictCode.人行资产三级分类, "L05", "银行业非存款类金融机构"),
    人行资产三级分类_非银行业金融机构非中央交易对手(DictCode.人行资产三级分类, "L06", "非银行业金融机构-非中央交易对手"),
    人行资产三级分类_非银行业金融机构中央交易对手(DictCode.人行资产三级分类, "L07", "非银行业金融机构-中央交易对手"),
    人行资产三级分类_银行非保本理财(DictCode.人行资产三级分类, "L08", "银行非保本理财"),
    人行资产三级分类_信托公司资管产品(DictCode.人行资产三级分类, "L09", "信托公司资管产品"),
    人行资产三级分类_证券公司及其子公司资管产品(DictCode.人行资产三级分类, "L10", "证券公司及其子公司资管产品"),
    人行资产三级分类_基金管理公司及其子公司专户(DictCode.人行资产三级分类, "L11", "基金管理公司及其子公司专户"),
    人行资产三级分类_期货公司及其子公司资管产品(DictCode.人行资产三级分类, "L12", "期货公司及其子公司资管产品"),
    人行资产三级分类_保险资管产品(DictCode.人行资产三级分类, "L13", "保险资管产品"),
    人行资产三级分类_金融资产投资公司资管产品(DictCode.人行资产三级分类, "L14", "金融资产投资公司资管产品"),
    人行资产三级分类_公募基金(DictCode.人行资产三级分类, "L15", "公募基金"),
    人行资产三级分类_私募机构私募基金(DictCode.人行资产三级分类, "L16", "私募机构私募基金"),
    人行资产三级分类_境外(DictCode.人行资产三级分类, "L98", "境外"),
    人行资产三级分类_其他特定目的载体(DictCode.人行资产三级分类, "L99", "其他特定目的载体"),
    人行资产三级分类_银行非保本理财_M01(DictCode.人行资产三级分类, "M01", "银行非保本理财"),
    人行资产三级分类_信托公司资管产品_M02(DictCode.人行资产三级分类, "M02", "信托公司资管产品"),
    人行资产三级分类_证券公司及其子公司资管产品_M03(DictCode.人行资产三级分类, "M03", "证券公司及其子公司资管产品"),
    人行资产三级分类_基金管理公司及其子公司专户_M04(DictCode.人行资产三级分类, "M04", "基金管理公司及其子公司专户"),
    人行资产三级分类_期货公司及其子公司资管产品_M05(DictCode.人行资产三级分类, "M05", "期货公司及其子公司资管产品"),
    人行资产三级分类_保险资管产品_M06(DictCode.人行资产三级分类, "M06", "保险资管产品"),
    人行资产三级分类_金融资产投资公司资管产品_M07(DictCode.人行资产三级分类, "M07", "金融资产投资公司资管产品"),
    人行资产三级分类__公募基金_M08(DictCode.人行资产三级分类, "M08", "公募基金"),
    人行资产三级分类_私募机构私募基金_M09(DictCode.人行资产三级分类, "M09", "私募机构私募基金"),
    人行资产三级分类_其他特定目的载体_M99(DictCode.人行资产三级分类, "M99", "其他特定目的载体"),
    人行资产三级分类_非金融企业股权(DictCode.人行资产三级分类, "O01", "非金融企业股权"),
    人行资产三级分类_金融机构股权(DictCode.人行资产三级分类, "O02", "金融机构股权"),
    人行资产三级分类_应收账款(DictCode.人行资产三级分类, "P11", "应收账款"),
    人行资产三级分类_应付账款(DictCode.人行资产三级分类, "P12", "应付账款"),
    人行资产三级分类_其他负债(DictCode.人行资产三级分类, "P13", "其他负债"),
    人行资产三级分类_贷款收益权(DictCode.人行资产三级分类, "Q01", "贷款收益权"),
    人行资产三级分类_债务证券收益权(DictCode.人行资产三级分类, "Q02", "债务证券收益权"),
    人行资产三级分类_应收账款收益权(DictCode.人行资产三级分类, "Q03", "应收账款收益权"),
    人行资产三级分类_其他债权收益权(DictCode.人行资产三级分类, "Q04", "其他债权收益权"),
    人行资产三级分类_股票收益权(DictCode.人行资产三级分类, "Q05", "股票收益权"),
    人行资产三级分类_其他股权收益权(DictCode.人行资产三级分类, "Q06", "其他股权收益权"),
    人行资产三级分类_物权资产收益权(DictCode.人行资产三级分类, "Q07", "物权资产收益权"),
    人行资产三级分类_除回购或拆借外贷款(DictCode.人行资产三级分类, "R02", "除回购或拆借外贷款"),
    人行资产三级分类_政府债券(DictCode.人行资产三级分类, "S01", "政府债券"),
    人行资产三级分类_中央银行债券(DictCode.人行资产三级分类, "S02", "中央银行债券"),
    人行资产三级分类_政策性金融债券(DictCode.人行资产三级分类, "S03", "政策性金融债券"),
    人行资产三级分类_其他金融债券(DictCode.人行资产三级分类, "S04", "其他金融债券"),
    人行资产三级分类_企业债券(DictCode.人行资产三级分类, "S05", "企业债券"),
    人行资产三级分类_票据(DictCode.人行资产三级分类, "S06", "票据"),
    人行资产三级分类_资产支持证券(DictCode.人行资产三级分类, "S07", "资产支持证券"),
    人行资产三级分类_境外债券(DictCode.人行资产三级分类, "S08", "境外债券"),
    人行资产三级分类_境外股权(DictCode.人行资产三级分类, "T04", "境外股权"),
    人行资产三级分类_现金(DictCode.人行资产三级分类, "X01", "现金"),
    //added by shaohuchen 2019/11/23 end
    发行机构类型_按规模划分_中小微企业(DictCode.发行机构类型_按规模划分, "01", "中小微企业"),

    //add by wangxiaoyong 2019-11-29 end
    共通业务类型_交易费用管理(DictCode.共通业务类型, "TRD68", "交易费用管理"),

    //行内资产一级分类
    行内资产一级分类_同业融资类(DictCode.人行资产一级分类, "01", "同业融资类"),
    行内资产一级分类_债券类信用债(DictCode.人行资产一级分类, "02", "债券类-信用债"),
    行内资产一级分类_债券类利率债(DictCode.人行资产一级分类, "03", "债券类-利率债"),
    行内资产一级分类_其他债权类(DictCode.人行资产一级分类, "04", "其他债权类"),

    平安业务类型_货币型产品轧差清算(DictCode.平安业务类型, "140", "货币型产品轧差清算"),

    //行内资产一级分类
    资产一级分类_同业融资类(DictCode.资产一级分类, "01", "同业融资类"),
    资产一级分类_债券类信用债(DictCode.资产一级分类, "02", "债券类-信用债"),
    资产一级分类_债券类利率债(DictCode.资产一级分类, "03", "债券类-利率债"),
    资产一级分类_其他债权类(DictCode.资产一级分类, "04", "其他债权类"),
    交易方向_退款到账(DictCode.交易方向, "T58", "退款到账"),
    //add daiguofu 20191225
    共通业务类型_产品规划信息维护(DictCode.共通业务类型, "PRDPLAN08", "产品规划信息维护"),
    策略分类_投资策略(DictCode.策略分类, "01", "投资策略"),
    策略分类_规划策略(DictCode.策略分类, "02", "规划策略"),
    /**
     * 计提份额占比收息 add  by yanya on 20191219
     **/
    计提份额占比收息_按占比收息(DictCode.计提份额占比收息, "01", "按占比收息"),
    计提份额占比收息_不按占比收息(DictCode.计提份额占比收息, "02", "不按占比收息"),
    存款类资产类型_活期存放(DictCode.存款类资产类型, "D03", "活期存放"),
    现金流二级类型_罚息(DictCode.现金流二级类型, "C19", "罚息"),
    共通业务类型_逾期计息要素维护(DictCode.共通业务类型, "FINASSET20", "逾期计息要素维护"),
    共通业务类型_场外期权类资产信息(DictCode.共通业务类型, "ETR22", "场外期权类资产信息"),
    应收款类型_逾期未收本金(DictCode.应收款类型, "01", "逾期未收本金"),
    应收款类型_逾期未收利息(DictCode.应收款类型, "02", "逾期未收利息"),
    应收款类型_还本未收利息(DictCode.应收款类型, "03", "还本未收利息"),
    应收款类型_卖出未收利息(DictCode.应收款类型, "04", "卖出未收利息"),
    应收款类型_买入未付利息(DictCode.应收款类型, "05", "买入未付利息"),
    共通业务类型_已到期资产转让(DictCode.共通业务类型, "TRD67", "已到期资产转让"),
    共通业务类型_已到期资产存续期(DictCode.共通业务类型, "TRD68", "已到期资产存续期"),
    平安业务类型_已到期资产转让(DictCode.平安业务类型, "141", "已到期资产转让"),
    平安业务类型_已到期资产存续期(DictCode.平安业务类型, "144", "已到期资产存续期"),
    罚息计提基数_逾期本金(DictCode.罚息计提基数, "01", "逾期本金"),
    罚息计提基数_逾期利息(DictCode.罚息计提基数, "02", "逾期利息"),
    罚息计提基数_逾期本息和(DictCode.罚息计提基数, "03", "逾期本息和"),
    现金流类型_罚息收息(DictCode.现金流类型, "06", "罚息收息"),
    计息利率方式_买断利率计提(DictCode.计息利率方式, "01", "买断利率计提"),
    计息利率方式_净投资收益率计提(DictCode.计息利率方式, "02", "净投资收益率计提"),
    交易日历_中国法定节假日(DictCode.交易日历, "01", "中国法定节假日"),
    展示维度_日(DictCode.展示维度, "01", "日"),
    展示维度_周(DictCode.展示维度, "02", "周"),
    展示维度_月(DictCode.展示维度, "03", "月"),
    展示维度_短期(DictCode.展示维度, "04", "短期"),

    人行产品运作模式_开放式净值型(DictCode.人行产品运作模式, "2", "开放式净值型"),
    人行产品运作模式_开放式非净值型(DictCode.人行产品运作模式, "3", "开放式非净值型"),
    人行产品运作模式_封闭式净值型(DictCode.人行产品运作模式, "4", "封闭式净值型"),
    人行产品运作模式_封闭式非净值型(DictCode.人行产品运作模式, "5", "封闭式非净值型"),

    人行客户类型_单位(DictCode.人行客户类型, "1", "单位"),
    人行客户类型_个人(DictCode.人行客户类型, "2", "个人"),
    人行客户类型_单位及个人(DictCode.人行客户类型, "3", "单位及个人"),
    人行客户类型_住户(DictCode.人行客户类型, "4", "住户"),
    人行客户类型_广义政府(DictCode.人行客户类型, "5", "广义政府"),
    人行客户类型_非金融企业(DictCode.人行客户类型, "6", "非金融企业"),
    人行客户类型_金融机构_实体(DictCode.人行客户类型, "7", "金融机构（实体）"),
    人行客户类型_特定目的载体(DictCode.人行客户类型, "8", "特定目的载体"),
    人行客户类型_境外(DictCode.人行客户类型, "9", "境外"),
    批处理系统代码_估值(DictCode.批处理系统代码, "VAL", "估值"),
    批处理系统代码_投管(DictCode.批处理系统代码, "INV", "投管"),
    批处理系统代码_信批(DictCode.批处理系统代码, "DIS", "信批"),
    批处理系统代码_中债(DictCode.批处理系统代码, "SVR", "中债"),
    批处理任务组类型_T日(DictCode.批处理任务组类型, "01", "T日"),
    批处理任务组类型_日切(DictCode.批处理任务组类型, "99", "日切"),
    批处理任务组类型_T1日(DictCode.批处理任务组类型, "02", "T+1日"),
    结息方式_结转为本金(DictCode.结息方式, "01", "结转为本金"),
    结息方式_现金结息(DictCode.结息方式, "02", "现金结息"),
    /**
     * 发行规划试算 	20191223
     **/
    共通业务类型_发行规划试算(DictCode.共通业务类型, "PRDPLAN07", "发行规划试算"),
    //查询口径 yzg 20191224
    查询口径_全部查询(DictCode.查询口径, "01", "全部查询"),
    查询扣经_按产品系列(DictCode.查询口径, "02", "按产品系列"),
    //从DictCodeListExt1移动都DictCodeListExt3中，新增 03：无需处理 add by chendijun 2019/12/3
    贴补状态_已贴补(DictCode.贴补状态, "01", "已贴补"),
    贴补状态_未贴补(DictCode.贴补状态, "02", "未贴补"),
    贴补状态_无需处理(DictCode.贴补状态, "03", "无需处理"),
    //修正场景 yzg 20191226
    修正场景_高悲观(DictCode.修正场景, "01", "高悲观"),
    修正场景_中悲观(DictCode.修正场景, "02", "中悲观"),
    修正场景_轻悲观(DictCode.修正场景, "03", "轻悲观"),
    修正场景_中性(DictCode.修正场景, "04", "中性"),
    修正场景_轻乐观(DictCode.修正场景, "05", "轻乐观"),
    修正场景_中乐观(DictCode.修正场景, "06", "中乐观"),
    修正场景_高乐观(DictCode.修正场景, "07", "高乐观"),
    共通业务类型_战术配置优化(DictCode.共通业务类型, "PRDPLAN02", "战术配置优化"),
    共通业务类型_资产分类管理(DictCode.共通业务类型, "PRDPLAN01", "资产分类管理"),
    /**
     * PB要素类型 add by caoxue 2019-12-24 start
     **/
    PB要素类型_产品(DictCode.PB要素类型, "0", "产品"),
    PB要素类型_子组合(DictCode.PB要素类型, "1", "子组合"),
    /**
     * PB要素类型 add by caoxue 2019-12-24 end
     **/
    投资策略类型_单一资产策略(DictCode.投资策略类型, "01", "单一资产策略"),
    投资策略类型_混合资产策略(DictCode.投资策略类型, "02", "混合资产策略"),

    /**
     * 增加 交易方向_提前行权 和 交易方向_到期行权
     **/
    交易方向_提前行权(DictCode.交易方向, "T59", "提前行权"),
    交易方向_到期行权(DictCode.交易方向, "T60", "到期行权"),

    下钻层级_资产一级分类(DictCode.下钻层级, "01", "资产一级分类"),
    下钻层级_资产二级分类(DictCode.下钻层级, "02", "资产二级分类"),
    下钻层级_资产三级分类(DictCode.下钻层级, "03", "资产三级分类"),
    下钻层级_资产四级分类(DictCode.下钻层级, "04", "资产四级分类"),
    下钻层级_资产五级分类(DictCode.下钻层级, "05", "资产五级分类"),
    展示方式_单组合汇总(DictCode.展示方式, "01", "单组合汇总"),
    展示方式_多组合汇总(DictCode.展示方式, "02", "多组合汇总"),
    指标类型代码_综合指标(DictCode.指标类型代码, "01", "综合指标"),
    指标类型代码_债券指标(DictCode.指标类型代码, "02", "债券指标"),
    指标类型代码_股票指标(DictCode.指标类型代码, "03", "股票指标"),

    含权信息_永续(DictCode.含权信息, "01", "永续"),
    含权信息_赎回权(DictCode.含权信息, "02", "赎回权"),
    含权信息_回售权(DictCode.含权信息, "03", "回售权"),
    含权信息_赎回权_回售权(DictCode.含权信息, "04", "赎回权、回售权"),
    共通业务类型_场外期权(DictCode.共通业务类型, "38", "场外期权"),
    //DictCodeList 文件超长移动 guyunfei 20200103 start
    拆分标识_已拆分(DictCode.拆分标识, "01", "已拆分"),
    拆分标识_未拆分(DictCode.拆分标识, "02", "未拆分"),
    //DictCodeList 文件超长移动 guyunfei 20200103 end
    基准类型_2_合约标的(DictCode.基准类型_2, "07", "合约标的"),    //add by tanxuan 20200102 start
    估值表类型_待抵扣投资收益税(DictCode.估值表类型, "39", "待抵扣投资收益税"),
    估值表类型_待抵扣暂估投资收益税(DictCode.估值表类型, "40", "待抵扣暂估投资收益税"),
    //add by tanxuan 20200102 end
    计算模式_计算回购利率(DictCode.计算模式, "01", "计算模式_计算回购利率"),
    计算模式_计算首次净价(DictCode.计算模式, "02", "计算模式_计算首次净价"),
    计算模式_计算到期净价(DictCode.计算模式, "03", "计算模式_计算到期净价"),
    //add by hpp 2020-01-07 start
    借款人类型_住户(DictCode.借款人类型, "1", "住户"),
    借款人类型_广义政府(DictCode.借款人类型, "2", "广义政府"),
    借款人类型_非金融企业(DictCode.借款人类型, "3", "非金融企业"),
    借款人类型_金融机构(DictCode.借款人类型, "4", "金融机构（实体）"),
    借款人类型_特定目的载体(DictCode.借款人类型, "5", "特定目的载体"),
    借款人类型_境外(DictCode.借款人类型, "6", "境外"),
    经济成分一级_公有控股经济(DictCode.经济成分一级, "A", "公有控股经济"),
    经济成分一级_非公有控股经济(DictCode.经济成分一级, "B", "非公有控股经济"),
    经济成分二级_国有控股(DictCode.经济成分二级, "A01", "国有控股"),
    经济成分二级_集体控股(DictCode.经济成分二级, "A02", "集体控股"),
    经济成分二级_私人控股(DictCode.经济成分二级, "B01", "私人控股"),
    经济成分二级_港澳台控股(DictCode.经济成分二级, "B02", "港澳台控股"),
    经济成分二级_外商控股(DictCode.经济成分二级, "B03", "外商控股"),
    经济成分三级_国有相对控股(DictCode.经济成分三级, "A0101", "国有相对控股"),
    经济成分三级_国有绝对控股(DictCode.经济成分三级, "A0102", "国有绝对控股"),
    经济成分三级_集体相对控股(DictCode.经济成分三级, "A0201", "集体相对控股"),
    经济成分三级_集体绝对控股(DictCode.经济成分三级, "A0202", "集体绝对控股"),
    经济成分三级_私人相对控股(DictCode.经济成分三级, "B0101", "私人相对控股"),
    经济成分三级_私人绝对控股(DictCode.经济成分三级, "B0102", "私人绝对控股"),
    经济成分三级_港澳台相对控股(DictCode.经济成分三级, "B0201", "港澳台相对控股"),
    经济成分三级_港澳台绝对控股(DictCode.经济成分三级, "B0202", "港澳台绝对控股"),
    经济成分三级_外商相对控股(DictCode.经济成分三级, "B0301", "外商相对控股"),
    经济成分三级_外商绝对控股(DictCode.经济成分三级, "B0302", "外商绝对控股"),
    行业大类编码_农业(DictCode.行业大类编码, "1", "农业"),
    行业大类编码_林业(DictCode.行业大类编码, "2", "林业"),
    行业大类编码_畜牧业(DictCode.行业大类编码, "3", "畜牧业"),
    行业大类编码_渔业(DictCode.行业大类编码, "4", "渔业"),
    行业大类编码_农林牧渔专业及辅助性活动(DictCode.行业大类编码, "5", "农、林、牧、渔专业及辅助性活动"),
    行业大类编码_煤炭开采和洗选业(DictCode.行业大类编码, "6", "煤炭开采和洗选业"),
    行业大类编码_石油和天然气开采业(DictCode.行业大类编码, "7", "石油和天然气开采业"),
    行业大类编码_黑色金属矿采选业(DictCode.行业大类编码, "8", "黑色金属矿采选业"),
    行业大类编码_有色金属矿采选业(DictCode.行业大类编码, "9", "有色金属矿采选业"),
    行业大类编码_非金属矿采选业(DictCode.行业大类编码, "10", "非金属矿采选业"),
    行业大类编码_开采专业及辅助性活动(DictCode.行业大类编码, "11", "开采专业及辅助性活动"),
    行业大类编码_其他采矿业(DictCode.行业大类编码, "12", "其他采矿业"),
    行业大类编码_农副食品加工业(DictCode.行业大类编码, "13", "农副食品加工业"),
    行业大类编码_食品制造业(DictCode.行业大类编码, "14", "食品制造业"),
    行业大类编码_酒饮料和精制茶制造业(DictCode.行业大类编码, "15", "酒、饮料和精制茶制造业"),
    行业大类编码_烟草制品业(DictCode.行业大类编码, "16", "烟草制品业"),
    行业大类编码_纺织业(DictCode.行业大类编码, "17", "纺织业"),
    行业大类编码_纺织服装服饰业(DictCode.行业大类编码, "18", "纺织服装、服饰业"),
    行业大类编码_皮革毛皮羽毛及其制品和制鞋业(DictCode.行业大类编码, "19", "皮革、毛皮、羽毛及其制品和制鞋业"),
    行业大类编码_木材加工和木竹藤棕草制品业(DictCode.行业大类编码, "20", "木材加工和木、竹、藤、棕、草制品业"),
    行业大类编码_家具制造业(DictCode.行业大类编码, "21", "家具制造业"),
    行业大类编码_造纸和纸制品业(DictCode.行业大类编码, "22", "造纸和纸制品业"),
    行业大类编码_印刷和记录媒介复制业(DictCode.行业大类编码, "23", "印刷和记录媒介复制业"),
    行业大类编码_文教工美体育和娱乐用品制造业(DictCode.行业大类编码, "24", "文教、工美、体育和娱乐用品制造业"),
    行业大类编码_石油煤炭及其他燃料加工业(DictCode.行业大类编码, "25", "石油、煤炭及其他燃料加工业"),
    行业大类编码_化学原料和化学制品制造业(DictCode.行业大类编码, "26", "化学原料和化学制品制造业"),
    行业大类编码_医药制造业(DictCode.行业大类编码, "27", "医药制造业"),
    行业大类编码_化学纤维制造业(DictCode.行业大类编码, "28", "化学纤维制造业"),
    行业大类编码_橡胶和塑料制品业(DictCode.行业大类编码, "29", "橡胶和塑料制品业"),
    行业大类编码_非金属矿物制品业(DictCode.行业大类编码, "30", "非金属矿物制品业"),
    行业大类编码_黑色金属冶炼和压延加工业(DictCode.行业大类编码, "31", "黑色金属冶炼和压延加工业"),
    行业大类编码_有色金属冶炼和压延加工业(DictCode.行业大类编码, "32", "有色金属冶炼和压延加工业"),
    行业大类编码_金属制品业(DictCode.行业大类编码, "33", "金属制品业"),
    行业大类编码_通用设备制造业(DictCode.行业大类编码, "34", "通用设备制造业"),
    行业大类编码_专用设备制造业(DictCode.行业大类编码, "35", "专用设备制造业"),
    行业大类编码_汽车制造业(DictCode.行业大类编码, "36", "汽车制造业"),
    行业大类编码_铁路船舶航空航天和其他运输设备制造业(DictCode.行业大类编码, "37", "铁路、船舶、航空航天和其他运输设备制造业"),
    行业大类编码_电气机械和器材制造业(DictCode.行业大类编码, "38", "电气机械和器材制造业"),
    行业大类编码_计算机通信和其他电子设备制造业(DictCode.行业大类编码, "39", "计算机、通信和其他电子设备制造业"),
    行业大类编码_仪器仪表制造业(DictCode.行业大类编码, "40", "仪器仪表制造业"),
    行业大类编码_其他制造业(DictCode.行业大类编码, "41", "其他制造业"),
    行业大类编码_废弃资源综合利用业(DictCode.行业大类编码, "42", "废弃资源综合利用业"),
    行业大类编码_金属制品机械和设备修理业(DictCode.行业大类编码, "43", "金属制品、机械和设备修理业"),
    行业大类编码_电力热力生产和供应业(DictCode.行业大类编码, "44", "电力、热力生产和供应业"),
    行业大类编码_燃气生产和供应业(DictCode.行业大类编码, "45", "燃气生产和供应业"),
    行业大类编码_水的生产和供应业(DictCode.行业大类编码, "46", "水的生产和供应业"),
    行业大类编码_房屋建筑业(DictCode.行业大类编码, "47", "房屋建筑业"),
    行业大类编码_土木工程建筑业(DictCode.行业大类编码, "48", "土木工程建筑业"),
    行业大类编码_建筑安装业(DictCode.行业大类编码, "49", "建筑安装业"),
    行业大类编码_建筑装饰装修和其他建筑业(DictCode.行业大类编码, "50", "建筑装饰、装修和其他建筑业"),
    行业大类编码_批发业(DictCode.行业大类编码, "51", "批发业"),
    行业大类编码_零售业(DictCode.行业大类编码, "52", "零售业"),
    行业大类编码_铁路运输业(DictCode.行业大类编码, "53", "铁路运输业"),
    行业大类编码_道路运输业(DictCode.行业大类编码, "54", "道路运输业"),
    行业大类编码_水上运输业(DictCode.行业大类编码, "55", "水上运输业"),
    行业大类编码_航空运输业(DictCode.行业大类编码, "56", "航空运输业"),
    行业大类编码_管道运输业(DictCode.行业大类编码, "57", "管道运输业"),
    行业大类编码_多式联运和运输代理业(DictCode.行业大类编码, "58", "多式联运和运输代理业"),
    行业大类编码_装卸搬运和仓储业(DictCode.行业大类编码, "59", "装卸搬运和仓储业"),
    行业大类编码_邮政业(DictCode.行业大类编码, "60", "邮政业"),
    行业大类编码_住宿业(DictCode.行业大类编码, "61", "住宿业"),
    行业大类编码_餐饮业(DictCode.行业大类编码, "62", "餐饮业"),
    行业大类编码_电信广播电视和卫星传输服务(DictCode.行业大类编码, "63", "电信、广播电视和卫星传输服务"),
    行业大类编码_互联网和相关服务(DictCode.行业大类编码, "64", "互联网和相关服务"),
    行业大类编码_软件和信息技术服务业(DictCode.行业大类编码, "65", "软件和信息技术服务业"),
    行业大类编码_货币金融服务(DictCode.行业大类编码, "66", "货币金融服务"),
    行业大类编码_资本市场服务(DictCode.行业大类编码, "67", "资本市场服务"),
    行业大类编码_保险业(DictCode.行业大类编码, "68", "保险业"),
    行业大类编码_其他金融业(DictCode.行业大类编码, "69", "其他金融业"),
    行业大类编码_房地产业(DictCode.行业大类编码, "70", "房地产业"),
    行业大类编码_租赁业(DictCode.行业大类编码, "71", "租赁业"),
    行业大类编码_商务服务业(DictCode.行业大类编码, "72", "商务服务业"),
    行业大类编码_研究和试验发展(DictCode.行业大类编码, "73", "研究和试验发展"),
    行业大类编码_专业技术服务业(DictCode.行业大类编码, "74", "专业技术服务业"),
    行业大类编码_科技推广和应用服务(DictCode.行业大类编码, "75", "科技推广和应用服务"),
    行业大类编码_水利管理业(DictCode.行业大类编码, "76", "水利管理业"),
    行业大类编码_生态保护和环境治理业(DictCode.行业大类编码, "77", "生态保护和环境治理业"),
    行业大类编码_公共设施管理业(DictCode.行业大类编码, "78", "公共设施管理业"),
    行业大类编码_土地管理业(DictCode.行业大类编码, "79", "土地管理业"),
    行业大类编码_居民服务业(DictCode.行业大类编码, "80", "居民服务业"),
    行业大类编码_机动车电子产品和日用产品修理业(DictCode.行业大类编码, "81", "机动车、电子产品和日用产品修理业"),
    行业大类编码_其他服务业(DictCode.行业大类编码, "82", "其他服务业"),
    行业大类编码_教育(DictCode.行业大类编码, "83", "教育"),
    行业大类编码_卫生(DictCode.行业大类编码, "84", "卫生"),
    行业大类编码_社会工作(DictCode.行业大类编码, "85", "社会工作"),
    行业大类编码_新闻和出版业(DictCode.行业大类编码, "86", "新闻和出版业"),
    行业大类编码_广播电视电影和影视录音制作业(DictCode.行业大类编码, "87", "广播、电视、电影和影视录音制作业"),
    行业大类编码_文化艺术业(DictCode.行业大类编码, "88", "文化艺术业"),
    行业大类编码_体育(DictCode.行业大类编码, "89", "体育"),
    行业大类编码_娱乐业(DictCode.行业大类编码, "90", "娱乐业"),
    行业大类编码_中国共产党机关(DictCode.行业大类编码, "91", "中国共产党机关"),
    行业大类编码_国家机构(DictCode.行业大类编码, "92", "国家机构"),
    行业大类编码_人民政协民主党派(DictCode.行业大类编码, "93", "人民政协、民主党派"),
    行业大类编码_社会保障(DictCode.行业大类编码, "94", "社会保障"),
    行业大类编码_群众团体社会团体和其他成员组织(DictCode.行业大类编码, "95", "群众团体、社会团体和其他成员组织"),
    行业大类编码_基层群众自治组织及其他组织(DictCode.行业大类编码, "96", "基层群众自治组织及其他组织"),
    行业大类编码_国际组织(DictCode.行业大类编码, "97", "国际组织"),
    行业大类编码_个人贷款(DictCode.行业大类编码, "98", "个人贷款"),
    行业大类编码_对境外贷款(DictCode.行业大类编码, "99", "对境外贷款"),
    行业大类编码_境内个人(DictCode.行业大类编码, "100", "境内个人"),
    行业大类编码_非居民(DictCode.行业大类编码, "200", "非居民"),
    行业门内编码_境内个人(DictCode.行业门内编码, "1", "境内个人"),
    行业门内编码_非居民(DictCode.行业门内编码, "2", "非居民"),
    行业门内编码_农林牧渔业(DictCode.行业门内编码, "A", "农、林、牧、渔业"),
    行业门内编码_采矿业(DictCode.行业门内编码, "B", "采矿业"),
    行业门内编码_制造业(DictCode.行业门内编码, "C", "制造业"),
    行业门内编码_电力热力燃气及水生产和供应业(DictCode.行业门内编码, "D", "电力、热力、燃气及水生产和供应业"),
    行业门内编码_建筑业(DictCode.行业门内编码, "E", "建筑业"),
    行业门内编码_批发和零售业(DictCode.行业门内编码, "F", "批发和零售业"),
    行业门内编码_交通运输仓储和邮政业(DictCode.行业门内编码, "G", "交通运输、仓储和邮政业"),
    行业门内编码_住宿和餐饮业(DictCode.行业门内编码, "H", "住宿和餐饮业"),
    行业门内编码_信息传输软件和信息技术服务业(DictCode.行业门内编码, "I", "信息传输、软件和信息技术服务业"),
    行业门内编码_金融业(DictCode.行业门内编码, "J", "金融业"),
    行业门内编码_房地产(DictCode.行业门内编码, "K", "房地产"),
    行业门内编码_租赁和商务服务业(DictCode.行业门内编码, "L", "租赁和商务服务业"),
    行业门内编码_科学研究和技术服务业(DictCode.行业门内编码, "M", "科学研究和技术服务业"),
    行业门内编码_水利环境和公共设施管理业(DictCode.行业门内编码, "N", "水利、环境和公共设施管理业"),
    行业门内编码_居民服务修理和其他服务业(DictCode.行业门内编码, "O", "居民服务、修理和其他服务业"),
    行业门内编码_教育(DictCode.行业门内编码, "P", "教育"),
    行业门内编码_卫生和社会工作(DictCode.行业门内编码, "Q", "卫生和社会工作"),
    行业门内编码_文化体育和娱乐业(DictCode.行业门内编码, "R", "文化、体育和娱乐业"),
    行业门内编码_公共管理社会保障和社会组织(DictCode.行业门内编码, "S", "公共管理、社会保障和社会组织"),
    行业门内编码_国际组织(DictCode.行业门内编码, "T", "国际组织"),
    行业门内编码_对境外贷款(DictCode.行业门内编码, "U", "对境外贷款"),
    行业门内编码_个人贷款及透支(DictCode.行业门内编码, "V", "个人贷款及透支"),
    利率是否固定_固定利率(DictCode.利率是否固定, "RF01", "固定利率"),
    利率是否固定_浮动利率(DictCode.利率是否固定, "RF02", "浮动利率"),
    贷款担保方式_质押贷款(DictCode.贷款担保方式, "A", "质押贷款"),
    贷款担保方式_房地产抵押贷款(DictCode.贷款担保方式, "B01", "房地产抵押贷款"),
    贷款担保方式_其他抵押贷款(DictCode.贷款担保方式, "B99", "其他抵押贷款"),
    贷款担保方式_联保贷款(DictCode.贷款担保方式, "C01", "联保贷款"),
    贷款担保方式_其他保证贷款(DictCode.贷款担保方式, "C99", "其他保证贷款"),
    贷款担保方式_信用免担保贷款(DictCode.贷款担保方式, "D", "信用/免担保贷款"),
    贷款担保方式_组合担保(DictCode.贷款担保方式, "E", "组合担保"),
    贷款担保方式_其他(DictCode.贷款担保方式, "Z", "其他"),
    贷款产品类别_个人住房贷款(DictCode.贷款产品类别, "F0211", "个人住房贷款"),
    贷款产品类别_个人汽车消费贷款(DictCode.贷款产品类别, "F0212", "个人汽车消费贷款"),
    贷款产品类别_国家助学贷款(DictCode.贷款产品类别, "F02131", "国家助学贷款"),
    贷款产品类别_一般商业性助学贷款(DictCode.贷款产品类别, "F02132", "一般商业性助学贷款"),
    贷款产品类别_其他消费贷款(DictCode.贷款产品类别, "F0219", "其他消费贷款"),
    贷款产品类别_经营贷款(DictCode.贷款产品类别, "F022", "经营贷款"),
    贷款产品类别_固定资产贷款(DictCode.贷款产品类别, "F023", "固定资产贷款"),
    贷款产品类别_承兑垫款(DictCode.贷款产品类别, "F051", "承兑垫款"),
    贷款产品类别_担保垫款(DictCode.贷款产品类别, "F052", "担保垫款"),
    贷款产品类别_信用证垫款(DictCode.贷款产品类别, "F053", "信用证垫款"),
    贷款产品类别_其他垫款(DictCode.贷款产品类别, "F059", "其他垫款"),
    贷款产品类别_国际贸易融资(DictCode.贷款产品类别, "F081", "国际贸易融资"),
    贷款产品类别_国内贸易融资(DictCode.贷款产品类别, "F082", "国内贸易融资"),
    贷款产品类别_融资租赁(DictCode.贷款产品类别, "F09", "融资租赁"),
    贷款产品类别_打包信贷受让资产(DictCode.贷款产品类别, "F10", "打包信贷受让资产"),
    贷款产品类别_转贷款(DictCode.贷款产品类别, "F11", "转贷款"),
    贷款产品类别_并购贷款(DictCode.贷款产品类别, "F12", "并购贷款"),
    贷款产品类别_其他贷款(DictCode.贷款产品类别, "F99", "其他贷款"),
    贷款质量_正常类贷款(DictCode.贷款质量, "FQ01", "正常类贷款"),
    贷款质量_关注类贷款(DictCode.贷款质量, "FQ02", "关注类贷款"),
    贷款质量_次级类贷款(DictCode.贷款质量, "FQ03", "次级类贷款"),
    贷款质量_可疑类贷款(DictCode.贷款质量, "FQ04", "可疑类贷款"),
    贷款质量_损失类贷款(DictCode.贷款质量, "FQ05", "损失类贷款"),
    贷款状态_正常(DictCode.贷款状态, "FS01", "正常"),
    贷款状态_展期(DictCode.贷款状态, "FS02", "展期"),
    贷款状态_逾期(DictCode.贷款状态, "FS03", "逾期"),
    贷款种类_发放贷款(DictCode.贷款种类, "1", "发放贷款"),
    贷款种类_转让贷款(DictCode.贷款种类, "2", "转让贷款"),
    贷款种类_其他债权收益权(DictCode.贷款种类, "3", "其他债权收益权"),
    企业规模_大型(DictCode.企业规模, "CS01", "大型"),
    企业规模_中型(DictCode.企业规模, "CS02", "中型"),
    企业规模_小型(DictCode.企业规模, "CS03", "小型"),
    企业规模_微型(DictCode.企业规模, "CS04", "微型"),
    企业规模_其他(DictCode.企业规模, "CS05", "其他"),

    //add by hpp 2020-01-07 end
    //add by jyl 20200107
    共通业务类型_产品风险等级评定(DictCode.共通业务类型, "REQ06", "产品风险等级评定"),
    // 质押券优先级设置字典 2020-1-8 lizhi start
    质押优先级_极高(DictCode.质押优先级, "01", "极高"),
    质押优先级_高(DictCode.质押优先级, "02", "高"),
    质押优先级_中(DictCode.质押优先级, "03", "中"),
    质押优先级_低(DictCode.质押优先级, "04", "低"),
    质押优先级_极低(DictCode.质押优先级, "05", "极低"),
    收付方向_收取(DictCode.收付方向, "03", "收取"),
    剩余期限_剩余期限短的优先质押(DictCode.剩余期限, "01", "剩余期限短的优先质押"),
    剩余期限_剩余期限长的优先质押(DictCode.剩余期限, "02", "剩余期限长的优先质押"),
    收付方向_支付(DictCode.收付方向, "04", "支付"),
    债项评级_债项评级低的优先质押(DictCode.债项评级, "01", "债项评级低的优先质押"),
    债项评级_债项评级高的优先质押(DictCode.债项评级, "02", "债项评级高的优先质押"),
    交易类型_投资指令(DictCode.交易类型, "02", "投资指令"),
    交易类型_预录入(DictCode.交易类型, "01", "预录入"),
    // 质押券优先级设置字典 2020-1-8 lizhi end
    //add by likai 2020-1-14
    共通业务类型_期权投资委托(DictCode.共通业务类型, "ETR21", "期权投资委托"),


    //add by tanxuan on 20200101
    业务类型_场外期权(DictCode.业务类型, "38", "场外期权"),
    金融产品类型_投管用_期权(DictCode.金融产品类型_投管用, "F35", "期权"),
    /**
     * 截标状态明细 add by gejiaao 20200109
     */
    截标状态_已截标(DictCode.截标状态, "01", "已截标"),
    截标状态_未截标(DictCode.截标状态, "02", "未截标"),

    /**
     * add by yanya on 20200111 交易方向增加 转换赎回申请、转换赎回确认、转换申购确认
     **/
    交易方向_转换赎回申请(DictCode.交易方向, "T62", "转换赎回申请"),
    交易方向_转换赎回确认(DictCode.交易方向, "T63", "转换赎回确认"),
    交易方向_转换申购确认(DictCode.交易方向, "T64", "转换申购确认"),
    指令类型_债券类资产_申购划款(DictCode.指令类型, "2741", "资金划款-债券类资产申购划款"),
    指令类型_债券类资产_申购退款(DictCode.指令类型, "2742", "资金收款-债券类资产申购退款"),
    金融产品类型_期权(DictCode.金融产品类型, "F35", "期权"),
    共通业务类型_期权交易(DictCode.共通业务类型, "TRD71", "期权交易"),
    平安资产类型_期权(DictCode.平安资产类型, "F18", "期权"),
    利率类型_结构性(DictCode.利率类型, "03", "结构性"),
    基准类型_合约标的(DictCode.基准类型, "07", "合约标的"),
    行权方式_欧式(DictCode.行权方式, "06", "欧式"),
    行权方式_美式(DictCode.行权方式, "07", "美式"),
    结构类型_看涨(DictCode.结构类型, "01", "看涨"),
    结构类型_看跌(DictCode.结构类型, "02", "看跌"),
    结构类型_二元看涨(DictCode.结构类型, "03", "二元看涨"),
    结构类型_看涨鲨鱼鳍(DictCode.结构类型, "04", "看涨鲨鱼鳍"),
    结构类型_双向鲨鱼鳍(DictCode.结构类型, "05", "双向鲨鱼鳍"),
    期权费支付类型_先付期权费(DictCode.期权费支付类型, "01", "先付期权费"),
    期权费支付类型_后付期权费(DictCode.期权费支付类型, "02", "后付期权费"),

    共通业务类型_基金账户管理(DictCode.共通业务类型, "MST25", "基金账户管理"),
    证券账户类型_证券账户(DictCode.证券账户类型, "SEC", "证券账户"),
    证券账户类型_基金账户(DictCode.证券账户类型, "FUND", "基金账户"),

    //穿透维度 add by chendijun 20200113 start
    穿透维度_不穿透(DictCode.穿透维度, "01", "不穿透"),
    穿透维度_穿透(DictCode.穿透维度, "02", "穿透"),
    穿透维度_底层资产(DictCode.穿透维度, "03", "底层资产"),
    //穿透维度 add by chendijun 20200113 end

    //评级来源类型 add by chendijun 20200113 start
    评级来源类型_外部(DictCode.评级来源类型, "01", "外部"),
    评级来源类型_内部(DictCode.评级来源类型, "02", "内部"),
    //评级来源类型度 add by chendijun 20200113 end

    //融资人性质 add by chendijun 20200113 start
    融资人性质_企业类_事业类_债务人或保证人(DictCode.融资人性质, "01", "企业类&事业类（债务人或保证人）"),
    融资人性质_商业银行(DictCode.融资人性质, "02", "商业银行"),
    融资人性质_非银金融机构(DictCode.融资人性质, "03", "非银金融机构"),
    融资人性质_企事业法人_银行间市场证券化(DictCode.融资人性质, "04", "企事业法人&银行间市场证券化"),
    融资人性质_金融机构(DictCode.融资人性质, "05", "金融机构"),
    融资人性质_其他证券化(DictCode.融资人性质, "06", "其他证券化"),
    融资人性质_企事业法人_金融机构(DictCode.融资人性质, "07", "企事业法人&金融机构"),
    //融资人性质 add by chendijun 20200113 end

    //行内资产四级分类 add by chendijun 20200113 start
    行内资产四级分类_短融(DictCode.行内资产四级分类, "015", "短融"),
    行内资产四级分类_超短融(DictCode.行内资产四级分类, "016", "超短融"),
    行内资产四级分类_金融机构次级债(DictCode.行内资产四级分类, "009", "金融机构次级债"),
    //行内资产四级分类 add by chendijun 20200113 end

    //行内资产四级分类 add by chendijun 20200113 start
    行内资产三级分类_资产支持证券(DictCode.行内资产四级分类, "12", "资产支持证券"),
    //行内资产四级分类 add by chendijun 20200113 end
    // 中债报送Excel下载数据字典 zhangyf 20200111 start
    报送文件类别_投资者明细信息登记(DictCode.报送文件类别, "01", "投资者明细信息登记"),
    报送处理状态_正常结束(DictCode.报送处理状态, "01", "正常结束"),
    报送处理状态_异常结束(DictCode.报送处理状态, "02", "异常结束"),
    报送处理状态_处理中(DictCode.报送处理状态, "03", "处理中"),
    报送处理状态_未处理(DictCode.报送处理状态, "04", "未处理"),
    // 中债报送Excel下载数据字典 zhangyf 20200111 end

    /**
     * 区间内浮动管理费计提方式 add by yanya on 20200114 start
     **/
    区间内浮动管理费计提方式_区间内每日倒减计提(DictCode.区间内浮动管理费计提方式, "02", "区间内每日倒减计提"),
    区间内浮动管理费计提方式_区间结束日一次计提(DictCode.区间内浮动管理费计提方式, "01", "区间结束日一次计提"),
    /** 区间内浮动管理费计提方式 add by yanya on 20200114 end**/
    /**
     * 调整策略明细 add by gejiaao 20200109
     */
    调整策略_按比例分配(DictCode.调整策略, "01", "按比例分配"),
    调整策略_价格优先分配(DictCode.调整策略, "02", "价格优先分配"),
    /**
     *
     */
    行内资产五级分类_上市银行优先股(DictCode.行内资产五级分类, "142", "上市银行优先股"),
    增值税资产分类_场外期权(DictCode.增值税资产分类, "P01", "场外期权"),

    /**
     * 产品风险评级 add by shaohuchen 2020-01-20 start
     **/
    产品风险评级_谨慎型(DictCode.产品风险评级, "01", "PR1（谨慎型）"),
    产品风险评级_稳健型(DictCode.产品风险评级, "02", "PR2（稳健型）"),
    产品风险评级_平衡型(DictCode.产品风险评级, "03", "'PR3（平衡型）"),
    产品风险评级_进取型(DictCode.产品风险评级, "04", "'PR4（进取型）"),
    产品风险评级_激进型(DictCode.产品风险评级, "05", "PR4（激进型）"),
    /**产品风险评级 add by shaohuchen 2020-01-20 end**/
    /**
     * 债券借贷费用损益计入方式 add by yanya 2020-01-22 start
     **/
    债券借贷费用损益计入方式_计入投资收益(DictCode.债券借贷费用损益计入方式, "01", "计入投资收益"),
    债券借贷费用损益计入方式_计入费用支出(DictCode.债券借贷费用损益计入方式, "02", "计入费用支出"),
    /**债券借贷费用损益计入方式 add by yanya 2020-01-22 end**/

    /**
     * 费用交易管理 	20200205
     **/
    共通业务类型_费用交易管理(DictCode.共通业务类型, "FEETRADE", "费用交易管理"),

    计息基础_30U_360(DictCode.计息基础, "30U/360", "330/360 US"),

    处理状态_流程中(DictCode.处理状态, "03", "流程中"),

    名单主体明细类型_交易对手(DictCode.名单主体明细类型, "10", "交易对手"),
    /**
     * add by 谈旋 2020-03-05
     **/
    金融产品类型_券商集合计划(DictCode.金融产品类型, "F55", "券商集合计划"),
    /**
     * 账户性质
     */
    账户性质_银行账户(DictCode.账户性质, "01", "银行账户"),
    账户性质_非银行账户(DictCode.账户性质, "02", "非银行账户"),
    共通业务类型_产品信息管理(DictCode.共通业务类型, "V28", "产品信息管理"),
    共通业务类型_期权标的管理(DictCode.共通业务类型, "V29", "期权标的管理"),

    /**
     * 生僻字类型_全角半角
     */
    生僻字类型_全角半角(DictCode.生僻字类型, "01", "全角半角"),
    /**
     * 生僻字类型_生僻字
     */
    生僻字类型_生僻字(DictCode.生僻字类型, "02", "生僻字"),

    报送处理状态_警告(DictCode.报送处理状态, "05", "警告"),

    平安业务类型_期权买入(DictCode.平安业务类型, "145", "期权买入"),
    平安业务类型_期权卖出(DictCode.平安业务类型, "146", "期权卖出"),
    平安业务类型_期权放弃行权(DictCode.平安业务类型, "147", "期权-放弃行权"),
    平安业务类型_期权提前行权(DictCode.平安业务类型, "148", "期权-提前行权"),
    平安业务类型_期权到期行权(DictCode.平安业务类型, "149", "期权买-到期行权"),
    查询条件类型_主表(DictCode.查询条件类型, "02", "主表"),
    查询条件类型_子表(DictCode.查询条件类型, "01", "子表"),
    poi模板类型_EXCEL(DictCode.poi模板类型, "X", "excel"),
    poi模板类型_WORD(DictCode.poi模板类型, "W", "word"),
    poi表格类型_单表(DictCode.poi表格类型, "01", "单表"),
    poi表格类型_多列表(DictCode.poi表格类型, "02", "多列表"),
    poi表格类型_图表(DictCode.poi表格类型, "03", "图表"),
    poi表格样式_参考模板(DictCode.poi表格样式, "01", "参考模板"),
    poi表格样式_无(DictCode.poi表格样式, "99", "无"),
    poi图表类型_柱状图(DictCode.poi图表类型, "01", "柱状图"),
    poi图表类型_饼图(DictCode.poi图表类型, "02", "饼图"),
    poi图表类型_折线图(DictCode.poi图表类型, "03", "折线图"),
    poi表格宽度_窄边距(DictCode.poi表格宽度, "N", "窄边距"),
    poi表格宽度_适中边距(DictCode.poi表格宽度, "M", "适中边距"),
    poi表格宽度_宽边距(DictCode.poi表格宽度, "E", "宽边距"),
    poi关联类型_子表(DictCode.poi关联类型, "01", "子表"),
    poi关联类型_主表(DictCode.poi关联类型, "02", "主表"),
    共通业务类型_自定义参数管理(
            DictCode.共通业务类型, "RSK33", "自定义参数管理"
    ), 共通业务类型_固定值参数管理(
            DictCode.共通业务类型, "RSK28", "固定值参数管理"
    ),
    管理方式_发行登记_集合管理(DictCode.管理方式_发行登记, "01", "集合管理"),
    管理方式_发行登记_单独管理(DictCode.管理方式_发行登记, "02", "单独管理"),
    扣减对象_发行人(DictCode.扣减对象, "01", "发行人"),
    扣减对象_融资人(DictCode.扣减对象, "02", "融资人"),
    扣减对象_交易对手(DictCode.扣减对象, "03", "交易对手"),
    扣减对象_担保人(DictCode.扣减对象, "04", "担保人"),
    扣减对象_管理人(DictCode.扣减对象, "05", "管理人"),
    扣减对象_存放行(DictCode.扣减对象, "06", "存放行"),
    扣减对象_合作机构(DictCode.扣减对象, "09", "合作机构"),
    额度规则类型_资产大类(DictCode.额度规则类型, "01", "资产大类"),
    额度规则类型_单笔资产(DictCode.额度规则类型, "02", "单笔资产"),
    共通业务类型_单笔资产额度校验规则(DictCode.共通业务类型, "RSK45", "单笔资产额度校验规则"),
    共通业务类型_主体额度占用调整(DictCode.共通业务类型, "RSK46", "主体额度占用调整"),
    额度调整类型_额度扣减(DictCode.额度调整类型, "01", "额度扣减"),
    额度调整类型_额度释放(DictCode.额度调整类型, "02", "额度释放"),

    清算状态_待处理(DictCode.清算状态, "W", "待处理"),
    清算状态_清算中(DictCode.清算状态, "A", "清算中"),
    清算状态_清算成功(DictCode.清算状态, "S", "清算成功"),
    清算状态_清算失败(DictCode.清算状态, "F", "清算失败"),
    清算状态_清算异常(DictCode.清算状态, "Y", "清算异常"),
    清算状态_线下清算(DictCode.清算状态, "X", "线下清算"),

    /*add by lijie2 20200509*/
    金融产品其他代码类型_回售代码(DictCode.金融产品其他代码类型, "01", "回售代码"),
    金融产品其他代码类型_质押代码(DictCode.金融产品其他代码类型, "02", "质押代码"),
    金融产品其他代码类型_可转债信用申购代码(DictCode.金融产品其他代码类型, "03", "可转债信用申购代码"),
    金融产品其他代码类型_可转债转股代码(DictCode.金融产品其他代码类型, "04", "可转债转股代码"),
    金融产品其他代码类型_配债代码(DictCode.金融产品其他代码类型, "05", "配债代码"),
    金融产品其他代码类型_配股代码(DictCode.金融产品其他代码类型, "06", "配股代码"),
    金融产品其他代码类型_新股申购代码(DictCode.金融产品其他代码类型, "07", "新股申购代码"),

    共通业务类型_产品账户维护(DictCode.共通业务类型, "PTL17", "产品账户维护"),

    /*add by lijie2 20200511*/
    申报单位_手(DictCode.申报单位, "1", "手"),
    申报单位_张(DictCode.申报单位, "2", "张"),
    特殊处理业务_质押出入库(DictCode.特殊处理业务, "1", "质押出入库"),
    柜台接口类型_金证kcbp(DictCode.柜台接口类型, "1", "金证kcbp"),
    柜台接口类型_恒生ufx(DictCode.柜台接口类型, "2", "恒生ufx"),

    客户性质_券商(DictCode.客户性质, "10", "券商"),
    客户性质_期货公司(DictCode.客户性质, "11", "期货公司"),
    共通业务类型_席位信息管理(DictCode.共通业务类型, "MST26", "席位信息管理"),

    // add by wanshiwei 20200731
    共通业务类型_场内交易下单(DictCode.共通业务类型, "EXC01", "场内交易下单"),
    共通业务类型_场内交易撤销(DictCode.共通业务类型, "EXC02", "场内交易撤销"),

    申报类型_不指定(DictCode.申报类型, "PRM05", "不指定"),
    申报类型_意向申报(DictCode.申报类型, "PRM06", "意向申报"),
    申报类型_定价申报(DictCode.申报类型, "PRM07", "定价申报"),
    申报类型_点击成交申报(DictCode.申报类型, "PRM08", "点击成交申报"),
    申报类型_成交申报(DictCode.申报类型, "PRM09", "成交申报"),
    申报类型_收盘价固定价格申报(DictCode.申报类型, "PRM10", "收盘价固定价格申报"),
    申报类型_日均价固定价格申报(DictCode.申报类型, "PRM11", "日均价固定价格申报"),
    申报类型_最优价成交申报(DictCode.申报类型, "PRM12", "最优价成交申报"),
    申报类型_可转换成交申报(DictCode.申报类型, "PRM13", "可转换成交申报"),
    申报类型_指定对手方成交申报(DictCode.申报类型, "PRM14", "指定对手方成交申报"),

    投资指令类型_单组合单资产指令(DictCode.投资指令类型, "01", "单组合单资产指令"),
    投资指令类型_多组合单资产指令(DictCode.投资指令类型, "02", "多组合单资产指令"),
    目标类型_数量(DictCode.目标类型,"01","数量"),
    目标类型_金额(DictCode.目标类型,"02","金额"),
    ;

    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    DictCodeListExt3(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value    数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static DictCodeListExt3 from(DictCode dictCode, String value) {
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 转换成DICTCODELIST
     *
     * @param dictCodeListExt2
     * @return
     */
    public static Map<String, Object> fromDictCodeList(DictCodeListExt3 dictCodeListExt2) {
        Map<String, Object> retMap = new HashMap<String, Object>();
        retMap.put("codeName", dictCodeListExt2.codeName);
        retMap.put("value", dictCodeListExt2.value);
        retMap.put("dictCode", dictCodeListExt2.dictCode);
        return retMap;
    }

    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        } catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        } catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }

}
