package com.joyintech.tams.constant;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public enum DictCodeListTableId implements BaseDictCodeList {
    会计场景代码_汇兑损益结转(DictCode.会计场景代码,"2210","汇兑损益结转"),
    会计场景代码_质押式正回购_计提(DictCode.会计场景代码,"1405","质押式正回购-计提"),
    会计场景代码_质押式正回购_到期(DictCode.会计场景代码,"1406","质押式正回购-到期/提前终止"),
    会计场景代码_摊余成本类重分类为损益类(DictCode.会计场景代码,"1335","摊余成本类重分类为损益类"),
    会计场景代码_摊余成本类重分类为综合收益类(DictCode.会计场景代码,"1336","摊余成本类重分类为综合收益类"),
    会计场景代码_综合收益类重分类为摊余成本类(DictCode.会计场景代码,"1337","综合收益类重分类为摊余成本类"),
    会计场景代码_综合收益类重分类为损益类(DictCode.会计场景代码,"1338","综合收益类重分类为损益类"),
    会计场景代码_损益类重分类为摊余成本类(DictCode.会计场景代码,"1339","损益类重分类为摊余成本类"),
    会计场景代码_损益类重分类为综合收益类(DictCode.会计场景代码,"1340","损益类重分类为综合收益类"),
    会计场景代码_银证转账_银转证(DictCode.会计场景代码,"1001","银证转账-银转证"),
    会计场景代码_银证转账_证转银(DictCode.会计场景代码,"1002","银证转账-证转银"),
    会计场景代码_费用支付_交易场所费用支付(DictCode.会计场景代码,"1704","费用支付-交易场所费用支付"),
    会计场景代码_费用支付_其他费用支付_银行手续费(DictCode.会计场景代码,"1705","费用支付-其他费用支付-银行手续费"),
    会计场景代码_费用支付_其他费用支付_其他费用(DictCode.会计场景代码,"1706","费用支付-其他费用支付-其他费用"),
    会计场景代码_资金划款_债券类资产买入(DictCode.会计场景代码,"2701","资金划款-债券类资产买入"),
    会计场景代码_资金收款_债券类资产卖出(DictCode.会计场景代码,"2702","资金收款-债券类资产卖出"),
    会计场景代码_资金收款_摊余成本类债券收息(DictCode.会计场景代码,"2703","资金收款-摊余成本类债券收息"),
    会计场景代码_资金收款_摊余成本类债券还本(DictCode.会计场景代码,"2704","资金收款-摊余成本类债券还本"),
    会计场景代码_资金划款_计划类资产买入(DictCode.会计场景代码,"2705","资金划款-计划类资产买入"),
    会计场景代码_资金收款_计划类资产卖出(DictCode.会计场景代码,"2706","资金收款-计划类资产卖出"),
    会计场景代码_资金收款_公允价值损益类债券收息(DictCode.会计场景代码,"2707","资金收款-公允价值损益类债券收息"),
    会计场景代码_资金收款_公允价值综合收益类债券收息(DictCode.会计场景代码,"2708","资金收款-公允价值综合收益类债券收息"),
    会计场景代码_资金收款_收益型资产收息(DictCode.会计场景代码,"2709","资金收款-收益型资产收息"),
    会计场景代码_资金收款_公允价值损益类债券还本(DictCode.会计场景代码,"2710","资金收款-公允价值损益类债券还本"),
    会计场景代码_资金收款_综合收益类债券还本(DictCode.会计场景代码,"2711","资金收款-综合收益类债券还本"),
    会计场景代码_资金收款_收益型资产还本(DictCode.会计场景代码,"2715","资金收款-收益型资产还本"),
    会计场景代码_资金划款_质押式逆回购首期(DictCode.会计场景代码,"2716","资金划款-质押式逆回购首期"),
    会计场景代码_资金收款_质押式逆回购到期(DictCode.会计场景代码,"2717","资金收款-质押式逆回购到期"),
    会计场景代码_资金收款_质押式正回购首期(DictCode.会计场景代码,"2718","资金收款-质押式正回购首期"),
    会计场景代码_资金划款_质押式正回购到期(DictCode.会计场景代码,"2719","资金划款-质押式正回购到期"),
    会计场景代码_资金收款_质押式逆回购逾期返售(DictCode.会计场景代码,"2746","资金收款-质押式逆回购逾期返售"),
    会计场景代码_资金划款_质押式正回购逾期返售(DictCode.会计场景代码,"2747","资金划款-质押式正回购逾期返售"),
    会计场景代码_资金划款_买断式逆回购首期(DictCode.会计场景代码,"2720","资金划款-买断式逆回购首期"),
    会计场景代码_资金收款_买断式逆回购期间债券派息(DictCode.会计场景代码,"2721","资金收款-买断式逆回购期间债券派息"),
    会计场景代码_资金收款_买断式逆回购到期(DictCode.会计场景代码,"2722","资金收款-买断式逆回购到期"),
    会计场景代码_资金收款_买断式正回购首期(DictCode.会计场景代码,"2723","资金收款-买断式正回购首期"),
    会计场景代码_资金收款_买断式正回购到期(DictCode.会计场景代码,"2724","资金收款-买断式正回购到期"),
    会计场景代码_资金收款_同业借款还本到期(DictCode.会计场景代码,"2725","资金收款-同业借款还本到期"),
    会计场景代码_资金收款_同业借款中间收息(DictCode.会计场景代码,"2726","资金收款-同业借款中间收息"),
    会计场景代码_资金划款_收益型产品赎回到期(DictCode.会计场景代码,"8003","资金划款-收益型产品赎回到期"),
    会计场景代码_资金划款_收益型产品支付客户收益(DictCode.会计场景代码,"8006","资金划款-收益型产品支付客户收益"),
    会计场景代码_资金划款_净值型产品赎回到期(DictCode.会计场景代码,"8016","资金划款-净值型产品赎回到期"),
    会计场景代码_资金划款_货币型产品赎回到期(DictCode.会计场景代码,"8036","资金划款-货币型产品赎回到期"),
    会计场景代码_资金划款_股票买入(DictCode.会计场景代码, "2736", "资金划款-股票买入"),
    会计场景代码_资金收款_股票卖出(DictCode.会计场景代码, "2737", "资金收款-股票卖出"),
    会计场景代码_综合收益类债券_买入(DictCode.会计场景代码,"1320","综合收益类债券-买入"),
    会计场景代码_综合收益类债券_每日计提摊销(DictCode.会计场景代码,"1321","综合收益类债券-每日计提摊销"),
    会计场景代码_综合收益类债券_每日公允价值变动(DictCode.会计场景代码,"1322","综合收益类债券-每日公允价值变动"),
    会计场景代码_综合收益类债券_收息(DictCode.会计场景代码,"1324","综合收益类债券-收息"),
    会计场景代码_综合收益类债券_卖出(DictCode.会计场景代码,"1325","综合收益类债券-卖出"),
    会计场景代码_综合收益类债券_还本到期(DictCode.会计场景代码,"1326","综合收益类债券-还本到期"),
    会计场景代码_综合收益类债券_债券转托管(DictCode.会计场景代码,"1327","综合收益类债券-债券转托管"),
    会计场景代码_综合收益类债券_债转股(DictCode.会计场景代码,"1328","综合收益类债券-债转股"),
    会计场景代码_综合收益类债券_上市流通(DictCode.会计场景代码,"1334","综合收益类债券-上市流通"),
    会计场景代码_公允价值损益类债券_还本付息(DictCode.会计场景代码,"N9901","公允价值损益类债券-还本付息"),
    会计场景代码_摊余成本类_还本付息(DictCode.会计场景代码,"N9902","摊余成本类-还本付息"),
    会计场景代码_综合收益类债券_还本付息(DictCode.会计场景代码,"N9903","综合收益类债券-还本付息"),
    会计场景代码_摊余成本类_计划资产_还本付息(DictCode.会计场景代码,"N9904","摊余成本类-计划资产-还本付息"),
    会计场景代码_资金划款_存放同业起息(DictCode.会计场景代码,"2731","资金划款-存放同业起息"),
    会计场景代码_手工凭证(DictCode.会计场景代码,"0","手工凭证"),
    会计场景代码_资金收款_存放同业到期_卖出(DictCode.会计场景代码,"2732","资金收款-存放同业到期/卖出"),
    会计场景代码_资金收款_存放同业收息(DictCode.会计场景代码,"2733","资金收款-存放同业收息"),
    会计场景代码_资金收款_存放同业还本_到期(DictCode.会计场景代码,"2734","资金收款-存放同业还本/到期"),
    会计场景代码_债券借贷_融入债券卖出后购回(DictCode.会计场景代码,"2521","债券借贷-融入债券卖出后购回"),
    会计场景代码_债券借贷_融入到期_本方券交割(DictCode.会计场景代码,"2522","债券借贷-融入到期-本方券交割"),
    会计场景代码_债券借贷_融入券卖出后重估(DictCode.会计场景代码,"2516","债券借贷-融入券卖出后重估"),
    会计场景代码_产品_预期收益型_客户收益计提(DictCode.会计场景代码,"8004","产品(预期收益型)-客户收益计提"),
    会计场景代码_存放同业_还本_到期(DictCode.会计场景代码,"1110","存放同业-还本/到期"),
    会计场景代码_资金划款_同业借款买入(DictCode.会计场景代码,"2727","资金划款-同业借款买入"),
    会计场景代码_资金收款_同业借款卖出(DictCode.会计场景代码,"2728","资金收款-同业借款卖出"),
    会计场景代码_资金收款_拆入起息(DictCode.会计场景代码,"2729","资金收款-拆入起息"),
    会计场景代码_资金划款_拆入到期(DictCode.会计场景代码,"2730","资金划款-拆入到期"),
    会计场景代码_逾期款转出(DictCode.会计场景代码,"2903","逾期款转出"),
    会计场景代码_增值税估计_直投_利息收入(DictCode.会计场景代码,"2601","增值税估计-直投-利息收入"),
    会计场景代码_增值税估计_通道_利息收入(DictCode.会计场景代码,"2602","增值税估计-通道-利息收入"),
    会计场景代码_增值税估计_直投_红利收入(DictCode.会计场景代码,"2603","增值税估计-直投-红利收入"),
    会计场景代码_增值税估计_通道_红利收入(DictCode.会计场景代码,"2604","增值税估计-通道-红利收入"),
    会计场景代码_增值税估计_直投_公允价值变动损益(DictCode.会计场景代码,"2605","增值税估计-直投-公允价值变动损益"),
    会计场景代码_增值税估计_通道_公允价值变动损益(DictCode.会计场景代码,"2606","增值税估计-通道-公允价值变动损益"),
    会计场景代码_增值税确认_直投_确认利息收入税(DictCode.会计场景代码,"2607","增值税确认-直投-确认利息收入税"),
    会计场景代码_增值税确认_通道_确认利息收入税(DictCode.会计场景代码,"2608","增值税确认-通道-确认利息收入税"),
    会计场景代码_增值税确认_直投_确认价差收入税(DictCode.会计场景代码,"2609","增值税确认-直投-确认价差收入税"),
    会计场景代码_增值税确认_通道_确认价差收入税(DictCode.会计场景代码,"2610","增值税确认-通道-确认价差收入税"),
    会计场景代码_增值税确认_直投_确认红利入税(DictCode.会计场景代码,"2611","增值税确认-直投-确认红利入税"),
    会计场景代码_增值税确认_通道_确认红利入税(DictCode.会计场景代码,"2612","增值税确认-通道-确认红利入税"),
    会计场景代码_增值税估计_直投_附加税(DictCode.会计场景代码,"2613","增值税估计-直投-附加税"),
    会计场景代码_增值税确认_直投_确认增值税附加(DictCode.会计场景代码,"2614","增值税确认-直投-确认增值税附加"),
    会计场景代码_增值税估计_通道_附加税(DictCode.会计场景代码,"2622","增值税估计-通道-附加税"),
    会计场景代码_增值税确认_通道_确认增值税附加(DictCode.会计场景代码,"2623","增值税确认-通道-确认增值税附加"),
    会计场景代码_增值税缴纳_直投_交税处理(DictCode.会计场景代码,"2615","增值税缴纳-直投-交税处理"),
    会计场景代码_增值税缴纳_直投_退税处理(DictCode.会计场景代码,"2616","增值税缴纳-直投-退税处理"),
    会计场景代码_增值税缴纳_通道_交税处理(DictCode.会计场景代码,"2624","增值税缴纳-通道-交税处理"),
    会计场景代码_增值税缴纳_通道_退税处理(DictCode.会计场景代码,"2625","增值税缴纳-通道-退税处理"),
    会计场景代码_增值税计提_直投_应交利息收入税(DictCode.会计场景代码,"2618","增值税计提-直投-应交利息收入税"),
    会计场景代码_增值税计提_通道_应交利息收入税(DictCode.会计场景代码,"2619","增值税计提-通道-应交利息收入税"),
    会计场景代码_增值税计提_直投_应交红利收入税(DictCode.会计场景代码,"2620","增值税计提-直投-应交红利收入税"),
    会计场景代码_增值税计提_通道_应交红利收入税(DictCode.会计场景代码,"2621","增值税计提-通道-应交红利收入税"),
    会计场景代码_债券借贷_借出(DictCode.会计场景代码,"2501","债券借贷-借出"),
    会计场景代码_债券借贷_借出费计提(DictCode.会计场景代码,"2502","债券借贷-借出费计提"),
    会计场景代码_债券借贷_借出期间收息还本(DictCode.会计场景代码,"2503","债券借贷-借出期间收息还本"),
    会计场景代码_债券借贷_借出到期_收取费用(DictCode.会计场景代码,"2504","债券借贷-借出到期-收取费用"),
    会计场景代码_债券借贷_借出到期_现金交割_债券过户(DictCode.会计场景代码,"2506","债券借贷-借出到期-现金交割-债券过户"),
    会计场景代码_债券借贷_借出到期_非现金交割_还券(DictCode.会计场景代码,"2507","债券借贷-借出到期-非现金交割-还券"),
    会计场景代码_债券借贷_借入(DictCode.会计场景代码,"2508","债券借贷-借入"),
    会计场景代码_债券借贷_借入费计提(DictCode.会计场景代码,"2509","债券借贷-借入费计提"),
    会计场景代码_债券借贷_借入期间标的债券收息(DictCode.会计场景代码,"2510","债券借贷-借入期间标的债券收息"),
    会计场景代码_债券借贷_借入期间标的债券付息(DictCode.会计场景代码,"2511","债券借贷-借入期间标的债券付息"),
    会计场景代码_债券借贷_借入到期_支付费用(DictCode.会计场景代码,"2512","债券借贷-借入到期-支付费用"),
    会计场景代码_债券借贷_借入到期_非现金交割_还券(DictCode.会计场景代码,"2513","债券借贷-借入到期-非现金交割-还券"),
    会计场景代码_债券借贷_借入债券卖出(DictCode.会计场景代码,"2514","债券借贷-借入债券卖出"),
    会计场景代码_债券借贷_借入债券利息计提(DictCode.会计场景代码,"2515","债券借贷-借入债券利息计提"),
    会计场景代码_债券借贷_融入债券卖出后收息(DictCode.会计场景代码,"2517","债券借贷-融入债券卖出后收息"),
    会计场景代码_债券借贷_融入期间标的债券还本(DictCode.会计场景代码,"2518","债券借贷-融入期间标的债券还本"),
    会计场景代码_债券借贷_融入债券卖出后还本(DictCode.会计场景代码,"2519","债券借贷-融入债券卖出后还本"),
    会计场景代码_债券借贷_融入期间标的券本金支付(DictCode.会计场景代码,"2520","债券借贷-融入期间标的券本金支付"),
    会计场景代码_中签交易_信用中签(DictCode.会计场景代码,"1330","中签交易(信用中签)"),
    会计场景代码_承销商买入(DictCode.会计场景代码,"1331","承销商买入"),
    会计场景代码_质押式逆回购_起息(DictCode.会计场景代码,"1401","质押式逆回购-起息"),
    会计场景代码_质押式逆回购_计提(DictCode.会计场景代码,"1402","质押式逆回购-计提"),
    会计场景代码_质押式逆回购_到期(DictCode.会计场景代码,"1403","质押式逆回购-到期/提前终止"),
    会计场景代码_质押式正回购_起息(DictCode.会计场景代码,"1404","质押式正回购-起息"),
    会计场景代码_质押式逆回购_逾期返售(DictCode.会计场景代码,"1421","质押式逆回购-逾期返售"),
    会计场景代码_质押式正回购_逾期返售(DictCode.会计场景代码,"1422","质押式正回购-逾期返售"),
    会计场景代码_产品_分层核算权益拆分(DictCode.会计场景代码,"8038","产品-分层核算权益拆分"),
    会计场景代码_产品_浮动管理费分配(DictCode.会计场景代码,"8039","产品-浮动管理费分配"),
    会计场景代码_其他应收应付平账(DictCode.会计场景代码,"9901","其他应收应付平账"),
    会计场景代码_拆入_起息(DictCode.会计场景代码,"1201","拆入-起息"),
    会计场景代码_拆入_利息计提(DictCode.会计场景代码,"1202","拆入-利息计提"),
    会计场景代码_拆入_到期(DictCode.会计场景代码,"1203","拆入-到期"),
    会计场景代码_拆放同业_起息_转仓买入(DictCode.会计场景代码,"1105","拆放同业-起息/转仓买入"),
    会计场景代码_拆放同业_计提(DictCode.会计场景代码,"1106","拆放同业-计提"),
    会计场景代码_拆放同业_到期(DictCode.会计场景代码,"1107","拆放同业-到期"),
    会计场景代码_拆放同业_中间收息(DictCode.会计场景代码,"1108","拆放同业-中间收息"),
    会计场景代码_拆放同业_转仓卖出(DictCode.会计场景代码,"1109","拆放同业-转仓卖出"),
    会计场景代码_产品_货币型_认购申购交易(DictCode.会计场景代码,"8031","产品(货币型)-认购申购交易"),
    会计场景代码_产品_货币型_应付利润结转(DictCode.会计场景代码,"8032","产品(货币型)-应付利润结转"),
    会计场景代码_产品_货币型_现金分红(DictCode.会计场景代码,"8033","产品(货币型)-现金分红"),
    会计场景代码_产品_货币型_红利再投(DictCode.会计场景代码,"8034","产品(货币型)-红利再投"),
    会计场景代码_产品_货币型_赎回交易(DictCode.会计场景代码,"8035","产品(货币型)-赎回交易"),
    会计场景代码_产品_货币型_到期分红(DictCode.会计场景代码,"8037","产品(货币型)-到期分红"),
    会计场景代码_产品_净值型_认购申购交易(DictCode.会计场景代码,"8011","产品(净值型)-认购申购交易"),
    会计场景代码_产品_净值型_分红除权处理(DictCode.会计场景代码,"8012","产品(净值型)-分红除权处理"),
    会计场景代码_产品_净值型_现金分红(DictCode.会计场景代码,"8013","产品(净值型)-现金分红"),
    会计场景代码_产品_净值型_红利再投(DictCode.会计场景代码,"8014","产品(净值型)-红利再投"),
    会计场景代码_产品_净值型_赎回到期(DictCode.会计场景代码,"8015","产品(净值型)-赎回到期"),
    会计场景代码_产品_预期收益型_认购申购(DictCode.会计场景代码,"8001","产品(预期收益型)-认购申购"),
    会计场景代码_产品_预期收益型_赎回到期(DictCode.会计场景代码,"8002","产品(预期收益型)-赎回到期"),
    会计场景代码_产品_预期收益型_兑付客户收益(DictCode.会计场景代码,"8005","产品(预期收益型)-兑付客户收益"),
    会计场景代码_产品_销售服务费计提(DictCode.会计场景代码,"8101","产品-销售服务费计提"),
    会计场景代码_产品_销售服务费支付(DictCode.会计场景代码,"8102","产品-销售服务费支付"),
    会计场景代码_产品_固定资产管理费计提(DictCode.会计场景代码,"8103","产品-固定资产管理费计提"),
    会计场景代码_产品_固定资产管理费支付(DictCode.会计场景代码,"8104","产品-固定资产管理费支付"),
    会计场景代码_产品_浮动管理费计提(DictCode.会计场景代码,"8105","产品-浮动管理费计提"),
    会计场景代码_产品_浮动管理费支付(DictCode.会计场景代码,"8106","产品-浮动管理费支付"),
    会计场景代码_产品_托管费计提(DictCode.会计场景代码,"8107","产品-托管费计提"),
    会计场景代码_产品_托管费支付(DictCode.会计场景代码,"8108","产品-托管费支付"),
    会计场景代码_产品_管理费贴补(DictCode.会计场景代码,"8109","产品-管理费贴补"),
    会计场景代码_产品_代销费计提(DictCode.会计场景代码,"8110","产品-代销费计提"),
    会计场景代码_产品_代销费支付(DictCode.会计场景代码,"8111","产品-代销费支付"),
    会计场景代码_产品_外包服务费计提(DictCode.会计场景代码,"8112","产品-外包服务费计提"),
    会计场景代码_产品_外包服务费支付(DictCode.会计场景代码,"8113","产品-外包服务费支付"),
    会计场景代码_产品_其他费用计提(DictCode.会计场景代码,"8114","产品-其他费用计提"),
    会计场景代码_产品_其他费用支付(DictCode.会计场景代码,"8115","产品-其他费用支付"),
    会计场景代码_产品_投资顾问费计提(DictCode.会计场景代码,"8119","产品-投资顾问费计提"),
    会计场景代码_产品_投资顾问费支付(DictCode.会计场景代码,"8120","产品-投资顾问费支付"),
    会计场景代码_产品_已实现损益结转(DictCode.会计场景代码,"8019","产品-已实现损益结转"),
    会计场景代码_公允价值损益类债券_行权回售(DictCode.会计场景代码,"1350","公允价值损益类债券-行权回售"),
    会计场景代码_公允价值损益类债券_行权赎回(DictCode.会计场景代码,"1351","公允价值损益类债券-行权赎回"),
    会计场景代码_摊余成本类债券_行权回售(DictCode.会计场景代码,"1352","摊余成本类债券-行权回售"),
    会计场景代码_摊余成本类债券_行权赎回(DictCode.会计场景代码,"1353","摊余成本类债券-行权赎回"),
    会计场景代码_综合收益类债券_行权回售(DictCode.会计场景代码,"1354","综合收益类债券-行权回售"),
    会计场景代码_综合收益类债券_行权赎回(DictCode.会计场景代码,"1355","综合收益类债券-行权赎回"),
    会计场景代码_交易费用转仓转出(DictCode.会计场景代码,"3004","交易费用转仓转出"),
    会计场景代码_债券转托管费用支付(DictCode.会计场景代码,"3003","债券转托管费用支付"),
    会计场景代码_外汇损益换汇处理(DictCode.会计场景代码,"2101","外汇损益换汇处理"),
    会计场景代码_外汇掉期_交易日表外登记(DictCode.会计场景代码,"2201","外汇掉期-交易日表外登记"),
    会计场景代码_外汇掉期_每日公允价值变动(DictCode.会计场景代码,"2202","外汇掉期-每日公允价值变动"),
    会计场景代码_外汇掉期_近端交割日资金清算(DictCode.会计场景代码,"2204","外汇掉期-近端交割日资金清算"),
    会计场景代码_外汇掉期_日终汇兑损益确认(DictCode.会计场景代码,"2205","外汇掉期-日终汇兑损益确认"),
    会计场景代码_外汇掉期_远端交割日资金清算(DictCode.会计场景代码,"2206","外汇掉期-远端交割日资金清算"),
    会计场景代码_外汇掉期_远端交割日确认价差收入(DictCode.会计场景代码,"2207","外汇掉期-远端交割日确认价差收入"),
    会计场景代码_外汇掉期_远端交割日结转公允价值变动(DictCode.会计场景代码,"2208","外汇掉期-远端交割日结转公允价值变动"),
    会计场景代码_外汇即期_每日公允价值变动 (DictCode.会计场景代码,"1901","外汇即期-每日公允价值变动 "),
    会计场景代码_外汇即期_交割日资金清算(DictCode.会计场景代码,"1902","外汇即期-交割日资金清算"),
    会计场景代码_外汇即期_交割日结转公允价值变动(DictCode.会计场景代码,"1903","外汇即期-交割日结转公允价值变动"),
    会计场景代码_外汇即期_日终汇兑损益确认(DictCode.会计场景代码,"1904","外汇即期-日终汇兑损益确认"),
    会计场景代码_外汇即期_交易日表外登记(DictCode.会计场景代码,"1905","外汇即期-交易日表外登记"),
    会计场景代码_外汇远期_交易日表外登记(DictCode.会计场景代码,"1906","外汇远期-交易日表外登记"),
    会计场景代码_外汇远期_每日公允价值变动(DictCode.会计场景代码,"2001","外汇远期-每日公允价值变动"),
    会计场景代码_外汇远期_交割日资金清算(DictCode.会计场景代码,"2003","外汇远期-交割日资金清算"),
    会计场景代码_外汇远期_交割日结转公允价值变动(DictCode.会计场景代码,"2004","外汇远期-交割日结转公允价值变动"),
    会计场景代码_外汇远期_日终汇兑损益确认(DictCode.会计场景代码,"2005","外汇远期-日终汇兑损益确认"),
    会计场景代码_应收款项转逾期(DictCode.会计场景代码,"2801","应收款项转逾期"),
    会计场景代码_应收款项转仓转入(DictCode.会计场景代码,"2802","应收款项转仓转入"),
    会计场景代码_应收款项转仓转出(DictCode.会计场景代码,"2803","应收款项转仓转出"),
    会计场景代码_逾期款收款(DictCode.会计场景代码,"2901","逾期款收款"),
    会计场景代码_逾期款转入(DictCode.会计场景代码,"2902","逾期款转入"),
    会计场景代码_公允价值损益类债券_卖出(DictCode.会计场景代码,"1308","公允价值损益类债券-卖出"),
    会计场景代码_公允价值损益类债券_还本到期(DictCode.会计场景代码,"1309","公允价值损益类债券-还本到期"),
    会计场景代码_公允价值损益类债券_债券转托管(DictCode.会计场景代码,"1310","公允价值损益类债券-债券转托管"),
    会计场景代码_公允价值损益类债券_债转股(DictCode.会计场景代码,"1311","公允价值损益类债券-债转股"),
    会计场景代码_公允价值损益类债券_上市流通(DictCode.会计场景代码,"1332","公允价值损益类债券-上市流通"),
    会计场景代码_股票投资_买入(DictCode.会计场景代码,"2401","股票投资-买入"),
    会计场景代码_股票投资_红利计提(DictCode.会计场景代码,"2402","股票投资-红利计提"),
    会计场景代码_股票投资_每日公允价值变动(DictCode.会计场景代码,"2403","股票投资-每日公允价值变动"),
    会计场景代码_股票投资_收息(DictCode.会计场景代码,"2405","股票投资-收息"),
    会计场景代码_股票投资_卖出(DictCode.会计场景代码,"2406","股票投资-卖出"),
    会计场景代码_活期存款利息_转仓买入(DictCode.会计场景代码,"1003","活期存款利息-转仓买入"),
    会计场景代码_活期存款利息_计提(DictCode.会计场景代码,"1004","活期存款利息-计提"),
    会计场景代码_活期存款利息_结息(DictCode.会计场景代码,"1005","活期存款利息-结息"),
    会计场景代码_活期存款利息_转仓卖出(DictCode.会计场景代码,"1006","活期存款利息-转仓卖出"),
    会计场景代码_活期存款利息_券商保证金账户收息(DictCode.会计场景代码,"2301","活期存款利息-券商保证金账户收息"),
    会计场景代码_活期存款利息_DVP账户收息(DictCode.会计场景代码,"2302","活期存款利息-DVP账户收息"),
    会计场景代码_货币基金及货币型资产_认购申请(DictCode.会计场景代码,"1601","货币基金及货币型资产-认购申请"),
    会计场景代码_货币基金及货币型资产_认购确认(DictCode.会计场景代码,"1602","货币基金及货币型资产-认购确认"),
    会计场景代码_货币基金及货币型资产_认购返款(DictCode.会计场景代码,"1603","货币基金及货币型资产-认购返款"),
    会计场景代码_产品_本期利润已实现结转(DictCode.会计场景代码,"8020","产品-本期利润已实现结转"),
    会计场景代码_产品_未实现损益结转(DictCode.会计场景代码,"8021","产品-未实现损益结转"),
    会计场景代码_产品_未分配利润结转(DictCode.会计场景代码,"8022","产品-未分配利润结转"),
    会计场景代码_产品_损益平准金结转(DictCode.会计场景代码,"8023","产品-损益平准金结转"),
    会计场景代码_产品_本期利润未实现结转(DictCode.会计场景代码,"8024","产品-本期利润未实现结转"),
    会计场景代码_存放同业_起息或买入(DictCode.会计场景代码,"1101","存放同业-起息或买入"),
    会计场景代码_存放同业_利息计提(DictCode.会计场景代码,"1102","存放同业-利息计提"),
    会计场景代码_存放同业_收息(DictCode.会计场景代码,"1103","存放同业-收息"),
    会计场景代码_存放同业_到期或卖出(DictCode.会计场景代码,"1104","存放同业-到期或卖出"),
    会计场景代码_非货币基金及净值型资产_认购申请(DictCode.会计场景代码,"1621","非货币基金及净值型资产-认购申请"),
    会计场景代码_非货币基金及净值型资产_认购确认(DictCode.会计场景代码,"1622","非货币基金及净值型资产-认购确认"),
    会计场景代码_非货币基金及净值型资产_认购返款(DictCode.会计场景代码,"1623","非货币基金及净值型资产-认购返款"),
    会计场景代码_非货币基金及净值型资产_认购返款利息确认(DictCode.会计场景代码,"1624","非货币基金及净值型资产-认购返款利息确认"),
    会计场景代码_非货币基金及净值型资产_申购划款(DictCode.会计场景代码,"1625","非货币基金及净值型资产-申购划款"),
    会计场景代码_非货币基金及净值型资产_申购确认(DictCode.会计场景代码,"1626","非货币基金及净值型资产-申购确认"),
    会计场景代码_非货币基金及净值型资产_申购返款(DictCode.会计场景代码,"1627","非货币基金及净值型资产-申购返款"),
    会计场景代码_非货币基金及净值型资产_转仓买入(DictCode.会计场景代码,"1628","非货币基金及净值型资产-转仓买入"),
    会计场景代码_非货币基金及净值型资产_公允价值变动(DictCode.会计场景代码,"1629","非货币基金及净值型资产-公允价值变动"),
    会计场景代码_非货币基金及净值型资产_分红除权(DictCode.会计场景代码,"1631","非货币基金及净值型资产-分红除权"),
    会计场景代码_非货币基金及净值型资产_现金分红(DictCode.会计场景代码,"1632","非货币基金及净值型资产-现金分红"),
    会计场景代码_非货币基金及净值型资产_红利再投(DictCode.会计场景代码,"1633","非货币基金及净值型资产-红利再投"),
    会计场景代码_非货币基金及净值型资产_赎回确认(DictCode.会计场景代码,"1634","非货币基金及净值型资产-赎回确认"),
    会计场景代码_非货币基金及净值型资产_赎回到账(DictCode.会计场景代码,"1635","非货币基金及净值型资产-赎回到账"),
    会计场景代码_非货币基金及净值型资产_份额调增(DictCode.会计场景代码,"1636","非货币基金及净值型资产-份额调增"),
    会计场景代码_非货币基金及净值型资产_份额调减(DictCode.会计场景代码,"1637","非货币基金及净值型资产-份额调减"),
    会计场景代码_非货币基金及净值型资产_转仓卖出(DictCode.会计场景代码,"1638","非货币基金及净值型资产-转仓卖出"),
    会计场景代码_非货币基金及净值型资产_转换入确认交易(DictCode.会计场景代码,"1639","非货币基金及净值型资产-转换入确认交易"),
    会计场景代码_非货币基金及净值型资产_转换出确认交易(DictCode.会计场景代码,"1640","非货币基金及净值型资产-转换出确认交易"),
    会计场景代码_非货币基金及净值型资产_转托管交易(DictCode.会计场景代码,"1641","非货币基金及净值型资产-转托管交易"),
    会计场景代码_非货币基金及净值型资产_拆分交易(DictCode.会计场景代码,"1642","非货币基金及净值型资产-拆分交易"),
    会计场景代码_非货币基金及净值型资产_基金合并(DictCode.会计场景代码,"1643","非货币基金及净值型资产-基金合并"),
    会计场景代码_非货币基金_场内申购确认(DictCode.会计场景代码,"1645","非货币基金-场内申购确认"),
    会计场景代码_非货币基金_场内赎回确认(DictCode.会计场景代码,"1646","非货币基金-场内赎回确认"),
    会计场景代码_公允价值损益类货币型资产_申购划款(DictCode.会计场景代码,"1519","公允价值损益类货币型资产-申购划款"),
    会计场景代码_公允价值损益类货币型资产_申购确认(DictCode.会计场景代码,"1520","公允价值损益类货币型资产-申购确认"),
    会计场景代码_公允价值损益类货币型资产_转仓买入(DictCode.会计场景代码,"1521","公允价值损益类货币型资产-转仓买入"),
    会计场景代码_公允价值损益类货币型资产_每日计提红利(DictCode.会计场景代码,"1522","公允价值损益类货币型资产-每日计提红利"),
    会计场景代码_公允价值损益类货币型资产_分红除权(DictCode.会计场景代码,"1523","公允价值损益类货币型资产-分红除权"),
    会计场景代码_公允价值损益类货币型资产_红利发放(DictCode.会计场景代码,"1524","公允价值损益类货币型资产-红利发放"),
    会计场景代码_公允价值损益类货币型资产_红利再投(DictCode.会计场景代码,"1525","公允价值损益类货币型资产-红利再投"),
    会计场景代码_公允价值损益类货币型资产_赎回到期(DictCode.会计场景代码,"1526","公允价值损益类货币型资产-赎回/到期"),
    会计场景代码_公允价值损益类货币型资产_到期赎回到账(DictCode.会计场景代码,"1527","公允价值损益类货币型资产-到期/赎回到账"),
    会计场景代码_公允价值损益类货币型资产_卖出转仓(DictCode.会计场景代码,"1528","公允价值损益类货币型资产-卖出转仓"),
    会计场景代码_公允价值损益类净值型资产_申购划款(DictCode.会计场景代码,"1508","公允价值损益类净值型资产-申购划款"),
    会计场景代码_公允价值损益类净值型资产_申购确认(DictCode.会计场景代码,"1509","公允价值损益类净值型资产-申购确认"),
    /**modify by wujie on 202010105 start remark:计划类收益型资产改造
	    会计场景代码_公允价值损益类净值型资产_买入(DictCode.会计场景代码,"1510","公允价值损益类净值型资产-买入"),
	    会计场景代码_公允价值损益类净值型资产_每日公允价值变动(DictCode.会计场景代码,"1511","公允价值损益类净值型资产-每日公允价值变动"),
	    会计场景代码_公允价值损益类净值型资产_分红除权(DictCode.会计场景代码,"1513","公允价值损益类净值型资产-分红除权"),
	    会计场景代码_公允价值损益类净值型资产_分红到账(DictCode.会计场景代码,"1514","公允价值损益类净值型资产-分红到账"),
	    会计场景代码_公允价值损益类净值型资产_红利再投(DictCode.会计场景代码,"1515","公允价值损益类净值型资产-红利再投"),
    **/
    会计场景代码_公允价值变动类收益型资产_买入(DictCode.会计场景代码,"1510","公允价值变动类收益型资产-买入"),
    会计场景代码_公允价值变动类收益型资产_利息计提(DictCode.会计场景代码,"1511","公允价值变动类收益型资产-利息计提"),
    会计场景代码_公允价值变动类收益型资产_收息(DictCode.会计场景代码,"1512","公允价值变动类收益型资产-收息"),
    会计场景代码_公允价值变动类收益型资产_还本到期(DictCode.会计场景代码,"1513","公允价值变动类收益型资产-还本到期"),
    会计场景代码_公允价值变动类收益型资产_卖出(DictCode.会计场景代码,"1514","公允价值变动类收益型资产-卖出"),
    会计场景代码_公允价值变动类收益型资产_公允价值变动(DictCode.会计场景代码,"1515","公允价值变动类收益型资产-公允价值变动"),
    会计场景代码_资金收款_公允价值变动类收益型资产_收息到账(DictCode.会计场景代码,"2712","资金收款-公允价值变动类计划类资产收息"),
    会计场景代码_资金收款_公允价值变动类收益型资产_还本到账(DictCode.会计场景代码,"2738","资金收款-公允价值变动类计划类资产还本"),
    /**modify by wujie on 20201015 end**/

    会计场景代码_公允价值损益类净值型资产_赎回(DictCode.会计场景代码,"1516","公允价值损益类净值型资产-赎回"),
    会计场景代码_公允价值损益类净值型资产_赎回到账日(DictCode.会计场景代码,"1517","公允价值损益类净值型资产-赎回到账日"),
    会计场景代码_公允价值损益类净值型资产_卖出到期(DictCode.会计场景代码,"1518","公允价值损益类净值型资产-卖出到期"),
    会计场景代码_公允价值损益类债券_买入(DictCode.会计场景代码,"1301","公允价值损益类债券-买入"),
    会计场景代码_公允价值损益类债券_每日计提(DictCode.会计场景代码,"1303","公允价值损益类债券-每日计提"),
    会计场景代码_公允价值损益类债券_每日公允价值变动(DictCode.会计场景代码,"1304","公允价值损益类债券-每日公允价值变动"),
    会计场景代码_公允价值损益类债券_收息(DictCode.会计场景代码,"1306","公允价值损益类债券-收息"),
    会计场景代码_货币基金及货币型资产_申购(DictCode.会计场景代码,"1604","货币基金及货币型资产-申购"),
    会计场景代码_货币基金及货币型资产_申购确认(DictCode.会计场景代码,"1605","货币基金及货币型资产-申购确认"),
    会计场景代码_货币基金及货币型资产_转仓买入(DictCode.会计场景代码,"1606","货币基金及货币型资产-转仓买入"),
    会计场景代码_货币基金及货币型资产_每日红利计提(DictCode.会计场景代码,"1607","货币基金及货币型资产-每日红利计提"),
    会计场景代码_货币基金及货币型资产_现金分红(DictCode.会计场景代码,"1608","货币基金及货币型资产-现金分红"),
    会计场景代码_货币基金及货币型资产_红利再投(DictCode.会计场景代码,"1609","货币基金及货币型资产-红利再投"),
    会计场景代码_货币基金及货币型资产_赎回确认(DictCode.会计场景代码,"1610","货币基金及货币型资产-赎回确认"),
    会计场景代码_货币基金及货币型资产_赎回到账(DictCode.会计场景代码,"1611","货币基金及货币型资产-赎回到账"),
    会计场景代码_货币基金及货币型资产_转仓卖出(DictCode.会计场景代码,"1612","货币基金及货币型资产-转仓卖出"),
    会计场景代码_货币基金及货币型资产_申购返款(DictCode.会计场景代码,"1613","货币基金及货币型资产-申购返款"),
    会计场景代码_货币基金及货币型资产_份额调增(DictCode.会计场景代码,"1614","货币基金及货币型资产-份额调增"),
    会计场景代码_货币基金及货币型资产_份额调减(DictCode.会计场景代码,"1615","货币基金及货币型资产-份额调减"),
    会计场景代码_货币基金及货币型资产_返款利息确认(DictCode.会计场景代码,"1616","货币基金及货币型资产-返款利息确认"),
    会计场景代码_货币基金及货币型资产_基金转换入确认交易(DictCode.会计场景代码,"1617","货币基金及货币型资产-基金转换入确认交易"),
    会计场景代码_货币基金及货币型资产_基金转换出确认交易(DictCode.会计场景代码,"1618","货币基金及货币型资产-基金转换出确认交易"),
    会计场景代码_货币基金及货币型资产_基金拆分(DictCode.会计场景代码,"1619","货币基金及货币型资产-基金拆分"),
    会计场景代码_货币基金及货币型资产_基金合并(DictCode.会计场景代码,"1620","货币基金及货币型资产-基金合并"),
    会计场景代码_货币基金_场内申购(DictCode.会计场景代码,"1660","货币基金-场内申购"),
    会计场景代码_货币基金_场内申购确认(DictCode.会计场景代码,"1661","货币基金-场内申购确认"),
    会计场景代码_货币基金_场内赎回确认(DictCode.会计场景代码,"1662","货币基金-场内赎回确认"),
    会计场景代码_货币基金_场内赎回到账(DictCode.会计场景代码,"1663","货币基金_场内赎回到账"),
    会计场景代码_货币基金_买入_转仓买入划款(DictCode.会计场景代码,"1665","货币基金_买入/转仓买入划款"),
    会计场景代码_货币基金_公允价值变动(DictCode.会计场景代码,"1664","货币基金-公允价值变动"),
    会计场景代码_货币基金_卖出_转仓卖出到账(DictCode.会计场景代码,"1666","货币基金_卖出/转仓卖出到账"),
    会计场景代码_利率互换_交易日表外登记(DictCode.会计场景代码,"1801","利率互换-交易日表外登记"),
    会计场景代码_利率互换_每日公允价值变动(DictCode.会计场景代码,"1802","利率互换-每日公允价值变动"),
    会计场景代码_利率互换_期间收取利息(DictCode.会计场景代码,"1803","利率互换-期间收取利息"),
    会计场景代码_利率互换_期间支付利息(DictCode.会计场景代码,"1804","利率互换-期间支付利息"),
    会计场景代码_利率互换_首期交易(DictCode.会计场景代码,"1805","利率互换-终止到期收取利息"),
    会计场景代码_利率互换_终止到期支付利息(DictCode.会计场景代码,"1806","利率互换-终止到期支付利息"),
    会计场景代码_利率互换_收入端利息计提(DictCode.会计场景代码,"1809","利率互换-收入端利息计提"),
    会计场景代码_利率互换_支出端利息计提(DictCode.会计场景代码,"1810","利率互换-支出端利息计提"),
    会计场景代码_买断式逆回购_起息(DictCode.会计场景代码,"1407","买断式逆回购-起息"),
    会计场景代码_买断式逆回购_利息计提(DictCode.会计场景代码,"1408","买断式逆回购-利息计提"),
    会计场景代码_买断式逆回购_到期(DictCode.会计场景代码,"1409","买断式逆回购-到期"),
    会计场景代码_买断式逆回购_期间债券还本派息(DictCode.会计场景代码,"1413","买断式逆回购-期间债券还本派息"),
    会计场景代码_买断式正回购_起息(DictCode.会计场景代码,"1410","买断式正回购-起息"),
    会计场景代码_买断式正回购_利息计提(DictCode.会计场景代码,"1411","买断式正回购-利息计提"),
    会计场景代码_买断式正回购_到期(DictCode.会计场景代码,"1412","买断式正回购-到期"),
    会计场景代码_买断式正回购_期间债券还本派息(DictCode.会计场景代码,"1414","买断式正回购-期间债券还本派息"),
    会计场景代码_收益型资产_买入(DictCode.会计场景代码,"1501","收益型资产-买入"),
    会计场景代码_收益型资产_利息计提(DictCode.会计场景代码,"1502","收益型资产-利息计提"),
    会计场景代码_收益型资产_收息(DictCode.会计场景代码,"1503","收益型资产-收息"),
    会计场景代码_收益型资产_还本到期(DictCode.会计场景代码,"1504","收益型资产-还本到期"),
    会计场景代码_收益型资产_卖出(DictCode.会计场景代码,"1507","收益型资产-卖出"),
    会计场景代码_摊余成本类债券_买入(DictCode.会计场景代码,"1313","摊余成本类债券-买入"),
    会计场景代码_摊余成本类债券_每日计提摊销(DictCode.会计场景代码,"1314","摊余成本类债券-每日计提摊销"),
    会计场景代码_摊余成本类债券_收息(DictCode.会计场景代码,"1315","摊余成本类债券-收息"),
    会计场景代码_摊余成本类债券_卖出(DictCode.会计场景代码,"1316","摊余成本类债券-卖出"),
    会计场景代码_摊余成本类债券_还本到期(DictCode.会计场景代码,"1317","摊余成本类债券-还本到期"),
    会计场景代码_摊余成本类债券_债券转托管(DictCode.会计场景代码,"1318","摊余成本类债券-债券转托管"),
    会计场景代码_摊余成本类债券_债转股(DictCode.会计场景代码,"1319","摊余成本类债券-债转股"),
    会计场景代码_摊余成本类债券_上市流通(DictCode.会计场景代码,"1333","摊余成本类债券-上市流通"),
    会计场景代码_通道费_计提(DictCode.会计场景代码,"1701","通道费-计提"),
    会计场景代码_通道费_定期支付(DictCode.会计场景代码,"1702","通道费-定期支付"),
    会计场景代码_通道费_回款时支付(DictCode.会计场景代码,"1703","通道费-回款时支付"),
    会计场景代码_推介费计提(DictCode.会计场景代码,"3005","推介费计提"),
    会计场景代码_费用支付_推介费(DictCode.会计场景代码,"3006","费用支付-推介费"),
    会计场景代码_交易费用支付(DictCode.会计场景代码,"3001","交易费用支付"),
    会计场景代码_交易费用转仓转入(DictCode.会计场景代码,"3002","交易费用转仓转入"),
    会计场景代码_公允价值损益类债券_申购确认(DictCode.会计场景代码,"1356","公允价值损益类债券-申购确认"),
    会计场景代码_摊余成本类债券_申购确认(DictCode.会计场景代码,"1357","摊余成本类债券-申购确认"),
    会计场景代码_综合收益类债券_申购确认(DictCode.会计场景代码,"1358","综合收益类债券-申购确认"),
    会计场景代码_资金划款_债券类资产申购确认(DictCode.会计场景代码,"2740","资金划款-债券类资产申购确认"),
    会计场景代码_资金划款_债券类资产申购划款(DictCode.会计场景代码,"2741","资金划款-债券类资产申购划款"),
    会计场景代码_资金收款_债券类资产申购退款(DictCode.会计场景代码,"2742","资金收款-债券类资产申购退款"),
    会计场景代码_拆出_到期(DictCode.会计场景代码,"1111","拆出-到期"),
    会计场景代码_费用摊销(DictCode.会计场景代码,"3008","费用摊销"),
    /**add jinmaodong 20210319 增加预提费用 start**/
    会计场景代码_交易费用计提(DictCode.会计场景代码,"3009","会计场景代码_交易费用计提"),
    /**add jinmaodong 20210319 增加预提费用 end**/

    会计场景代码_逾期资产罚息收款(DictCode.会计场景代码,"2808","逾期资产罚息收款"),
    会计场景代码_逾期资产罚息转入(DictCode.会计场景代码,"2806","逾期资产罚息转入"),
    会计场景代码_逾期资产罚息转出(DictCode.会计场景代码,"2807","逾期资产罚息转出"),
    会计场景代码_逾期款罚息计提(DictCode.会计场景代码,"2804","逾期款罚息计提"),
    会计场景代码_逾期款罚息冲正(DictCode.会计场景代码,"2805","逾期款罚息冲正"),
  
  //2020-01-03 add by chendijun 会计场景代码_期权交易
    会计场景代码_期权交易_开仓买入(DictCode.会计场景代码,"3101","期权交易_开仓买入"),
    会计场景代码_期权交易_开仓卖出(DictCode.会计场景代码,"3102","期权交易_开仓卖出"),
    会计场景代码_期权交易_买入方期权到期(DictCode.会计场景代码,"3111","期权交易_买入方期权到期"),
    会计场景代码_期权交易_卖出方期权到期交易(DictCode.会计场景代码,"3112","期权交易_卖出方期权到期交易"),
    会计场景代码_期权交易_买入每日估值(DictCode.会计场景代码,"3106","期权交易_买入每日估值"),
    会计场景代码_期权交易_卖出每日估值(DictCode.会计场景代码,"3113","期权交易_卖出每日估值"),
    
    // 2020/01/06 add by weipeng 增加自定义现金流批处理
    会计场景代码_资金收款_其他收入到账(DictCode.会计场景代码,"2798","资金收款-其他收入到账"),
    会计场景代码_资金划款_其他支出划款(DictCode.会计场景代码,"2799","资金划款-其他支出划款"),

    //2020-02-17 add by 严亚 会计场景代码_存放同业_红利再投
    会计场景代码_存放同业_红利再投(DictCode.会计场景代码,"1112","存放同业_红利再投"),

    会计场景代码_费用预提(DictCode.会计场景代码,"8201","费用预提"),

    会计场景代码_存放同业_减值计提(DictCode.会计场景代码,"1113","存放同业_减值计提"),
    会计场景代码_存放同业_减值清理(DictCode.会计场景代码,"1114","存放同业_减值清理"),
    会计场景代码_拆放同业_减值计提(DictCode.会计场景代码,"1115","拆放同业_减值计提"),
    会计场景代码_拆放同业_减值清理(DictCode.会计场景代码,"1116","拆放同业_减值清理"),
    会计场景代码_摊余成本类债券_减值计提(DictCode.会计场景代码,"1359","摊余成本类债券_减值计提"),
    会计场景代码_摊余成本类债券_减值清理(DictCode.会计场景代码,"1362","摊余成本类债券_减值清理"),
    会计场景代码_综合收益类债券_减值计提(DictCode.会计场景代码,"1364","综合收益类债券_减值计提"),
    会计场景代码_综合收益类债券_减值清理(DictCode.会计场景代码,"1367","综合收益类债券_减值清理"),
    会计场景代码_摊余成本类收益型计划类资产_减值计提(DictCode.会计场景代码,"1540","摊余成本类收益型计划类资产_减值计提"),
    会计场景代码_摊余成本类收益型计划类资产_减值清理(DictCode.会计场景代码,"1543","摊余成本类收益型计划类资产_减值清理"),
    会计场景代码_综合收益类收益型资产_减值计提(DictCode.会计场景代码,"1536","综合收益类收益型资产_减值计提"),
    会计场景代码_质押式逆回购_减值计提(DictCode.会计场景代码,"1431","质押式逆回购_减值计提"),
    会计场景代码_买断式逆回购_减值计提(DictCode.会计场景代码,"1432","买断式逆回购_减值计提"),


    会计场景代码_综合收益类收益型资产_买入(DictCode.会计场景代码,"1530","综合收益类收益型资产-买入"),
    会计场景代码_综合收益类收益型资产_计提摊销(DictCode.会计场景代码,"1531","综合收益类收益型资产-计提摊销"),
    会计场景代码_综合收益类收益型资产_公允价值变动(DictCode.会计场景代码,"1532","综合收益类收益型资产-公允价值变动"),
    会计场景代码_综合收益类收益型资产_收息(DictCode.会计场景代码,"1533","综合收益类收益型资产-收息"),
    会计场景代码_综合收益类收益型资产_还本到期(DictCode.会计场景代码,"1534","综合收益类收益型资产-还本到期"),
    会计场景代码_综合收益类收益型资产_卖出(DictCode.会计场景代码,"1535","综合收益类收益型资产-卖出"),
    会计场景代码_资金收款_综合收益类收益型资产_收息到账(DictCode.会计场景代码,"2713","资金收款-综合收益类计划类资产收息"),
    会计场景代码_资金收款_综合收益类收益型资产_还本到账(DictCode.会计场景代码,"2739","资金收款-综合收益类计划类资产还本"),
    会计场景代码_综合收益类收益型资产_减值清理(DictCode.会计场景代码,"1537","综合收益类收益型资产_减值清理"),
    /**添加会计场景2735【资金划款-拆出到期】 by yanya on 20201216**/
    会计场景代码_资金划款_拆出到期(DictCode.会计场景代码,"2735","资金划款-拆出到期"),

    /**添加会计场景【其他债权投资收息相关】 by yanya on 20201217**/
    会计场景代码_资金划款_其他债权投资买入(DictCode.会计场景代码,"2750","资金划款-其他债权投资买入"),
    会计场景代码_资金收款_其他债权投资卖出(DictCode.会计场景代码,"2751","资金收款-其他债权投资卖出"),
    会计场景代码_资金收款_摊余成本类其他债权投资收息(DictCode.会计场景代码,"2752","资金收款-摊余成本类其他债权投资收息"),
    会计场景代码_资金收款_公允价值变动类其他债权投资收息(DictCode.会计场景代码,"2753","资金收款-公允价值变动类其他债权投资收息"),
    会计场景代码_资金收款_综合收益类其他债权投资收息(DictCode.会计场景代码,"2754","资金收款-综合收益类其他债权投资收息"),
    会计场景代码_资金收款_摊余成本类其他债权投资还本(DictCode.会计场景代码,"2755","资金收款-摊余成本类其他债权投资还本"),
    会计场景代码_资金收款_公允价值变动类其他债权投资还本(DictCode.会计场景代码,"2756","资金收款-公允价值变动类其他债权投资还本"),
    会计场景代码_资金收款_综合收益类其他债权投资还本(DictCode.会计场景代码,"2757","资金收款-综合收益类其他债权投资还本"),

    会计场景代码_摊余成本类其他债权投资_买入(DictCode.会计场景代码,"3501","摊余成本类其他债权投资-买入"),
    会计场景代码_摊余成本类其他债权投资_卖出(DictCode.会计场景代码,"3505","摊余成本类其他债权投资-卖出"),
    会计场景代码_摊余成本类其他债权投资_利息计提(DictCode.会计场景代码,"3502","摊余成本类其他债权投资-利息计提"),
    会计场景代码_摊余成本类其他债权投资_收息(DictCode.会计场景代码,"3503","摊余成本类其他债权投资-收息"),
    会计场景代码_摊余成本类其他债权投资_还本到期(DictCode.会计场景代码,"3504","摊余成本类其他债权投资-还本到期"),
    会计场景代码_摊余成本类其他债权投资_减值计提(DictCode.会计场景代码,"3506","摊余成本类其他债权投资-减值计提"),
    会计场景代码_摊余成本类其他债权投资_减值清理(DictCode.会计场景代码,"3507","摊余成本类其他债权投资-减值清理"),
    会计场景代码_公允价值变动类其他债权投资_买入(DictCode.会计场景代码,"3701","公允价值变动类其他债权投资-买入"),
    会计场景代码_公允价值变动类其他债权投资_利息计提(DictCode.会计场景代码,"3702","公允价值变动类其他债权投资-利息计提"),
    会计场景代码_公允价值变动类其他债权投资_收息(DictCode.会计场景代码,"3703","公允价值变动类其他债权投资-收息"),
    会计场景代码_公允价值变动类其他债权投资_还本到期(DictCode.会计场景代码,"3704","公允价值变动类其他债权投资-还本到期"),
    会计场景代码_公允价值变动类其他债权投资_卖出(DictCode.会计场景代码,"3705","公允价值变动类其他债权投资-卖出"),
    会计场景代码_公允价值变动类其他债权投资_公允价值变动(DictCode.会计场景代码,"3706","公允价值变动类其他债权投资-公允价值变动"),
    会计场景代码_综合收益类其他债权投资_买入(DictCode.会计场景代码,"3601","综合收益类其他债权投资-买入"),
    会计场景代码_综合收益类其他债权投资_计提摊销(DictCode.会计场景代码,"3602","综合收益类其他债权投资-计提摊销"),
    会计场景代码_综合收益类其他债权投资_公允价值变动(DictCode.会计场景代码,"3603","综合收益类其他债权投资-公允价值变动"),
    会计场景代码_综合收益类其他债权投资_收息(DictCode.会计场景代码,"3604","综合收益类其他债权投资-收息"),
    会计场景代码_综合收益类其他债权投资_还本到期(DictCode.会计场景代码,"3605","综合收益类其他债权投资-还本到期"),
    会计场景代码_综合收益类其他债权投资_卖出(DictCode.会计场景代码,"3606","综合收益类其他债权投资-卖出"),
    会计场景代码_综合收益类其他债权投资_减值计提(DictCode.会计场景代码,"3607","综合收益类其他债权投资-减值计提"),
    会计场景代码_综合收益类其他债权投资_减值清理(DictCode.会计场景代码,"3608","综合收益类其他债权投资-减值清理"),

    /** add by yanya on 20210309 添加会计场景代码行权相关 start**/
    会计场景代码_摊余成本债券_回售申请(DictCode.会计场景代码,"1370","摊余成本债券-回售申请"),
    会计场景代码_摊余成本债券_回售确认(DictCode.会计场景代码,"1371","摊余成本债券-回售确认"),
    会计场景代码_摊余成本债券_赎回结转(DictCode.会计场景代码,"1372","摊余成本债券-赎回结转"),
    会计场景代码_摊余成本债券_赎回确认(DictCode.会计场景代码,"1373","摊余成本债券-赎回确认"),
    会计场景代码_综合收益债券_回售申请(DictCode.会计场景代码,"1374","综合收益债券-回售申请"),
    会计场景代码_综合收益债券_回售确认(DictCode.会计场景代码,"1375","综合收益债券-回售确认"),
    会计场景代码_综合收益债券_赎回结转(DictCode.会计场景代码,"1376","综合收益债券-赎回结转"),
    会计场景代码_综合收益债券_赎回确认(DictCode.会计场景代码,"1377","综合收益债券-赎回确认"),
    会计场景代码_公允价值损益类债券_回售申请(DictCode.会计场景代码,"1378","公允价值损益类债券-回售申请"),
    会计场景代码_公允价值损益类债券_回售确认(DictCode.会计场景代码,"1379","公允价值损益类债券-回售确认"),
    会计场景代码_公允价值损益类债券_赎回结转(DictCode.会计场景代码,"1380","公允价值损益类债券-赎回结转"),
    会计场景代码_公允价值损益类债券_赎回确认(DictCode.会计场景代码,"1381","公允价值损益类债券-赎回确认"),
    /** add by yanya on 20210309 添加会计场景代码行权相关 end**/
    ;
    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    DictCodeListTableId(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static DictCodeListTableId from(DictCode dictCode, String value) {
        DictCodeListTableId[] values = DictCodeListTableId.values();
        for (DictCodeListTableId code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 转换成DICTCODELIST
     * @param dictCodeListTableId
     * @return
     */
    public static Map<String,Object> fromDictCodeList(DictCodeListTableId dictCodeListTableId){
        Map<String,Object> retMap=new HashMap<String,Object>();
        retMap.put("codeName",dictCodeListTableId.codeName);
        retMap.put("value",dictCodeListTableId.value);
        retMap.put("dictCode",dictCodeListTableId.dictCode);
        return retMap;
    }
    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        DictCodeListExt2[] values = DictCodeListExt2.values();
        for (DictCodeListExt2 code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        DictCodeListExt2[] values = DictCodeListExt2.values();
        for (DictCodeListExt2 code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }
}
