package com.joyintech.tams.constant;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * 数据字典明细枚举
 *
 * @author chenzhuo
 * @version 1.0 2020年7月7日
 * @see DictCodeListStl
 * @since 1.0
 */
public enum DictCodeListStl implements BaseDictCodeList {
	
	// 批处理执行结果_警告
	批处理执行结果_警告(DictCode.批处理执行结果,"WARN","警告"),
	批处理执行结果_正常结束(DictCode.批处理执行结果,"NOR","成功"),
	批处理执行结果_异常结束(DictCode.批处理执行结果,"EXP","失败"),
	
	// 交收方式
	交收方式_担保(DictCode.交收方式,"01","担保"),
	交收方式_非担保(DictCode.交收方式,"02","非担保"),
	
	// 业务场景分类明细
		业务场景分类明细_债券_债券买入(DictCode.业务场景分类明细,"010101","债券_债券买入"),
		业务场景分类明细_债券_债券卖出(DictCode.业务场景分类明细,"010201","债券_债券卖出"),
		业务场景分类明细_债券_还本收息_还本(DictCode.业务场景分类明细,"010301","债券_还本收息_还本"),
		业务场景分类明细_债券_还本收息_收息(DictCode.业务场景分类明细,"010302","债券_还本收息_收息"),
		业务场景分类明细_债券_还本收息(DictCode.业务场景分类明细,"010303","债券_还本收息"),
		业务场景分类明细_债券_收息(DictCode.业务场景分类明细,"010304","债券_收息"),
		业务场景分类明细_债券_到期_到期(DictCode.业务场景分类明细,"010401","债券_到期_到期"),
		业务场景分类明细_债券_回售_行权回售(DictCode.业务场景分类明细,"010501","债券_回售_行权回售"),
		业务场景分类明细_债券_赎回(DictCode.业务场景分类明细,"010601","债券_赎回"),
		业务场景分类明细_债券_投标_申购(DictCode.业务场景分类明细,"010701","债券_投标_申购"),
		业务场景分类明细_债券_中签_买入(DictCode.业务场景分类明细,"010702","债券_中签_买入"),
		业务场景分类明细_债券_网上申购_申购(DictCode.业务场景分类明细,"010801","债券_网上申购_申购"),
		业务场景分类明细_债券_网上申购_申购确认(DictCode.业务场景分类明细,"010802","债券_网上申购_申购确认"),
		业务场景分类明细_债券_网下申购_申购确认(DictCode.业务场景分类明细,"010901","债券_网下申购_申购确认"),
		业务场景分类明细_债券_申购确认(DictCode.业务场景分类明细,"011001","债券_申购确认"),
		业务场景分类明细_债券_保证金_保证金划款(DictCode.业务场景分类明细,"011101","债券_保证金_保证金划款"),
		业务场景分类明细_债券_保证金_保证金回款(DictCode.业务场景分类明细,"011102","债券_保证金_保证金回款"),
		业务场景分类明细_债券_换股(DictCode.业务场景分类明细,"011201","债券_换股"),
		业务场景分类明细_债券_优先配售_申购(DictCode.业务场景分类明细,"011301","债券_优先配售_申购"),
		业务场景分类明细_债券_优先配售_买入(DictCode.业务场景分类明细,"011401","债券_优先配售_买入"),
		业务场景分类明细_债券_转股_债转股(DictCode.业务场景分类明细,"011501","债券_转股_债转股"),
		业务场景分类明细_基金_ETF_买入(DictCode.业务场景分类明细,"020101","基金_ETF_买入"),
		业务场景分类明细_基金_ETF_卖出(DictCode.业务场景分类明细,"020102","基金_ETF_卖出"),
		业务场景分类明细_基金_ETF_分红_现金分红(DictCode.业务场景分类明细,"020103","基金_ETF_分红_现金分红"),
		业务场景分类明细_基金_ETF_分红_除权登记(DictCode.业务场景分类明细,"020104","基金_ETF_分红_除权登记"),
		业务场景分类明细_基金_ETF_分红_红利再投(DictCode.业务场景分类明细,"020105","基金_ETF_分红_红利再投"),
		业务场景分类明细_基金_ETF_认购(DictCode.业务场景分类明细,"020106","基金_ETF_认购"),
		业务场景分类明细_基金_ETF_认购确认(DictCode.业务场景分类明细,"020107","基金_ETF_认购确认"),
		业务场景分类明细_基金_ETF_认购退款(DictCode.业务场景分类明细,"020108","基金_ETF_认购退款"),
		业务场景分类明细_基金_ETF_申购(DictCode.业务场景分类明细,"020109","基金_ETF_申购"),
		业务场景分类明细_基金_ETF_申购确认(DictCode.业务场景分类明细,"020110","基金_ETF_申购确认"),
		业务场景分类明细_基金_ETF_申购退款(DictCode.业务场景分类明细,"020111","基金_ETF_申购退款"),
		业务场景分类明细_基金_ETF_赎回(DictCode.业务场景分类明细,"020112","基金_ETF_赎回"),
		业务场景分类明细_基金_ETF_赎回确认(DictCode.业务场景分类明细,"020113","基金_ETF_赎回确认"),
		业务场景分类明细_基金_ETF_赎回到账(DictCode.业务场景分类明细,"020114","基金_ETF_赎回到账"),
		业务场景分类明细_基金_ETF_份额折算_份额强增(DictCode.业务场景分类明细,"020115","基金_ETF_份额折算_份额强增"),
		业务场景分类明细_基金_ETF_份额折算_份额强减(DictCode.业务场景分类明细,"020116","基金_ETF_份额折算_份额强减"),
		业务场景分类明细_基金_实时申赎货币基金_买入(DictCode.业务场景分类明细,"020201","基金_实时申赎货币基金_买入"),
		业务场景分类明细_基金_实时申赎货币基金_卖出(DictCode.业务场景分类明细,"020202","基金_实时申赎货币基金_卖出"),
		业务场景分类明细_基金_实时申赎货币基金_分红_现金分红(DictCode.业务场景分类明细,"020203","基金_实时申赎货币基金_分红_现金分红"),
		业务场景分类明细_基金_实时申赎货币基金_分红_除权登记(DictCode.业务场景分类明细,"020204","基金_实时申赎货币基金_分红_除权登记"),
		业务场景分类明细_基金_实时申赎货币基金_分红_红利再投(DictCode.业务场景分类明细,"020205","基金_实时申赎货币基金_分红_红利再投"),
		业务场景分类明细_基金_实时申赎货币基金_认购(DictCode.业务场景分类明细,"020206","基金_实时申赎货币基金_认购"),
		业务场景分类明细_基金_实时申赎货币基金_认购确认(DictCode.业务场景分类明细,"020207","基金_实时申赎货币基金_认购确认"),
		业务场景分类明细_基金_实时申赎货币基金_认购退款(DictCode.业务场景分类明细,"020208","基金_实时申赎货币基金_认购退款"),
		业务场景分类明细_基金_实时申赎货币基金_申购(DictCode.业务场景分类明细,"020209","基金_实时申赎货币基金_申购"),
		业务场景分类明细_基金_实时申赎货币基金_申购确认(DictCode.业务场景分类明细,"020210","基金_实时申赎货币基金_申购确认"),
		业务场景分类明细_基金_实时申赎货币基金_申购退款(DictCode.业务场景分类明细,"020211","基金_实时申赎货币基金_申购退款"),
		业务场景分类明细_基金_实时申赎货币基金_赎回(DictCode.业务场景分类明细,"020212","基金_实时申赎货币基金_赎回"),
		业务场景分类明细_基金_实时申赎货币基金_赎回确认(DictCode.业务场景分类明细,"020213","基金_实时申赎货币基金_赎回确认"),
		业务场景分类明细_基金_实时申赎货币基金_赎回到账(DictCode.业务场景分类明细,"020214","基金_实时申赎货币基金_赎回到账"),
		业务场景分类明细_基金_实时申赎货币基金_份额折算_份额强增(DictCode.业务场景分类明细,"020215","基金_实时申赎货币基金_份额折算_份额强增"),
		业务场景分类明细_基金_实时申赎货币基金_份额折算_份额强减(DictCode.业务场景分类明细,"020216","基金_实时申赎货币基金_份额折算_份额强减"),
		业务场景分类明细_基金_交易型货币基金_买入(DictCode.业务场景分类明细,"020301","基金_交易型货币基金_买入"),
		业务场景分类明细_基金_交易型货币基金_卖出(DictCode.业务场景分类明细,"020302","基金_交易型货币基金_卖出"),
		业务场景分类明细_基金_交易型货币基金_分红_现金分红(DictCode.业务场景分类明细,"020303","基金_交易型货币基金_分红_现金分红"),
		业务场景分类明细_基金_交易型货币基金_分红_除权登记(DictCode.业务场景分类明细,"020304","基金_交易型货币基金_分红_除权登记"),
		业务场景分类明细_基金_交易型货币基金_分红_红利再投(DictCode.业务场景分类明细,"020305","基金_交易型货币基金_分红_红利再投"),
		业务场景分类明细_基金_交易型货币基金_认购(DictCode.业务场景分类明细,"020306","基金_交易型货币基金_认购"),
		业务场景分类明细_基金_交易型货币基金_认购确认(DictCode.业务场景分类明细,"020307","基金_交易型货币基金_认购确认"),
		业务场景分类明细_基金_交易型货币基金_认购退款(DictCode.业务场景分类明细,"020308","基金_交易型货币基金_认购退款"),
		业务场景分类明细_基金_交易型货币基金_申购(DictCode.业务场景分类明细,"020309","基金_交易型货币基金_申购"),
		业务场景分类明细_基金_交易型货币基金_申购确认(DictCode.业务场景分类明细,"020310","基金_交易型货币基金_申购确认"),
		业务场景分类明细_基金_交易型货币基金_申购退出(DictCode.业务场景分类明细,"020311","基金_交易型货币基金_申购退出"),
		业务场景分类明细_基金_交易型货币基金_赎回(DictCode.业务场景分类明细,"020312","基金_交易型货币基金_赎回"),
		业务场景分类明细_基金_交易型货币基金_赎回确认(DictCode.业务场景分类明细,"020313","基金_交易型货币基金_赎回确认"),
		业务场景分类明细_基金_交易型货币基金_赎回到账(DictCode.业务场景分类明细,"020314","基金_交易型货币基金_赎回到账"),
		业务场景分类明细_基金_交易型货币基金_份额折算_份额强增(DictCode.业务场景分类明细,"020315","基金_交易型货币基金_份额折算_份额强增"),
		业务场景分类明细_基金_交易型货币基金_份额折算_份额强减(DictCode.业务场景分类明细,"020316","基金_交易型货币基金_份额折算_份额强减"),
		业务场景分类明细_基金_LOF_买入(DictCode.业务场景分类明细,"020401","基金_LOF_买入"),
		业务场景分类明细_基金_LOF_卖出(DictCode.业务场景分类明细,"020402","基金_LOF_卖出"),
		业务场景分类明细_基金_LOF_分红_现金分红(DictCode.业务场景分类明细,"020403","基金_LOF_分红_现金分红"),
		业务场景分类明细_基金_LOF_分红_除权登记(DictCode.业务场景分类明细,"020404","基金_LOF_分红_除权登记"),
		业务场景分类明细_基金_LOF_分红_红利再投(DictCode.业务场景分类明细,"020405","基金_LOF_分红_红利再投"),
		业务场景分类明细_基金_LOF_认购(DictCode.业务场景分类明细,"020406","基金_LOF_认购"),
		业务场景分类明细_基金_LOF_认购确认(DictCode.业务场景分类明细,"020407","基金_LOF_认购确认"),
		业务场景分类明细_基金_LOF_认购退款(DictCode.业务场景分类明细,"020408","基金_LOF_认购退款"),
		业务场景分类明细_基金_LOF_申购(DictCode.业务场景分类明细,"020409","基金_LOF_申购"),
		业务场景分类明细_基金_LOF_申购确认(DictCode.业务场景分类明细,"020410","基金_LOF_申购确认"),
		业务场景分类明细_基金_LOF_申购退款(DictCode.业务场景分类明细,"020411","基金_LOF_申购退款"),
		业务场景分类明细_基金_LOF_赎回(DictCode.业务场景分类明细,"020412","基金_LOF_赎回"),
		业务场景分类明细_基金_LOF_赎回确认(DictCode.业务场景分类明细,"020413","基金_LOF_赎回确认"),
		业务场景分类明细_基金_LOF_赎回到账(DictCode.业务场景分类明细,"020414","基金_LOF_赎回到账"),
		业务场景分类明细_基金_LOF_份额折算_份额强增(DictCode.业务场景分类明细,"020415","基金_LOF_份额折算_份额强增"),
		业务场景分类明细_基金_LOF_份额折算_份额强减(DictCode.业务场景分类明细,"020416","基金_LOF_份额折算_份额强减"),
		业务场景分类明细_基金_分级LOF_买入(DictCode.业务场景分类明细,"020501","基金_分级LOF_买入"),
		业务场景分类明细_基金_分级LOF_卖出(DictCode.业务场景分类明细,"020502","基金_分级LOF_卖出"),
		业务场景分类明细_基金_分级LOF_分红_现金分红(DictCode.业务场景分类明细,"020503","基金_分级LOF_分红_现金分红"),
		业务场景分类明细_基金_分级LOF_分红_除权登记(DictCode.业务场景分类明细,"020504","基金_分级LOF_分红_除权登记"),
		业务场景分类明细_基金_分级LOF_分红_红利再投(DictCode.业务场景分类明细,"020505","基金_分级LOF_分红_红利再投"),
		业务场景分类明细_基金_分级LOF_认购(DictCode.业务场景分类明细,"020506","基金_分级LOF_认购"),
		业务场景分类明细_基金_分级LOF_认购确认(DictCode.业务场景分类明细,"020507","基金_分级LOF_认购确认"),
		业务场景分类明细_基金_分级LOF_认购退款(DictCode.业务场景分类明细,"020508","基金_分级LOF_认购退款"),
		业务场景分类明细_基金_分级LOF_申购(DictCode.业务场景分类明细,"020509","基金_分级LOF_申购"),
		业务场景分类明细_基金_分级LOF_申购确认(DictCode.业务场景分类明细,"020510","基金_分级LOF_申购确认"),
		业务场景分类明细_基金_分级LOF_申购退款(DictCode.业务场景分类明细,"020511","基金_分级LOF_申购退款"),
		业务场景分类明细_基金_分级LOF_赎回(DictCode.业务场景分类明细,"020512","基金_分级LOF_赎回"),
		业务场景分类明细_基金_分级LOF_赎回确认(DictCode.业务场景分类明细,"020513","基金_分级LOF_赎回确认"),
		业务场景分类明细_基金_分级LOF_赎回到账(DictCode.业务场景分类明细,"020514","基金_分级LOF_赎回到账"),
		业务场景分类明细_基金_分级LOF_份额折算_份额强增(DictCode.业务场景分类明细,"020515","基金_分级LOF_份额折算_份额强增"),
		业务场景分类明细_基金_分级LOF_份额折算_份额强减(DictCode.业务场景分类明细,"020516","基金_分级LOF_份额折算_份额强减"),
		业务场景分类明细_基金_封闭式基金_买入(DictCode.业务场景分类明细,"020601","基金_封闭式基金_买入"),
		业务场景分类明细_基金_封闭式基金_卖出(DictCode.业务场景分类明细,"020602","基金_封闭式基金_卖出"),
		业务场景分类明细_基金_封闭式基金_分红_现金分红(DictCode.业务场景分类明细,"020603","基金_封闭式基金_分红_现金分红"),
		业务场景分类明细_基金_封闭式基金_分红_除权登记(DictCode.业务场景分类明细,"020604","基金_封闭式基金_分红_除权登记"),
		业务场景分类明细_基金_封闭式基金_分红_红利再投(DictCode.业务场景分类明细,"020605","基金_封闭式基金_分红_红利再投"),
		业务场景分类明细_基金_封闭式基金_认购(DictCode.业务场景分类明细,"020606","基金_封闭式基金_认购"),
		业务场景分类明细_基金_封闭式基金_认购确认(DictCode.业务场景分类明细,"020607","基金_封闭式基金_认购确认"),
		业务场景分类明细_基金_封闭式基金_认购退款(DictCode.业务场景分类明细,"020608","基金_封闭式基金_认购退款"),
		业务场景分类明细_基金_封闭式基金_申购(DictCode.业务场景分类明细,"020609","基金_封闭式基金_申购"),
		业务场景分类明细_基金_封闭式基金_申购确认(DictCode.业务场景分类明细,"020610","基金_封闭式基金_申购确认"),
		业务场景分类明细_基金_封闭式基金_申购退款(DictCode.业务场景分类明细,"020611","基金_封闭式基金_申购退款"),
		业务场景分类明细_基金_封闭式基金_赎回(DictCode.业务场景分类明细,"020612","基金_封闭式基金_赎回"),
		业务场景分类明细_基金_封闭式基金_赎回确认(DictCode.业务场景分类明细,"020613","基金_封闭式基金_赎回确认"),
		业务场景分类明细_基金_封闭式基金_赎回到账(DictCode.业务场景分类明细,"020614","基金_封闭式基金_赎回到账"),
		业务场景分类明细_基金_封闭式基金_份额折算_份额强增(DictCode.业务场景分类明细,"020615","基金_封闭式基金_份额折算_份额强增"),
		业务场景分类明细_基金_封闭式基金_份额折算_份额强减(DictCode.业务场景分类明细,"020616","基金_封闭式基金_份额折算_份额强减"),
		业务场景分类明细_基金_非货币基金_买入(DictCode.业务场景分类明细,"020701","基金_非货币基金_买入"),
		业务场景分类明细_基金_非货币基金_卖出(DictCode.业务场景分类明细,"020702","基金_非货币基金_卖出"),
		业务场景分类明细_基金_非货币基金_分红_现金分红(DictCode.业务场景分类明细,"020703","基金_非货币基金_分红_现金分红"),
		业务场景分类明细_基金_非货币基金_分红_除权登记(DictCode.业务场景分类明细,"020704","基金_非货币基金_分红_除权登记"),
		业务场景分类明细_基金_非货币基金_分红_红利再投(DictCode.业务场景分类明细,"020705","基金_非货币基金_分红_红利再投"),
		业务场景分类明细_基金_非货币基金_认购(DictCode.业务场景分类明细,"020706","基金_非货币基金_认购"),
		业务场景分类明细_基金_非货币基金_认购确认(DictCode.业务场景分类明细,"020707","基金_非货币基金_认购确认"),
		业务场景分类明细_基金_非货币基金_认购退款(DictCode.业务场景分类明细,"020708","基金_非货币基金_认购退款"),
		业务场景分类明细_基金_非货币基金_申购(DictCode.业务场景分类明细,"020709","基金_非货币基金_申购"),
		业务场景分类明细_基金_非货币基金_申购确认(DictCode.业务场景分类明细,"020710","基金_非货币基金_申购确认"),
		业务场景分类明细_基金_非货币基金_申购退款(DictCode.业务场景分类明细,"020711","基金_非货币基金_申购退款"),
		业务场景分类明细_基金_非货币基金_赎回(DictCode.业务场景分类明细,"020712","基金_非货币基金_赎回"),
		业务场景分类明细_基金_非货币基金_赎回确认(DictCode.业务场景分类明细,"020713","基金_非货币基金_赎回确认"),
		业务场景分类明细_基金_非货币基金_赎回到账(DictCode.业务场景分类明细,"020714","基金_非货币基金_赎回到账"),
		业务场景分类明细_基金_非货币基金_份额折算_份额强增(DictCode.业务场景分类明细,"020715","基金_非货币基金_份额折算_份额强增"),
		业务场景分类明细_基金_非货币基金_份额折算_份额强减(DictCode.业务场景分类明细,"020716","基金_非货币基金_份额折算_份额强减"),
		业务场景分类明细_基金_货币基金_买入(DictCode.业务场景分类明细,"020801","基金_货币基金_买入"),
		业务场景分类明细_基金_货币基金_卖出(DictCode.业务场景分类明细,"020802","基金_货币基金_卖出"),
		业务场景分类明细_基金_货币基金_分红_现金分红(DictCode.业务场景分类明细,"020803","基金_货币基金_分红_现金分红"),
		业务场景分类明细_基金_货币基金_分红_除权登记(DictCode.业务场景分类明细,"020804","基金_货币基金_分红_除权登记"),
		业务场景分类明细_基金_货币基金_分红_红利再投(DictCode.业务场景分类明细,"020805","基金_货币基金_分红_红利再投"),
		业务场景分类明细_基金_货币基金_认购(DictCode.业务场景分类明细,"020806","基金_货币基金_认购"),
		业务场景分类明细_基金_货币基金_认购确认(DictCode.业务场景分类明细,"020807","基金_货币基金_认购确认"),
		业务场景分类明细_基金_货币基金_认购退款(DictCode.业务场景分类明细,"020808","基金_货币基金_认购退款"),
		业务场景分类明细_基金_货币基金_申购(DictCode.业务场景分类明细,"020809","基金_货币基金_申购"),
		业务场景分类明细_基金_货币基金_申购确认(DictCode.业务场景分类明细,"020810","基金_货币基金_申购确认"),
		业务场景分类明细_基金_货币基金_申购退款(DictCode.业务场景分类明细,"020811","基金_货币基金_申购退款"),
		业务场景分类明细_基金_货币基金_赎回(DictCode.业务场景分类明细,"020812","基金_货币基金_赎回"),
		业务场景分类明细_基金_货币基金_赎回确认(DictCode.业务场景分类明细,"020813","基金_货币基金_赎回确认"),
		业务场景分类明细_基金_货币基金_赎回到账(DictCode.业务场景分类明细,"020814","基金_货币基金_赎回到账"),
		业务场景分类明细_基金_货币基金_份额折算_份额强增(DictCode.业务场景分类明细,"020815","基金_货币基金_份额折算_份额强增"),
		业务场景分类明细_基金_货币基金_份额折算_份额强减(DictCode.业务场景分类明细,"020816","基金_货币基金_份额折算_份额强减"),
		业务场景分类明细_基金_开放式基金_买入(DictCode.业务场景分类明细,"020901","基金_开放式基金_买入"),
		业务场景分类明细_基金_开放式基金_卖出(DictCode.业务场景分类明细,"020902","基金_开放式基金_卖出"),
		业务场景分类明细_基金_开放式基金_分红_现金分红(DictCode.业务场景分类明细,"020903","基金_开放式基金_分红_现金分红"),
		业务场景分类明细_基金_开放式基金_分红_除权登记(DictCode.业务场景分类明细,"020904","基金_开放式基金_分红_除权登记"),
		业务场景分类明细_基金_开放式基金_分红_红利再投(DictCode.业务场景分类明细,"020905","基金_开放式基金_分红_红利再投"),
		业务场景分类明细_基金_开放式基金_认购(DictCode.业务场景分类明细,"020906","基金_开放式基金_认购"),
		业务场景分类明细_基金_开放式基金_认购确认(DictCode.业务场景分类明细,"020907","基金_开放式基金_认购确认"),
		业务场景分类明细_基金_开放式基金_认购退款(DictCode.业务场景分类明细,"020908","基金_开放式基金_认购退款"),
		业务场景分类明细_基金_开放式基金_申购(DictCode.业务场景分类明细,"020909","基金_开放式基金_申购"),
		业务场景分类明细_基金_开放式基金_申购确认(DictCode.业务场景分类明细,"020910","基金_开放式基金_申购确认"),
		业务场景分类明细_基金_开放式基金_申购退款(DictCode.业务场景分类明细,"020911","基金_开放式基金_申购退款"),
		业务场景分类明细_基金_开放式基金_赎回(DictCode.业务场景分类明细,"020912","基金_开放式基金_赎回"),
		业务场景分类明细_基金_开放式基金_赎回确认(DictCode.业务场景分类明细,"020913","基金_开放式基金_赎回确认"),
		业务场景分类明细_基金_开放式基金_赎回到账(DictCode.业务场景分类明细,"020914","基金_开放式基金_赎回到账"),
		业务场景分类明细_基金_开放式基金_份额折算_份额强增(DictCode.业务场景分类明细,"020915","基金_开放式基金_份额折算_份额强增"),
		业务场景分类明细_基金_开放式基金_份额折算_份额强减(DictCode.业务场景分类明细,"020916","基金_开放式基金_份额折算_份额强减"),
		业务场景分类明细_股票_新股中签(DictCode.业务场景分类明细,"060101","股票_新股中签"),
		业务场景分类明细_股票_新股中签_确认(DictCode.业务场景分类明细,"060102","业务场景分类明细_股票_新股中签_确认"),
		业务场景分类明细_股票_新股中签_通知(DictCode.业务场景分类明细,"060103","业务场景分类明细_股票_新股中签_通知"),
		业务场景分类明细_股票_配股认购_配股(DictCode.业务场景分类明细,"060201","股票_配股认购_配股"),
		业务场景分类明细_股票_公开增发申购_增发配售(DictCode.业务场景分类明细,"060301","股票_公开增发申购_增发(配售)"),
		业务场景分类明细_股票_买入(DictCode.业务场景分类明细,"060401","股票_买入"),
		业务场景分类明细_股票_卖出(DictCode.业务场景分类明细,"060501","股票_卖出"),
		业务场景分类明细_股票_分红_现金分红(DictCode.业务场景分类明细,"060601","股票_分红_现金分红"),
		业务场景分类明细_股票_分红_除权登记(DictCode.业务场景分类明细,"060602","股票_分红_除权登记"),
		业务场景分类明细_股票_分红_红利再投(DictCode.业务场景分类明细,"060603","股票_分红_红利再投"),
		业务场景分类明细_股票_送股(DictCode.业务场景分类明细,"060701","股票_送股"),
		业务场景分类明细_股票_股息红利税_补缴(DictCode.业务场景分类明细,"060801","股票_股息红利税_补缴"),
		业务场景分类明细_债券质押式竞价逆回购_首期_买入(DictCode.业务场景分类明细,"0901RB01","债券质押式竞价逆回购_首期_买入"),
		业务场景分类明细_债券质押式竞价逆回购_到期(DictCode.业务场景分类明细,"0901RB02","债券质押式竞价逆回购_到期"),
		业务场景分类明细_债券质押式竞价正回购_标准券入库(DictCode.业务场景分类明细,"0901RS01","债券质押式竞价正回购_标准券入库"),
		业务场景分类明细_债券质押式竞价正回购_标准券出库(DictCode.业务场景分类明细,"0901RS02","债券质押式竞价正回购_标准券出库"),
		业务场景分类明细_债券质押式竞价正回购_首期_买入(DictCode.业务场景分类明细,"0901RS03","债券质押式竞价正回购_首期_买入"),
		业务场景分类明细_债券质押式竞价正回购_到期(DictCode.业务场景分类明细,"0901RS04","债券质押式竞价正回购_到期"),
		业务场景分类明细_债券协议逆回购_首期_买入(DictCode.业务场景分类明细,"0902RB01","债券协议逆回购_首期_买入"),
		业务场景分类明细_债券协议逆回购_到期(DictCode.业务场景分类明细,"0902RB02","债券协议逆回购_到期"),
		业务场景分类明细_债券协议逆回购_提取终止(DictCode.业务场景分类明细,"0902RB03","债券协议逆回购_提取终止"),
		业务场景分类明细_债券协议逆回购_到期续作(DictCode.业务场景分类明细,"0902RB04","债券协议逆回购_到期续作"),
		业务场景分类明细_债券协议逆回购_逾期返售解除质押(DictCode.业务场景分类明细,"0902RB05","债券协议逆回购_逾期返售(解除质押)"),
		业务场景分类明细_债券协议逆回购_换券(DictCode.业务场景分类明细,"0902RB06","债券协议逆回购_换券"),
		业务场景分类明细_债券协议正回购_换券(DictCode.业务场景分类明细,"0902RS01","债券协议正回购_换券"),
		业务场景分类明细_债券协议逆回购_换券_换入(DictCode.业务场景分类明细,"0902RB0601","债券协议逆回购_换券_换入"),
	    业务场景分类明细_债券协议逆回购_换券_换出(DictCode.业务场景分类明细,"0902RB0602","债券协议逆回购_换券_换出"),
	    业务场景分类明细_债券协议正回购_换券_换入(DictCode.业务场景分类明细,"0902RS0101","债券协议正回购_换券_换入"),
		业务场景分类明细_债券协议正回购_换券_换出(DictCode.业务场景分类明细,"0902RS0102","债券协议正回购_换券_换出"),
		业务场景分类明细_债券协议正回购_换券_换钱(DictCode.业务场景分类明细,"0902RS0103","债券协议正回购_换券_换钱"),
	    业务场景分类明细_债券协议正回购_解除质押(DictCode.业务场景分类明细,"0902RS07","债券协议正回购_解除质押"),
	    业务场景分类明细_债券协议逆回购_解除质押(DictCode.业务场景分类明细,"0902RS07","债券协议逆回购_解除质押"),
		业务场景分类明细_债券协议正回购_首期_买入(DictCode.业务场景分类明细,"0902RS02","债券协议正回购_首期_买入"),
		业务场景分类明细_债券协议正回购_到期(DictCode.业务场景分类明细,"0902RS03","债券协议正回购_到期"),
		业务场景分类明细_债券协议正回购_到期续作(DictCode.业务场景分类明细,"0902RS04","债券协议正回购_到期续作"),
		业务场景分类明细_债券协议正回购_提取终止(DictCode.业务场景分类明细,"0902RS05","债券协议正回购_提取终止"),
		业务场景分类明细_债券协议正回购_逾期返售解除质押(DictCode.业务场景分类明细,"0902RS06","债券协议正回购_逾期返售(解除质押)"),
		业务场景分类明细_买断式回购_买入融资方_买入(DictCode.业务场景分类明细,"0903RS01","买断式回购_买入(融资方)_买入"),
		业务场景分类明细_买断式回购_买入融资方_到期(DictCode.业务场景分类明细,"0903RS02","买断式回购_买入(融资方)_到期"),
		业务场景分类明细_买断式回购_买入融资方_保证金划款(DictCode.业务场景分类明细,"0903RS03","买断式回购_买入(融资方)_保证金划款"),
		业务场景分类明细_买断式回购_买入融资方_保证金回款(DictCode.业务场景分类明细,"0903RS04","买断式回购_买入(融资方)_保证金回款"),
		业务场景分类明细_买断式回购_卖出融券方_买入(DictCode.业务场景分类明细,"0903RB01","买断式回购_卖出(融券方)_买入"),
		业务场景分类明细_买断式回购_卖出融券方_到期(DictCode.业务场景分类明细,"0903RB02","买断式回购_卖出(融券方)_到期"),
		业务场景分类明细_买断式回购_卖出融券方_保证金划款(DictCode.业务场景分类明细,"0903RB03","买断式回购_卖出(融券方)_保证金划款"),
		业务场景分类明细_买断式回购_卖出融券方_保证金回款(DictCode.业务场景分类明细,"0903RB04","买断式回购_卖出(融券方)_保证金回款"),
		业务场景分类明细_隔夜正回购_首期_买入(DictCode.业务场景分类明细,"0904RS01","隔夜正回购_首期_买入"),
		业务场景分类明细_隔夜正回购_到期(DictCode.业务场景分类明细,"0904RS02","隔夜正回购_到期"),
		业务场景分类明细_隔夜逆回购_首期_买入(DictCode.业务场景分类明细,"0904RB01","隔夜逆回购_首期_买入"),
		业务场景分类明细_隔夜逆回购_到期(DictCode.业务场景分类明细,"0904RB02","隔夜逆回购_到期"),
		业务场景分类明细_报价正回购_首期_买入(DictCode.业务场景分类明细,"0905RS01","报价正回购_首期_买入"),
		业务场景分类明细_报价正回购_到期(DictCode.业务场景分类明细,"0905RS02","报价正回购_到期"),
		业务场景分类明细_报价逆回购_首期_买入(DictCode.业务场景分类明细,"0905RB01","报价逆回购_首期_买入"),
		业务场景分类明细_报价逆回购_到期(DictCode.业务场景分类明细,"0905RB02","报价逆回购_到期"),
	    业务场景分类明细_质押券出库(DictCode.业务场景分类明细,"0906RB02","质押券出库"),
    	业务场景分类明细_质押券入库(DictCode.业务场景分类明细,"0906RB01","质押券入库"),
		// 交易方向_换券到交易方向_换股
		交易方向_换券(DictCode.交易方向,"T67","换券"),
		交易方向_质押券入库(DictCode.交易方向,"T68","质押券入库"),
		交易方向_质押券出库(DictCode.交易方向,"T69","质押券出库"),
		交易方向_换股(DictCode.交易方向,"T70","换股"),
		交易方向_收购方过入(DictCode.交易方向,"T71","收购方过入"),
		交易方向_预受方过出(DictCode.交易方向,"T72","预受方过出"),
		交易方向_送股(DictCode.交易方向,"T73","送股"),
		交易方向_派本派息(DictCode.交易方向,"T74","派本派息"),
		// 清算数据源表
		清算数据源表_上中登JSMX(DictCode.清算数据源表,"JSMX","上中登JSMX"),
		清算数据源表_深中登SJSMX(DictCode.清算数据源表,"SJSMX","深中登SJSMX"),
		清算数据源表_深中登SJSJG(DictCode.清算数据源表,"SJSJG","深中登SJSJG"),
		清算数据源表_深中登SJSFX(DictCode.清算数据源表,"SJSFX","深中登SJSFX"),
		清算数据源表_上中登ZQBD(DictCode.清算数据源表,"ZQBD","上中登ZQBD"),
		清算数据源表_上中登ABCSJ(DictCode.清算数据源表,"ABCSJ","上中登ABCSJ"),
		清算数据源表_深中登ZSMX(DictCode.清算数据源表,"ZSMX","深中登ZSMX"),
		清算数据源表_上中登ZQY(DictCode.清算数据源表,"ZQY","上中登ZQY"),
		清算数据源表_深中登SJSKS(DictCode.清算数据源表,"SJSKS","深中登SJSKS"),
	     清算数据源表_上中登TZXX(DictCode.清算数据源表,"TZXX","上中登TZXX"),
		清算数据源表_深中登SJSGB(DictCode.清算数据源表,"SJSGB","深中登SJSGB"),
		// PTL_TRADE的业务表
		业务表_结算指令表(DictCode.业务表,"01","结算指令表"),
		业务表_金融产品交易表(DictCode.业务表,"02","金融产品交易表"),
		业务表_衍生品交易表(DictCode.业务表,"03","衍生品交易表"),
		
		// 投管交易数据状态
		投管交易数据状态_待处理(DictCode.投管交易数据状态,"01","待处理"),
		投管交易数据状态_处理结束(DictCode.投管交易数据状态,"02","处理结束"),
		
		// 资产二级分类
		资产二级分类_国债(DictCode.资产二级分类,"B01","国债"),
		资产二级分类_公司债(DictCode.资产二级分类,"B07","公司债"),
		资产二级分类_企业债(DictCode.资产二级分类,"B06","企业债"),
		资产二级分类_可转债(DictCode.资产二级分类,"B14","可转债"),
		资产二级分类_金融债(DictCode.资产二级分类,"B05","金融债"),
		资产二级分类_优先股(DictCode.资产二级分类,"B17","优先股"),
		资产二级分类_资产支持证券(DictCode.资产二级分类,"B13","资产支持证券"),

		WIND一级分类_含债券一级分类等_国债(DictCode.WIND一级分类_含债券一级分类等,"B01","国债"),
		WIND一级分类_含债券一级分类等_金融债(DictCode.WIND一级分类_含债券一级分类等,"B05","金融债"),
		WIND一级分类_含债券一级分类等_企业债(DictCode.WIND一级分类_含债券一级分类等,"B06","企业债"),
		WIND一级分类_含债券一级分类等_公司债(DictCode.WIND一级分类_含债券一级分类等,"B07","公司债"),
		WIND一级分类_含债券一级分类等_资产支持证券(DictCode.WIND一级分类_含债券一级分类等,"B13","资产支持证券"),
		WIND一级分类_含债券一级分类等_可转债(DictCode.WIND一级分类_含债券一级分类等,"B14","可转债"),
		WIND一级分类_含债券一级分类等_优先股(DictCode.WIND一级分类_含债券一级分类等,"B17","优先股"),

	//add by chenjiaxing 20211015 start
	/**
	 * 对账参数- 参数代码-误差值
	 */
	参数代码_误差值(DictCode.参数代码, "01", "误差值"),
	/**
	 * 对账参数- 参数代码-对账维度
	 */
	参数代码_对账维度(DictCode.参数代码, "02", "对账维度"),

	/**
	 * 对账参数- 对账维度- 证券汇总
	 */
	对账维度_证券汇总(DictCode.对账维度, "01", "证券汇总"),

	/**
	 * 对账参数- 对账维度- 委托汇总
	 */
	对账维度_委托汇总(DictCode.对账维度, "02", "委托汇总"),
	/**
	 * 对账参数- 对账维度- 成交明细
	 */
	对账维度_成交明细(DictCode.对账维度, "03", "成交明细"),

	共通业务类型_券商对账参数设置(DictCode.共通业务类型, "STL06", "券商对账参数设置"),
	//add by chenjiaxing 20211015 end
	广播类别_允许分红的基金(DictCode.广播类别, "ZT", "允许分红的基金"),
	广播类别_权益分派方案(DictCode.广播类别, "QP", "权益分派方案")
	;
    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    DictCodeListStl(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static DictCodeListStl from(DictCode dictCode, String value) {
    	DictCodeListStl[] values = DictCodeListStl.values();
        for (DictCodeListStl code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 转换成DICTCODELIST
     * @param dictCodeListExt2
     * @return
     */
    public static Map<String,Object> fromDictCodeList(DictCodeListStl dictCodeListStl){
        Map<String,Object> retMap=new HashMap<String,Object>();
        retMap.put("codeName",dictCodeListStl.codeName);
        retMap.put("value",dictCodeListStl.value);
        retMap.put("dictCode",dictCodeListStl.dictCode);
        return retMap;
    }
    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        DictCodeListStl[] values = DictCodeListStl.values();
        for (DictCodeListStl code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        DictCodeListStl[] values = DictCodeListStl.values();
        for (DictCodeListStl code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }
}
