package com.joyintech.tams.constant;

import com.joyintech.framework.base.BaseDictCodeList;
import com.joyintech.framework.select.SelectOptionDto;
import com.joyintech.framework.util.StringUtil;

import java.math.BigDecimal;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * 数据字典明细枚举
 *
 * @author chenzhuo
 * @version 1.0 2016年11月12日
 * @see DictCodeListExt3
 * @since 1.0
 */
public enum DictCodeListExt3 implements BaseDictCodeList {
    //add by fanyunhan 20210816
    项目类计划类估值来源_手工(DictCode.项目类计划类估值来源,"01","手工"),
    项目类计划类估值来源_模型(DictCode.项目类计划类估值来源,"02","模型"),
    // add by shulifu 20210811
    是否可提前支取_不可提前支取(DictCode.是否可提前支取,"01","不可提前支取"),
    是否可提前支取_有条件可提前支取(DictCode.是否可提前支取,"02","有条件可提前支取"),
    是否可提前支取_无条件可提前支取(DictCode.是否可提前支取,"03","无条件可提前支取"),

    // add by wanshiwei 20200731
    共通业务类型_场内交易下单(DictCode.共通业务类型,"EXC01","场内交易下单"),
    共通业务类型_场内交易撤销(DictCode.共通业务类型,"EXC02","场内交易撤销"),
    //add by lishuping 20191106 start
    质押券状态_正常(DictCode.质押券状态, "01","正常"),
    质押券状态_触发预警(DictCode.质押券状态, "02","触发预警"),
    质押券状态_触发平仓(DictCode.质押券状态, "03","触发平仓"),
    //add by lishuping 20191106 end
    共通业务类型_产品端轧差划款(DictCode.共通业务类型,"PTL16","产品端轧差划款"),
	//添加价格类别 add by tanxuan
	价格类别_净价(DictCode.价格类别,"01","净价"),
	价格类别_全价(DictCode.价格类别,"02","全价"),
    增值税品种_产品增值税(DictCode.增值税品种,"01","产品增值税"),
    增值税品种_通道增值税(DictCode.增值税品种,"02","通道增值税"),
    平安业务类型_融入债券付息还本_付(DictCode.平安业务类型,"137","融入债券付息还本（付）"),
    平安业务类型_融出债券付息还本_收(DictCode.平安业务类型,"138","融出债券收息还本（收）"),

    需求发起端_产品端(DictCode.需求发起端,"01","产品端"),
    需求发起端_投资端(DictCode.需求发起端,"02","投资端"),
    需求发起端_客户端(DictCode.需求发起端,"03","客户端"),
    可行性状态_可行(DictCode.可行性状态,"01","可行"),
    可行性状态_不可行(DictCode.可行性状态,"02","不可行"),
    可行性状态_待定(DictCode.可行性状态,"03","待定"),
    可行需求分类_原有系列(DictCode.可行需求分类,"01","原有系列"),
    可行需求分类_新研发系列(DictCode.可行需求分类,"02","新研发系列"),

    /***add by liepeng 20191106 start**/
	 基准日_巨额赎回调整日(DictCode.基准日,"12","分红确认日"),
	   基准日_募集上线调整日(DictCode.基准日,"13","分红确认日"),
	   披露发送标识_发送状态(DictCode.披露发送标识,"01","发送状态"),
	   披露发送标识_反馈状态(DictCode.披露发送标识,"02","反馈状态"),
	   披露发送状态_成功(DictCode.披露发送状态,"01","成功"),
	   披露发送状态_失败(DictCode.披露发送状态,"02","失败"),
	   披露发送状态_不披露(DictCode.披露发送状态,"99","不披露"),
	   披露反馈状态_成功(DictCode.披露反馈状态,"01","成功"),
	   披露反馈状态_失败(DictCode.披露反馈状态,"02","失败"),
	   /***add by liepeng 20191106 end**/
	   /**
	     * 指令新建业务类型 yzg 20191106
	     */
	   共通业务类型_指令新建(DictCode.共通业务类型,"PTL15","指令新建"),
	   共通业务类型_产品申报登记要素管理(DictCode.共通业务类型,"FINPROD28","产品申报登记要素管理"),
	   共通业务类型_资产配置计划(DictCode.共通业务类型,"PRDPLAN03","资产配置计划"),

    匹配状态_已匹配(DictCode.匹配状态,"01","已匹配"),
    匹配状态_未匹配(DictCode.匹配状态,"02","未匹配"),
    匹配状态_部分匹配(DictCode.匹配状态,"03","部分匹配"),
    //add by gaopeng 20191108 start 增加债转股业务类型以及交易方向
    平安业务类型_债转股(DictCode.平安业务类型,"139","债转股"),
    交易方向_债转股(DictCode.交易方向,"T49","债转股"),
    //add by gaopeng 20191108 end 增加债转股业务类型以及交易方向
    交易方向_投资端_提前终止(DictCode.交易方向,"T54","提前终止"),
    交易方向_投资端_逾期返售(DictCode.交易方向,"T55","逾期返售"),
	代码类型_产品(DictCode.代码类型,"01","产品"),
	代码类型_资产(DictCode.代码类型,"02","资产"),

	/**利率上下限区分 **/

	利率上下限区分_利率上限(DictCode.利率上下限区分,"01","利率上限"),
	利率上下限区分_利率下限(DictCode.利率上下限区分,"02","利率下限"),

    平安业务类型_货币基金认购申请(DictCode.平安业务类型,"127","货币基金认购申请"),
    平安业务类型_非货币基金认购申请(DictCode.平安业务类型,"128","非货币基金认购申请"),
    平安业务类型_货币基金认购确认(DictCode.平安业务类型,"129","货币基金认购确认"),
    平安业务类型_非货币基金认购确认(DictCode.平安业务类型,"130","非货币基金认购确认"),
    平安业务类型_货币基金买入(DictCode.平安业务类型,"133","货币基金买入"),
    平安业务类型_非货币基金买入(DictCode.平安业务类型,"134","非货币基金买入"),
    平安业务类型_货币基金卖出(DictCode.平安业务类型,"135","货币基金卖出"),
    平安业务类型_非货币基金卖出(DictCode.平安业务类型,"136","非货币基金卖出"),
    //add by nixiukuan 20191113 start 质押式回购交易、债券借贷交易 -》质押券置换
    共通业务类型_质押券置换(DictCode.共通业务类型,"126","质押券置换"),
    质押券置换_置换方向_换入(DictCode.置换方向,"01","换入"),
    质押券置换_置换方向_换出(DictCode.置换方向,"02","换出"),
    质押券置换_置换结果_置换前(DictCode.置换结果,"01","置换前"),
    质押券置换_置换结果_置换后(DictCode.置换结果,"02","置换后"),
    交易方向_费用计提(DictCode.交易方向,"T57","费用计提"),
    业务类型_费用计提交易(DictCode.业务类型,"36","费用计提交易"),
    //add by nixiukuan 20191113 end 质押式回购交易、债券借贷交易 -》质押券置换
    共通业务类型_可转债转股交易(DictCode.共通业务类型,"TRD63","可转债转股交易"),

    共通业务类型_立项指令(DictCode.共通业务类型,"TRD75","立项指令"),

    // add by leipeng 20191123
    资产_负债类别_公募和私募基金(DictCode.资产_负债类别,"L01","公募基金/私募基金"),


	//added by shaohuchen 2019/11/23 start
	人行资产一级分类_现金(DictCode.人行资产一级分类,"P01","现金"),
	人行资产一级分类_存款(DictCode.人行资产一级分类,"P02","存款"),
	人行资产一级分类_可转让存单(DictCode.人行资产一级分类,"P03","可转让存单"),
	人行资产一级分类_债务证券(DictCode.人行资产一级分类,"P04","债务证券"),
	人行资产一级分类_贷款(DictCode.人行资产一级分类,"P05","贷款"),
	人行资产一级分类_资产收益权(DictCode.人行资产一级分类,"P06","资产收益权"),
	人行资产一级分类_股权及特定目的载体份额(DictCode.人行资产一级分类,"P07","股权及特定目的载体份额"),
	人行资产一级分类_金融衍生品(DictCode.人行资产一级分类,"P08","金融衍生品"),
	人行资产一级分类_黄金(DictCode.人行资产一级分类,"P09","黄金"),
	人行资产一级分类_非金融资产(DictCode.人行资产一级分类,"P10","非金融资产"),
	人行资产一级分类_应收账款(DictCode.人行资产一级分类,"P11","应收账款"),
	人行资产一级分类_应付账款(DictCode.人行资产一级分类,"P12","应付账款"),
	人行资产一级分类_其他负债(DictCode.人行资产一级分类,"P13","其他负债"),

	人行资产二级分类_境内存款(DictCode.人行资产二级分类,"C01","境内存款"),
	人行资产二级分类_境外存款(DictCode.人行资产二级分类,"C02","境外存款"),
	人行资产二级分类_非金融资产(DictCode.人行资产二级分类,"F01","非金融资产"),
	人行资产二级分类_黄金(DictCode.人行资产二级分类,"H01","黄金"),
	人行资产二级分类_境内金融衍生品(DictCode.人行资产二级分类,"J01","境内(金融衍生品)"),
	人行资产二级分类_境外金融衍生品(DictCode.人行资产二级分类,"J02","境外(金融衍生品)"),
	人行资产二级分类_同业存单(DictCode.人行资产二级分类,"K01","同业存单"),
	人行资产二级分类_大额存单(DictCode.人行资产二级分类,"K02","大额存单"),
	人行资产二级分类_应收账款(DictCode.人行资产二级分类,"P11","应收账款"),
	人行资产二级分类_应付账款(DictCode.人行资产二级分类,"P12","应付账款"),
	人行资产二级分类_其他负债(DictCode.人行资产二级分类,"P13","其他负债"),
	人行资产二级分类_贷款收益权(DictCode.人行资产二级分类,"Q01","贷款收益权"),
	人行资产二级分类_债务证券收益权(DictCode.人行资产二级分类,"Q02","债务证券收益权"),
	人行资产二级分类_应收账款收益权(DictCode.人行资产二级分类,"Q03","应收账款收益权"),
	人行资产二级分类_其他债权收益权(DictCode.人行资产二级分类,"Q04","其他债权收益权"),
	人行资产二级分类_股票收益权(DictCode.人行资产二级分类,"Q05","股票收益权"),
	人行资产二级分类_其他股权收益权(DictCode.人行资产二级分类,"Q06","其他股权收益权"),
	人行资产二级分类_物权资产收益权(DictCode.人行资产二级分类,"Q07","物权资产收益权"),
	人行资产二级分类_拆借和回购(DictCode.人行资产二级分类,"R01","拆借和回购"),
	人行资产二级分类_除回购或拆借外贷款(DictCode.人行资产二级分类,"R02","除回购或拆借外贷款"),
	人行资产二级分类_政府债券(DictCode.人行资产二级分类,"S01","政府债券"),
	人行资产二级分类_中央银行债券(DictCode.人行资产二级分类,"S02","中央银行债券"),
	人行资产二级分类_政策性金融债券(DictCode.人行资产二级分类,"S03","政策性金融债券"),
	人行资产二级分类_其他金融债券(DictCode.人行资产二级分类,"S04","其他金融债券"),
	人行资产二级分类_企业债券(DictCode.人行资产二级分类,"S05","企业债券"),
	人行资产二级分类_票据(DictCode.人行资产二级分类,"S06","票据"),
	人行资产二级分类_资产支持证券(DictCode.人行资产二级分类,"S07","资产支持证券"),
	人行资产二级分类_境外债券(DictCode.人行资产二级分类,"S08","境外债券"),
	人行资产二级分类_股票(DictCode.人行资产二级分类,"T01","股票"),
	人行资产二级分类_特定目的载体份额(DictCode.人行资产二级分类,"T02","特定目的载体份额"),
	人行资产二级分类_其他股权(DictCode.人行资产二级分类,"T03","其他股权"),
	人行资产二级分类_境外股权(DictCode.人行资产二级分类,"T04","境外股权"),
	人行资产二级分类_现金(DictCode.人行资产二级分类,"X01","现金"),

	人行资产三级分类_境内存款(DictCode.人行资产三级分类,"C01","境内存款"),
	人行资产三级分类_境外存款(DictCode.人行资产三级分类,"C02","境外存款"),
	人行资产三级分类_非金融资产(DictCode.人行资产三级分类,"F01","非金融资产"),
	人行资产三级分类_非金融企业股票(DictCode.人行资产三级分类,"G01","非金融企业股票"),
	人行资产三级分类_金融机构股票(DictCode.人行资产三级分类,"G02","金融机构股票"),
	人行资产三级分类_黄金(DictCode.人行资产三级分类,"H01","黄金"),
	人行资产三级分类_境内金融衍生品资产(DictCode.人行资产三级分类,"J01","境内(金融衍生品)资产"),
	人行资产三级分类_境外金融衍生品资产(DictCode.人行资产三级分类,"J02","境外(金融衍生品)资产"),
	人行资产三级分类_境内金融衍生品负债(DictCode.人行资产三级分类,"J03","境内(金融衍生品)负债"),
	人行资产三级分类_境外金融衍生品负债(DictCode.人行资产三级分类,"J04","境外(金融衍生品)负债"),
	人行资产三级分类_同业存单(DictCode.人行资产三级分类,"K01","同业存单"),
	人行资产三级分类_大额存单(DictCode.人行资产三级分类,"K02","大额存单"),
	人行资产三级分类_住户(DictCode.人行资产三级分类,"L01","住户"),
	人行资产三级分类_广义政府(DictCode.人行资产三级分类,"L02","广义政府"),
	人行资产三级分类_非金融企业  (DictCode.人行资产三级分类,"L03","非金融企业  "),
	人行资产三级分类_银行业存款类金融机构(DictCode.人行资产三级分类,"L04","银行业存款类金融机构"),
	人行资产三级分类_银行业非存款类金融机构(DictCode.人行资产三级分类,"L05","银行业非存款类金融机构"),
	人行资产三级分类_非银行业金融机构非中央交易对手(DictCode.人行资产三级分类,"L06","非银行业金融机构-非中央交易对手"),
	人行资产三级分类_非银行业金融机构中央交易对手(DictCode.人行资产三级分类,"L07","非银行业金融机构-中央交易对手"),
	人行资产三级分类_银行非保本理财(DictCode.人行资产三级分类,"L08","银行非保本理财"),
	人行资产三级分类_信托公司资管产品(DictCode.人行资产三级分类,"L09","信托公司资管产品"),
	人行资产三级分类_证券公司及其子公司资管产品(DictCode.人行资产三级分类,"L10","证券公司及其子公司资管产品"),
	人行资产三级分类_基金管理公司及其子公司专户(DictCode.人行资产三级分类,"L11","基金管理公司及其子公司专户"),
	人行资产三级分类_期货公司及其子公司资管产品(DictCode.人行资产三级分类,"L12","期货公司及其子公司资管产品"),
	人行资产三级分类_保险资管产品(DictCode.人行资产三级分类,"L13","保险资管产品"),
	人行资产三级分类_金融资产投资公司资管产品(DictCode.人行资产三级分类,"L14","金融资产投资公司资管产品"),
	人行资产三级分类_公募基金(DictCode.人行资产三级分类,"L15","公募基金"),
	人行资产三级分类_私募机构私募基金(DictCode.人行资产三级分类,"L16","私募机构私募基金"),
	人行资产三级分类_境外(DictCode.人行资产三级分类,"L98","境外"),
	人行资产三级分类_其他特定目的载体(DictCode.人行资产三级分类,"L99","其他特定目的载体"),
	人行资产三级分类_银行非保本理财_M01(DictCode.人行资产三级分类,"M01","银行非保本理财"),
	人行资产三级分类_信托公司资管产品_M02(DictCode.人行资产三级分类,"M02","信托公司资管产品"),
	人行资产三级分类_证券公司及其子公司资管产品_M03(DictCode.人行资产三级分类,"M03","证券公司及其子公司资管产品"),
	人行资产三级分类_基金管理公司及其子公司专户_M04(DictCode.人行资产三级分类,"M04","基金管理公司及其子公司专户"),
	人行资产三级分类_期货公司及其子公司资管产品_M05(DictCode.人行资产三级分类,"M05","期货公司及其子公司资管产品"),
	人行资产三级分类_保险资管产品_M06(DictCode.人行资产三级分类,"M06","保险资管产品"),
	人行资产三级分类_金融资产投资公司资管产品_M07(DictCode.人行资产三级分类,"M07","金融资产投资公司资管产品"),
	人行资产三级分类__公募基金_M08(DictCode.人行资产三级分类,"M08","公募基金"),
	人行资产三级分类_私募机构私募基金_M09(DictCode.人行资产三级分类,"M09","私募机构私募基金"),
	人行资产三级分类_其他特定目的载体_M99(DictCode.人行资产三级分类,"M99","其他特定目的载体"),
	人行资产三级分类_非金融企业股权(DictCode.人行资产三级分类,"O01","非金融企业股权"),
	人行资产三级分类_金融机构股权(DictCode.人行资产三级分类,"O02","金融机构股权"),
	人行资产三级分类_应收账款(DictCode.人行资产三级分类,"P11","应收账款"),
	人行资产三级分类_应付账款(DictCode.人行资产三级分类,"P12","应付账款"),
	人行资产三级分类_其他负债(DictCode.人行资产三级分类,"P13","其他负债"),
	人行资产三级分类_贷款收益权(DictCode.人行资产三级分类,"Q01","贷款收益权"),
	人行资产三级分类_债务证券收益权(DictCode.人行资产三级分类,"Q02","债务证券收益权"),
	人行资产三级分类_应收账款收益权(DictCode.人行资产三级分类,"Q03","应收账款收益权"),
	人行资产三级分类_其他债权收益权(DictCode.人行资产三级分类,"Q04","其他债权收益权"),
	人行资产三级分类_股票收益权(DictCode.人行资产三级分类,"Q05","股票收益权"),
	人行资产三级分类_其他股权收益权(DictCode.人行资产三级分类,"Q06","其他股权收益权"),
	人行资产三级分类_物权资产收益权(DictCode.人行资产三级分类,"Q07","物权资产收益权"),
	人行资产三级分类_除回购或拆借外贷款(DictCode.人行资产三级分类,"R02","除回购或拆借外贷款"),
	人行资产三级分类_政府债券(DictCode.人行资产三级分类,"S01","政府债券"),
	人行资产三级分类_中央银行债券(DictCode.人行资产三级分类,"S02","中央银行债券"),
	人行资产三级分类_政策性金融债券(DictCode.人行资产三级分类,"S03","政策性金融债券"),
	人行资产三级分类_其他金融债券(DictCode.人行资产三级分类,"S04","其他金融债券"),
	人行资产三级分类_企业债券(DictCode.人行资产三级分类,"S05","企业债券"),
	人行资产三级分类_票据(DictCode.人行资产三级分类,"S06","票据"),
	人行资产三级分类_资产支持证券(DictCode.人行资产三级分类,"S07","资产支持证券"),
	人行资产三级分类_境外债券(DictCode.人行资产三级分类,"S08","境外债券"),
	人行资产三级分类_境外股权(DictCode.人行资产三级分类,"T04","境外股权"),
	人行资产三级分类_现金(DictCode.人行资产三级分类,"X01","现金"),
	//added by shaohuchen 2019/11/23 end
    发行机构类型_按规模划分_中小微企业(DictCode.发行机构类型_按规模划分,"01","中小微企业"),

    //add by wangxiaoyong 2019-11-29 end
    共通业务类型_交易费用管理(DictCode.共通业务类型,"TRD84","交易费用管理"),

    //行内资产一级分类
    行内资产一级分类_同业融资类(DictCode.人行资产一级分类,"01","同业融资类"),
    行内资产一级分类_债券类信用债(DictCode.人行资产一级分类,"02","债券类-信用债"),
    行内资产一级分类_债券类利率债(DictCode.人行资产一级分类,"03","债券类-利率债"),
    行内资产一级分类_其他债权类(DictCode.人行资产一级分类,"04","其他债权类"),

    平安业务类型_货币型产品轧差清算(DictCode.平安业务类型,"140","货币型产品轧差清算"),

    //行内资产一级分类
    资产一级分类_同业融资类(DictCode.资产一级分类,"01","同业融资类"),
    资产一级分类_债券类信用债(DictCode.资产一级分类,"02","债券类-信用债"),
    资产一级分类_债券类利率债(DictCode.资产一级分类,"03","债券类-利率债"),
    资产一级分类_其他债权类(DictCode.资产一级分类,"04","其他债权类"),
	交易方向_退款到账(DictCode.交易方向,"T58","退款到账"),
    //add daiguofu 20191225
    共通业务类型_产品规划信息维护(DictCode.共通业务类型,"PRDPLAN08","产品规划信息维护"),
    策略分类_投资策略(DictCode.策略分类,"01","投资策略"),
    策略分类_规划策略(DictCode.策略分类,"02","规划策略"),
    /**计提份额占比收息 add  by yanya on 20191219 **/
    计提份额占比收息_按占比收息(DictCode.计提份额占比收息,"01","按占比收息"),
    计提份额占比收息_不按占比收息(DictCode.计提份额占比收息,"02","不按占比收息"),
    存款类资产类型_活期存放(DictCode.存款类资产类型,"D03","活期存放"),
    现金流二级类型_罚息(DictCode.现金流二级类型,"C19","罚息"),
    共通业务类型_逾期计息要素维护(DictCode.共通业务类型,"FINASSET20","逾期计息要素维护"),
    共通业务类型_场外期权类资产信息(DictCode.共通业务类型,"ETR22","场外期权类资产信息"),
    应收款类型_逾期未收本金(DictCode.应收款类型,"01","逾期未收本金"),
    应收款类型_逾期未收利息(DictCode.应收款类型,"02","逾期未收利息"),
    应收款类型_还本未收利息(DictCode.应收款类型,"03","还本未收利息"),
    应收款类型_卖出未收利息(DictCode.应收款类型,"04","卖出未收利息"),
    应收款类型_买入未付利息(DictCode.应收款类型,"05","买入未付利息"),
    共通业务类型_已到期资产转让(DictCode.共通业务类型,"TRD67","已到期资产转让"),
    共通业务类型_已到期资产存续期(DictCode.共通业务类型,"TRD68","已到期资产存续期"),
    平安业务类型_已到期资产转让(DictCode.平安业务类型,"141","已到期资产转让"),
    平安业务类型_已到期资产存续期(DictCode.平安业务类型,"144","已到期资产存续期"),
    罚息计提基数_逾期本金(DictCode.罚息计提基数,"01","逾期本金"),
    罚息计提基数_逾期利息(DictCode.罚息计提基数,"02","逾期利息"),
    罚息计提基数_逾期本息和(DictCode.罚息计提基数,"03","逾期本息和"),
    现金流类型_罚息收息(DictCode.现金流类型,"06","罚息收息"),
    计息利率方式_买断利率计提(DictCode.计息利率方式,"01","买断利率计提"),
    计息利率方式_净投资收益率计提(DictCode.计息利率方式,"02","净投资收益率计提"),
    交易日历_中国法定节假日(DictCode.交易日历,"01","中国法定节假日"),
    展示维度_日(DictCode.展示维度,"01","日"),
    展示维度_周(DictCode.展示维度,"02","周"),
    展示维度_月(DictCode.展示维度,"03","月"),
    展示维度_短期(DictCode.展示维度,"04","短期"),

    人行产品运作模式_开放式净值型(DictCode.人行产品运作模式,"2","开放式净值型"),
    人行产品运作模式_开放式非净值型(DictCode.人行产品运作模式,"3","开放式非净值型"),
    人行产品运作模式_封闭式净值型(DictCode.人行产品运作模式,"4","封闭式净值型"),
    人行产品运作模式_封闭式非净值型(DictCode.人行产品运作模式,"5","封闭式非净值型"),

    人行客户类型_单位(DictCode.人行客户类型,"1","单位"),
    人行客户类型_个人(DictCode.人行客户类型,"2","个人"),
    人行客户类型_单位及个人(DictCode.人行客户类型,"3","单位及个人"),
    人行客户类型_住户(DictCode.人行客户类型,"4","住户"),
    人行客户类型_广义政府(DictCode.人行客户类型,"5","广义政府"),
    人行客户类型_非金融企业(DictCode.人行客户类型,"6","非金融企业"),
    人行客户类型_金融机构_实体(DictCode.人行客户类型,"7","金融机构（实体）"),
    人行客户类型_特定目的载体(DictCode.人行客户类型,"8","特定目的载体"),
    人行客户类型_境外(DictCode.人行客户类型,"9","境外"),
    批处理系统代码_估值(DictCode.批处理系统代码,"VAL","估值"),
    批处理系统代码_投管(DictCode.批处理系统代码,"INV","投管"),
    批处理系统代码_信批(DictCode.批处理系统代码,"DIS","信批"),
    批处理系统代码_中债(DictCode.批处理系统代码,"SVR","中债"),
    批处理任务组类型_T日(DictCode.批处理任务组类型,"01","T日"),
    批处理任务组类型_日切(DictCode.批处理任务组类型,"99","日切"),
    批处理任务组类型_T1日(DictCode.批处理任务组类型,"02","T+1日"),
    结息方式_结转为本金(DictCode.结息方式,"01","结转为本金"),
    结息方式_现金结息(DictCode.结息方式,"02","现金结息"),
    /**发行规划试算 	20191223 **/
    共通业务类型_发行规划试算(DictCode.共通业务类型,"PRDPLAN07","发行规划试算"),
    //查询口径 yzg 20191224
    查询口径_全部查询(DictCode.查询口径,"01","全部查询"),
    查询扣经_按产品系列(DictCode.查询口径,"02","按产品系列"),
  //从DictCodeListExt1移动都DictCodeListExt3中，新增 03：无需处理 add by chendijun 2019/12/3
    贴补状态_已贴补(DictCode.贴补状态,"01","已贴补"),
    贴补状态_未贴补(DictCode.贴补状态,"02","未贴补"),
    贴补状态_无需处理(DictCode.贴补状态,"03","无需处理"),
    //修正场景 yzg 20191226
    修正场景_高悲观(DictCode.修正场景,"01","高悲观"),
    修正场景_中悲观(DictCode.修正场景,"02","中悲观"),
    修正场景_轻悲观(DictCode.修正场景,"03","轻悲观"),
    修正场景_中性(DictCode.修正场景,"04","中性"),
    修正场景_轻乐观(DictCode.修正场景,"05","轻乐观"),
    修正场景_中乐观(DictCode.修正场景,"06","中乐观"),
    修正场景_高乐观(DictCode.修正场景,"07","高乐观"),
    共通业务类型_战术配置优化(DictCode.共通业务类型,"PRDPLAN02","战术配置优化"),
    共通业务类型_资产分类管理(DictCode.共通业务类型,"PRDPLAN01","资产分类管理"),
    /**PB要素类型 add by caoxue 2019-12-24 start**/
	PB要素类型_产品(DictCode.PB要素类型,"0","产品"),
	PB要素类型_子组合(DictCode.PB要素类型,"1","子组合"),
	/**PB要素类型 add by caoxue 2019-12-24 end**/
	投资策略类型_单一资产策略(DictCode.投资策略类型, "01", "单一资产策略"),
	投资策略类型_混合资产策略(DictCode.投资策略类型, "02", "混合资产策略"),

	/**增加 交易方向_提前行权 和 交易方向_到期行权**/
	交易方向_提前行权(DictCode.交易方向,"T59","提前行权"),
	交易方向_到期行权(DictCode.交易方向,"T60","到期行权"),

    下钻层级_资产一级分类(DictCode.下钻层级,"01","资产一级分类"),
    下钻层级_资产二级分类(DictCode.下钻层级,"02","资产二级分类"),
    下钻层级_资产三级分类(DictCode.下钻层级,"03","资产三级分类"),
    下钻层级_资产四级分类(DictCode.下钻层级,"04","资产四级分类"),
    下钻层级_资产五级分类(DictCode.下钻层级,"05","资产五级分类"),
    展示方式_单组合汇总(DictCode.展示方式,"01","单组合汇总"),
    展示方式_多组合汇总(DictCode.展示方式,"02","多组合汇总"),
    指标类型代码_综合指标(DictCode.指标类型代码,"01","综合指标"),
    指标类型代码_债券指标(DictCode.指标类型代码,"02","债券指标"),
    指标类型代码_股票指标(DictCode.指标类型代码,"03","股票指标"),

    含权信息_永续(DictCode.含权信息,"01","永续"),
    含权信息_赎回权(DictCode.含权信息,"02","赎回权"),
    含权信息_回售权(DictCode.含权信息,"03","回售权"),
    含权信息_赎回权_回售权(DictCode.含权信息,"04","赎回权、回售权"),
    共通业务类型_场外期权(DictCode.共通业务类型,"38","场外期权"),
    //DictCodeList 文件超长移动 guyunfei 20200103 start
    拆分标识_已拆分(DictCode.拆分标识, "01", "已拆分"),
    拆分标识_未拆分(DictCode.拆分标识, "02", "未拆分"),
    //DictCodeList 文件超长移动 guyunfei 20200103 end
    基准类型_2_合约标的(DictCode.基准类型_2,"07","合约标的"),    //add by tanxuan 20200102 start
    估值表类型_待抵扣投资收益税(DictCode.估值表类型,"39","待抵扣投资收益税"),
    估值表类型_待抵扣暂估投资收益税(DictCode.估值表类型,"40","待抵扣暂估投资收益税"),
    //add by tanxuan 20200102 end
    计算模式_计算回购利率(DictCode.计算模式,"01","计算模式_计算回购利率"),
    计算模式_计算首次净价(DictCode.计算模式,"02","计算模式_计算首次净价"),
    计算模式_计算到期净价(DictCode.计算模式,"03","计算模式_计算到期净价"),
    //add by hpp 2020-01-07 start
    借款人类型_住户(DictCode.借款人类型,"1","住户"),
    借款人类型_广义政府(DictCode.借款人类型,"2","广义政府"),
    借款人类型_非金融企业(DictCode.借款人类型,"3","非金融企业"),
    借款人类型_金融机构(DictCode.借款人类型,"4","金融机构（实体）"),
    借款人类型_特定目的载体(DictCode.借款人类型,"5","特定目的载体"),
    借款人类型_境外(DictCode.借款人类型,"6","境外"),

    新人行增信机构类型_住户(DictCode.新人行增信机构类型,"1","住户"),
    新人行增信机构类型_广义政府(DictCode.新人行增信机构类型,"2","广义政府"),
    新人行增信机构类型_非金融企业(DictCode.新人行增信机构类型,"3","非金融性企业"),
    新人行增信机构类型_金融机构(DictCode.新人行增信机构类型,"4","金融机构（实体）"),
    新人行增信机构类型_特定目的载体(DictCode.新人行增信机构类型,"5","特定目的载体"),
    新人行增信机构类型_境外(DictCode.新人行增信机构类型,"6","境外"),


    经济成分一级_公有控股经济(DictCode.经济成分一级,"A","公有控股经济"),
    经济成分一级_非公有控股经济(DictCode.经济成分一级,"B","非公有控股经济"),
    经济成分二级_国有控股(DictCode.经济成分二级,"A01","国有控股"),
    经济成分二级_集体控股(DictCode.经济成分二级,"A02","集体控股"),
    经济成分二级_私人控股(DictCode.经济成分二级,"B01","私人控股"),
    经济成分二级_港澳台控股(DictCode.经济成分二级,"B02","港澳台控股"),
    经济成分二级_外商控股(DictCode.经济成分二级,"B03","外商控股"),
    经济成分三级_国有相对控股(DictCode.经济成分三级,"A0101","国有相对控股"),
    经济成分三级_国有绝对控股(DictCode.经济成分三级,"A0102","国有绝对控股"),
    经济成分三级_集体相对控股(DictCode.经济成分三级,"A0201","集体相对控股"),
    经济成分三级_集体绝对控股(DictCode.经济成分三级,"A0202","集体绝对控股"),
    经济成分三级_私人相对控股(DictCode.经济成分三级,"B0101","私人相对控股"),
    经济成分三级_私人绝对控股(DictCode.经济成分三级,"B0102","私人绝对控股"),
    经济成分三级_港澳台相对控股(DictCode.经济成分三级,"B0201","港澳台相对控股"),
    经济成分三级_港澳台绝对控股(DictCode.经济成分三级,"B0202","港澳台绝对控股"),
    经济成分三级_外商相对控股(DictCode.经济成分三级,"B0301","外商相对控股"),
    经济成分三级_外商绝对控股(DictCode.经济成分三级,"B0302","外商绝对控股"),
    行业大类编码_农业(DictCode.行业大类编码,"1","农业"),
    行业大类编码_林业(DictCode.行业大类编码,"2","林业"),
    行业大类编码_畜牧业(DictCode.行业大类编码,"3","畜牧业"),
    行业大类编码_渔业(DictCode.行业大类编码,"4","渔业"),
    行业大类编码_农林牧渔专业及辅助性活动(DictCode.行业大类编码,"5","农、林、牧、渔专业及辅助性活动"),
    行业大类编码_煤炭开采和洗选业(DictCode.行业大类编码,"6","煤炭开采和洗选业"),
    行业大类编码_石油和天然气开采业(DictCode.行业大类编码,"7","石油和天然气开采业"),
    行业大类编码_黑色金属矿采选业(DictCode.行业大类编码,"8","黑色金属矿采选业"),
    行业大类编码_有色金属矿采选业(DictCode.行业大类编码,"9","有色金属矿采选业"),
    行业大类编码_非金属矿采选业(DictCode.行业大类编码,"10","非金属矿采选业"),
    行业大类编码_开采专业及辅助性活动(DictCode.行业大类编码,"11","开采专业及辅助性活动"),
    行业大类编码_其他采矿业(DictCode.行业大类编码,"12","其他采矿业"),
    行业大类编码_农副食品加工业(DictCode.行业大类编码,"13","农副食品加工业"),
    行业大类编码_食品制造业(DictCode.行业大类编码,"14","食品制造业"),
    行业大类编码_酒饮料和精制茶制造业(DictCode.行业大类编码,"15","酒、饮料和精制茶制造业"),
    行业大类编码_烟草制品业(DictCode.行业大类编码,"16","烟草制品业"),
    行业大类编码_纺织业(DictCode.行业大类编码,"17","纺织业"),
    行业大类编码_纺织服装服饰业(DictCode.行业大类编码,"18","纺织服装、服饰业"),
    行业大类编码_皮革毛皮羽毛及其制品和制鞋业(DictCode.行业大类编码,"19","皮革、毛皮、羽毛及其制品和制鞋业"),
    行业大类编码_木材加工和木竹藤棕草制品业(DictCode.行业大类编码,"20","木材加工和木、竹、藤、棕、草制品业"),
    行业大类编码_家具制造业(DictCode.行业大类编码,"21","家具制造业"),
    行业大类编码_造纸和纸制品业(DictCode.行业大类编码,"22","造纸和纸制品业"),
    行业大类编码_印刷和记录媒介复制业(DictCode.行业大类编码,"23","印刷和记录媒介复制业"),
    行业大类编码_文教工美体育和娱乐用品制造业(DictCode.行业大类编码,"24","文教、工美、体育和娱乐用品制造业"),
    行业大类编码_石油煤炭及其他燃料加工业(DictCode.行业大类编码,"25","石油、煤炭及其他燃料加工业"),
    行业大类编码_化学原料和化学制品制造业(DictCode.行业大类编码,"26","化学原料和化学制品制造业"),
    行业大类编码_医药制造业(DictCode.行业大类编码,"27","医药制造业"),
    行业大类编码_化学纤维制造业(DictCode.行业大类编码,"28","化学纤维制造业"),
    行业大类编码_橡胶和塑料制品业(DictCode.行业大类编码,"29","橡胶和塑料制品业"),
    行业大类编码_非金属矿物制品业(DictCode.行业大类编码,"30","非金属矿物制品业"),
    行业大类编码_黑色金属冶炼和压延加工业(DictCode.行业大类编码,"31","黑色金属冶炼和压延加工业"),
    行业大类编码_有色金属冶炼和压延加工业(DictCode.行业大类编码,"32","有色金属冶炼和压延加工业"),
    行业大类编码_金属制品业(DictCode.行业大类编码,"33","金属制品业"),
    行业大类编码_通用设备制造业(DictCode.行业大类编码,"34","通用设备制造业"),
    行业大类编码_专用设备制造业(DictCode.行业大类编码,"35","专用设备制造业"),
    行业大类编码_汽车制造业(DictCode.行业大类编码,"36","汽车制造业"),
    行业大类编码_铁路船舶航空航天和其他运输设备制造业(DictCode.行业大类编码,"37","铁路、船舶、航空航天和其他运输设备制造业"),
    行业大类编码_电气机械和器材制造业(DictCode.行业大类编码,"38","电气机械和器材制造业"),
    行业大类编码_计算机通信和其他电子设备制造业(DictCode.行业大类编码,"39","计算机、通信和其他电子设备制造业"),
    行业大类编码_仪器仪表制造业(DictCode.行业大类编码,"40","仪器仪表制造业"),
    行业大类编码_其他制造业(DictCode.行业大类编码,"41","其他制造业"),
    行业大类编码_废弃资源综合利用业(DictCode.行业大类编码,"42","废弃资源综合利用业"),
    行业大类编码_金属制品机械和设备修理业(DictCode.行业大类编码,"43","金属制品、机械和设备修理业"),
    行业大类编码_电力热力生产和供应业(DictCode.行业大类编码,"44","电力、热力生产和供应业"),
    行业大类编码_燃气生产和供应业(DictCode.行业大类编码,"45","燃气生产和供应业"),
    行业大类编码_水的生产和供应业(DictCode.行业大类编码,"46","水的生产和供应业"),
    行业大类编码_房屋建筑业(DictCode.行业大类编码,"47","房屋建筑业"),
    行业大类编码_土木工程建筑业(DictCode.行业大类编码,"48","土木工程建筑业"),
    行业大类编码_建筑安装业(DictCode.行业大类编码,"49","建筑安装业"),
    行业大类编码_建筑装饰装修和其他建筑业(DictCode.行业大类编码,"50","建筑装饰、装修和其他建筑业"),
    行业大类编码_批发业(DictCode.行业大类编码,"51","批发业"),
    行业大类编码_零售业(DictCode.行业大类编码,"52","零售业"),
    行业大类编码_铁路运输业(DictCode.行业大类编码,"53","铁路运输业"),
    行业大类编码_道路运输业(DictCode.行业大类编码,"54","道路运输业"),
    行业大类编码_水上运输业(DictCode.行业大类编码,"55","水上运输业"),
    行业大类编码_航空运输业(DictCode.行业大类编码,"56","航空运输业"),
    行业大类编码_管道运输业(DictCode.行业大类编码,"57","管道运输业"),
    行业大类编码_多式联运和运输代理业(DictCode.行业大类编码,"58","多式联运和运输代理业"),
    行业大类编码_装卸搬运和仓储业(DictCode.行业大类编码,"59","装卸搬运和仓储业"),
    行业大类编码_邮政业(DictCode.行业大类编码,"60","邮政业"),
    行业大类编码_住宿业(DictCode.行业大类编码,"61","住宿业"),
    行业大类编码_餐饮业(DictCode.行业大类编码,"62","餐饮业"),
    行业大类编码_电信广播电视和卫星传输服务(DictCode.行业大类编码,"63","电信、广播电视和卫星传输服务"),
    行业大类编码_互联网和相关服务(DictCode.行业大类编码,"64","互联网和相关服务"),
    行业大类编码_软件和信息技术服务业(DictCode.行业大类编码,"65","软件和信息技术服务业"),
    行业大类编码_货币金融服务(DictCode.行业大类编码,"66","货币金融服务"),
    行业大类编码_资本市场服务(DictCode.行业大类编码,"67","资本市场服务"),
    行业大类编码_保险业(DictCode.行业大类编码,"68","保险业"),
    行业大类编码_其他金融业(DictCode.行业大类编码,"69","其他金融业"),
    行业大类编码_房地产业(DictCode.行业大类编码,"70","房地产业"),
    行业大类编码_租赁业(DictCode.行业大类编码,"71","租赁业"),
    行业大类编码_商务服务业(DictCode.行业大类编码,"72","商务服务业"),
    行业大类编码_研究和试验发展(DictCode.行业大类编码,"73","研究和试验发展"),
    行业大类编码_专业技术服务业(DictCode.行业大类编码,"74","专业技术服务业"),
    行业大类编码_科技推广和应用服务(DictCode.行业大类编码,"75","科技推广和应用服务"),
    行业大类编码_水利管理业(DictCode.行业大类编码,"76","水利管理业"),
    行业大类编码_生态保护和环境治理业(DictCode.行业大类编码,"77","生态保护和环境治理业"),
    行业大类编码_公共设施管理业(DictCode.行业大类编码,"78","公共设施管理业"),
    行业大类编码_土地管理业(DictCode.行业大类编码,"79","土地管理业"),
    行业大类编码_居民服务业(DictCode.行业大类编码,"80","居民服务业"),
    行业大类编码_机动车电子产品和日用产品修理业(DictCode.行业大类编码,"81","机动车、电子产品和日用产品修理业"),
    行业大类编码_其他服务业(DictCode.行业大类编码,"82","其他服务业"),
    行业大类编码_教育(DictCode.行业大类编码,"83","教育"),
    行业大类编码_卫生(DictCode.行业大类编码,"84","卫生"),
    行业大类编码_社会工作(DictCode.行业大类编码,"85","社会工作"),
    行业大类编码_新闻和出版业(DictCode.行业大类编码,"86","新闻和出版业"),
    行业大类编码_广播电视电影和影视录音制作业(DictCode.行业大类编码,"87","广播、电视、电影和影视录音制作业"),
    行业大类编码_文化艺术业(DictCode.行业大类编码,"88","文化艺术业"),
    行业大类编码_体育(DictCode.行业大类编码,"89","体育"),
    行业大类编码_娱乐业(DictCode.行业大类编码,"90","娱乐业"),
    行业大类编码_中国共产党机关(DictCode.行业大类编码,"91","中国共产党机关"),
    行业大类编码_国家机构(DictCode.行业大类编码,"92","国家机构"),
    行业大类编码_人民政协民主党派(DictCode.行业大类编码,"93","人民政协、民主党派"),
    行业大类编码_社会保障(DictCode.行业大类编码,"94","社会保障"),
    行业大类编码_群众团体社会团体和其他成员组织(DictCode.行业大类编码,"95","群众团体、社会团体和其他成员组织"),
    行业大类编码_基层群众自治组织及其他组织(DictCode.行业大类编码,"96","基层群众自治组织及其他组织"),
    行业大类编码_国际组织(DictCode.行业大类编码,"97","国际组织"),
    行业大类编码_个人贷款(DictCode.行业大类编码,"98","个人贷款"),
    行业大类编码_对境外贷款(DictCode.行业大类编码,"99","对境外贷款"),
    行业大类编码_境内个人(DictCode.行业大类编码,"100","境内个人"),
    行业大类编码_非居民(DictCode.行业大类编码,"200","非居民"),
    行业门内编码_境内个人(DictCode.行业门内编码,"1","境内个人"),
    行业门内编码_非居民(DictCode.行业门内编码,"2","非居民"),
    行业门内编码_农林牧渔业(DictCode.行业门内编码,"A","农、林、牧、渔业"),
    行业门内编码_采矿业(DictCode.行业门内编码,"B","采矿业"),
    行业门内编码_制造业(DictCode.行业门内编码,"C","制造业"),
    行业门内编码_电力热力燃气及水生产和供应业(DictCode.行业门内编码,"D","电力、热力、燃气及水生产和供应业"),
    行业门内编码_建筑业(DictCode.行业门内编码,"E","建筑业"),
    行业门内编码_批发和零售业(DictCode.行业门内编码,"F","批发和零售业"),
    行业门内编码_交通运输仓储和邮政业(DictCode.行业门内编码,"G","交通运输、仓储和邮政业"),
    行业门内编码_住宿和餐饮业(DictCode.行业门内编码,"H","住宿和餐饮业"),
    行业门内编码_信息传输软件和信息技术服务业(DictCode.行业门内编码,"I","信息传输、软件和信息技术服务业"),
    行业门内编码_金融业(DictCode.行业门内编码,"J","金融业"),
    行业门内编码_房地产(DictCode.行业门内编码,"K","房地产"),
    行业门内编码_租赁和商务服务业(DictCode.行业门内编码,"L","租赁和商务服务业"),
    行业门内编码_科学研究和技术服务业(DictCode.行业门内编码,"M","科学研究和技术服务业"),
    行业门内编码_水利环境和公共设施管理业(DictCode.行业门内编码,"N","水利、环境和公共设施管理业"),
    行业门内编码_居民服务修理和其他服务业(DictCode.行业门内编码,"O","居民服务、修理和其他服务业"),
    行业门内编码_教育(DictCode.行业门内编码,"P","教育"),
    行业门内编码_卫生和社会工作(DictCode.行业门内编码,"Q","卫生和社会工作"),
    行业门内编码_文化体育和娱乐业(DictCode.行业门内编码,"R","文化、体育和娱乐业"),
    行业门内编码_公共管理社会保障和社会组织(DictCode.行业门内编码,"S","公共管理、社会保障和社会组织"),
    行业门内编码_国际组织(DictCode.行业门内编码,"T","国际组织"),
    行业门内编码_对境外贷款(DictCode.行业门内编码,"U","对境外贷款"),
    行业门内编码_个人贷款及透支(DictCode.行业门内编码,"V","个人贷款及透支"),
    利率是否固定_固定利率(DictCode.利率是否固定,"RF01","固定利率"),
    利率是否固定_浮动利率(DictCode.利率是否固定,"RF02","浮动利率"),
    贷款担保方式_质押贷款(DictCode.贷款担保方式,"A","质押贷款"),
    贷款担保方式_房地产抵押贷款(DictCode.贷款担保方式,"B01","房地产抵押贷款"),
    贷款担保方式_其他抵押贷款(DictCode.贷款担保方式,"B99","其他抵押贷款"),
    贷款担保方式_联保贷款(DictCode.贷款担保方式,"C01","联保贷款"),
    贷款担保方式_其他保证贷款(DictCode.贷款担保方式,"C99","其他保证贷款"),
    贷款担保方式_信用免担保贷款(DictCode.贷款担保方式,"D","信用/免担保贷款"),
    贷款担保方式_组合担保(DictCode.贷款担保方式,"E","组合担保"),
    贷款担保方式_其他(DictCode.贷款担保方式,"Z","其他"),
    贷款产品类别_个人住房贷款(DictCode.贷款产品类别,"F0211","个人住房贷款"),
    贷款产品类别_个人汽车消费贷款(DictCode.贷款产品类别,"F0212","个人汽车消费贷款"),
    贷款产品类别_国家助学贷款(DictCode.贷款产品类别,"F02131","国家助学贷款"),
    贷款产品类别_一般商业性助学贷款(DictCode.贷款产品类别,"F02132","一般商业性助学贷款"),
    贷款产品类别_其他消费贷款(DictCode.贷款产品类别,"F0219","其他消费贷款"),
    贷款产品类别_经营贷款(DictCode.贷款产品类别,"F022","经营贷款"),
    贷款产品类别_固定资产贷款(DictCode.贷款产品类别,"F023","固定资产贷款"),
    贷款产品类别_承兑垫款(DictCode.贷款产品类别,"F051","承兑垫款"),
    贷款产品类别_担保垫款(DictCode.贷款产品类别,"F052","担保垫款"),
    贷款产品类别_信用证垫款(DictCode.贷款产品类别,"F053","信用证垫款"),
    贷款产品类别_其他垫款(DictCode.贷款产品类别,"F059","其他垫款"),
    贷款产品类别_国际贸易融资(DictCode.贷款产品类别,"F081","国际贸易融资"),
    贷款产品类别_国内贸易融资(DictCode.贷款产品类别,"F082","国内贸易融资"),
    贷款产品类别_融资租赁(DictCode.贷款产品类别,"F09","融资租赁"),
    贷款产品类别_打包信贷受让资产(DictCode.贷款产品类别,"F10","打包信贷受让资产"),
    贷款产品类别_转贷款(DictCode.贷款产品类别,"F11","转贷款"),
    贷款产品类别_并购贷款(DictCode.贷款产品类别,"F12","并购贷款"),
    贷款产品类别_其他贷款(DictCode.贷款产品类别,"F99","其他贷款"),
    贷款质量_正常类贷款(DictCode.贷款质量,"FQ01","正常类贷款"),
    贷款质量_关注类贷款(DictCode.贷款质量,"FQ02","关注类贷款"),
    贷款质量_次级类贷款(DictCode.贷款质量,"FQ03","次级类贷款"),
    贷款质量_可疑类贷款(DictCode.贷款质量,"FQ04","可疑类贷款"),
    贷款质量_损失类贷款(DictCode.贷款质量,"FQ05","损失类贷款"),
    贷款状态_正常(DictCode.贷款状态,"FS01","正常"),
    贷款状态_展期(DictCode.贷款状态,"FS02","展期"),
    贷款状态_逾期(DictCode.贷款状态,"FS03","逾期"),
    贷款种类_发放贷款(DictCode.贷款种类,"1","发放贷款"),
    贷款种类_转让贷款(DictCode.贷款种类,"2","转让贷款"),
    贷款种类_其他债权收益权(DictCode.贷款种类,"3","其他债权收益权"),
    企业规模_大型(DictCode.企业规模,"CS01","大型"),
    企业规模_中型(DictCode.企业规模,"CS02","中型"),
    企业规模_小型(DictCode.企业规模,"CS03","小型"),
    企业规模_微型(DictCode.企业规模,"CS04","微型"),
    企业规模_其他(DictCode.企业规模,"CS05","其他"),

    //add by hpp 2020-01-07 end
    //add by jyl 20200107
    共通业务类型_产品风险等级评定(DictCode.共通业务类型,"REQ06","产品风险等级评定"),
 // 质押券优先级设置字典 2020-1-8 lizhi start
    质押优先级_极高(DictCode.质押优先级,"01","极高"),
    质押优先级_高(DictCode.质押优先级,"02","高"),
    质押优先级_中(DictCode.质押优先级,"03","中"),
    质押优先级_低(DictCode.质押优先级,"04","低"),
    质押优先级_极低(DictCode.质押优先级,"05","极低"),
    收付方向_收取(DictCode.收付方向,"03","收取"),
    剩余期限_剩余期限短的优先质押(DictCode.剩余期限,"01","剩余期限短的优先质押"),
    剩余期限_剩余期限长的优先质押(DictCode.剩余期限,"02","剩余期限长的优先质押"),
    收付方向_支付(DictCode.收付方向,"04","支付"),
    债项评级_债项评级低的优先质押(DictCode.债项评级,"01","债项评级低的优先质押"),
    债项评级_债项评级高的优先质押(DictCode.债项评级,"02","债项评级高的优先质押"),
    交易类型_交易数据(DictCode.交易类型,"03","交易数据"),
    交易类型_投资指令(DictCode.交易类型,"02","投资指令"),
    交易类型_预录入(DictCode.交易类型,"01","预录入"),
    // 质押券优先级设置字典 2020-1-8 lizhi end
    //add by likai 2020-1-14
    共通业务类型_期权投资委托(DictCode.共通业务类型,"ETR21","期权投资委托"),

    减值测算方式_外部评估(DictCode.减值测算方式,"01","外部评估"),
    减值测算方式_预期信用损失模型(DictCode.减值测算方式,"02","预期信用损失模型"),
    减值生成方式_计提批处理(DictCode.减值生成方式,"01","计提批处理"),
    减值生成方式_交易批处理(DictCode.减值生成方式,"02","交易批处理"),
    减值生成方式_减值计提批处理(DictCode.减值生成方式,"03","减值计提批处理"),

    报送文件类别_投资者身份信息登记(DictCode.报送文件类别,"02","投资者身份信息登记"),
    报送文件类别_投资者持有信息登记(DictCode.报送文件类别,"03","投资者持有信息登记"),    减值录入方式_按比例减值(DictCode.减值录入方式,"01","按比例减值"),
    共通业务类型_资产减值管理(DictCode.共通业务类型,"TEDLOSS","资产减值管理"),
    共通业务类型_项目类_计划类利率型行情信息(DictCode.共通业务类型,"FINASSET66","项目类_计划类利率型行情信息"),

    业务类型_债券交易(DictCode.业务类型, "02", "债券交易"),
    //add by tanxuan on 20200101
	业务类型_场外期权(DictCode.业务类型,"38","场外期权"),
	金融产品类型_投管用_期权(DictCode.金融产品类型_投管用,"F35","期权"),
    /**
     * 截标状态明细 add by gejiaao 20200109
     */
    截标状态_已截标(DictCode.截标状态,"01","已截标"),
    截标状态_未截标(DictCode.截标状态,"02","未截标"),

    /** add by yanya on 20200111 交易方向增加 转换赎回申请、转换赎回确认、转换申购确认**/
    交易方向_转换赎回申请(DictCode.交易方向,"T62","转换赎回申请"),
    交易方向_转换赎回确认(DictCode.交易方向,"T63","转换赎回确认"),
    交易方向_转换申购确认(DictCode.交易方向,"T64","转换申购确认"),
    指令类型_债券类资产_申购划款(DictCode.指令类型,"2741","资金划款-债券类资产申购划款"),
    指令类型_债券类资产_申购退款(DictCode.指令类型,"2742","资金收款-债券类资产申购退款"),
    金融产品类型_期权(DictCode.金融产品类型,"F35","期权"),
    共通业务类型_期权交易(DictCode.共通业务类型,"TRD71","期权交易"),
    平安资产类型_期权(DictCode.平安资产类型,"F18","期权"),
    利率类型_结构性(DictCode.利率类型,"03","结构性"),
    基准类型_合约标的(DictCode.基准类型,"07","合约标的"),
    行权方式_欧式(DictCode.行权方式,"06","欧式"),
    行权方式_美式(DictCode.行权方式,"07","美式"),
    结构类型_看涨(DictCode.结构类型,"01","看涨"),
    结构类型_看跌(DictCode.结构类型,"02","看跌"),
    结构类型_二元看涨(DictCode.结构类型,"03","二元看涨"),
    结构类型_看涨鲨鱼鳍(DictCode.结构类型,"04","看涨鲨鱼鳍"),
    结构类型_双向鲨鱼鳍(DictCode.结构类型,"05","双向鲨鱼鳍"),
    期权费支付类型_先付期权费(DictCode.期权费支付类型,"01","先付期权费"),
    期权费支付类型_后付期权费(DictCode.期权费支付类型,"02","后付期权费"),

    共通业务类型_基金账户管理(DictCode.共通业务类型,"MST25","基金账户管理"),
    证券账户类型_证券账户(DictCode.证券账户类型,"SEC","证券账户"),
    证券账户类型_基金账户(DictCode.证券账户类型,"FUND","基金账户"),

    //穿透维度 add by chendijun 20200113 start
    穿透维度_不穿透(DictCode.穿透维度,"01","不穿透"),
    穿透维度_穿透(DictCode.穿透维度,"02","穿透"),
    穿透维度_底层资产(DictCode.穿透维度,"03","底层资产"),
    //穿透维度 add by chendijun 20200113 end

    //评级来源类型 add by chendijun 20200113 start
    评级来源类型_外部(DictCode.评级来源类型,"01","外部"),
    评级来源类型_内部(DictCode.评级来源类型,"02","内部"),
    //评级来源类型度 add by chendijun 20200113 end

    //融资人性质 add by chendijun 20200113 start
    融资人性质_企业类_事业类_债务人或保证人(DictCode.融资人性质,"01","企业类&事业类（债务人或保证人）"),
    融资人性质_商业银行(DictCode.融资人性质,"02","商业银行"),
    融资人性质_非银金融机构(DictCode.融资人性质,"03","非银金融机构"),
    融资人性质_企事业法人_银行间市场证券化(DictCode.融资人性质,"04","企事业法人&银行间市场证券化"),
    融资人性质_金融机构(DictCode.融资人性质,"05","金融机构"),
    融资人性质_其他证券化(DictCode.融资人性质,"06","其他证券化"),
    融资人性质_企事业法人_金融机构(DictCode.融资人性质,"07","企事业法人&金融机构"),
    //融资人性质 add by chendijun 20200113 end

    //行内资产四级分类 add by chendijun 20200113 start
    行内资产四级分类_短融(DictCode.行内资产四级分类,"015","短融"),
    行内资产四级分类_超短融(DictCode.行内资产四级分类,"016","超短融"),
    行内资产四级分类_金融机构次级债(DictCode.行内资产四级分类,"009","金融机构次级债"),
    //行内资产四级分类 add by chendijun 20200113 end

    //行内资产四级分类 add by chendijun 20200113 start
    行内资产三级分类_资产支持证券(DictCode.行内资产四级分类,"12","资产支持证券"),
    //行内资产四级分类 add by chendijun 20200113 end
    // 中债报送Excel下载数据字典 zhangyf 20200111 start
    报送文件类别_投资者明细信息登记(DictCode.报送文件类别,"01","投资者明细信息登记"),
    报送处理状态_正常结束(DictCode.报送处理状态,"01","正常结束"),
    报送处理状态_异常结束(DictCode.报送处理状态,"02","异常结束"),
    报送处理状态_处理中(DictCode.报送处理状态,"03","处理中"),
    报送处理状态_未处理(DictCode.报送处理状态,"04","未处理"),
    // 中债报送Excel下载数据字典 zhangyf 20200111 end

    /** 区间内浮动管理费计提方式 add by yanya on 20200114 start**/
    区间内浮动管理费计提方式_区间内每日倒减计提(DictCode.区间内浮动管理费计提方式,"02","区间内每日倒减计提"),
    区间内浮动管理费计提方式_区间结束日一次计提(DictCode.区间内浮动管理费计提方式,"01","区间结束日一次计提"),
    /** 区间内浮动管理费计提方式 add by yanya on 20200114 end**/
    /**
     * 调整策略明细 add by gejiaao 20200109
     */
    调整策略_按比例分配(DictCode.调整策略,"01","按比例分配"),
    调整策略_价格优先分配(DictCode.调整策略,"02","价格优先分配"),
    /**
     *
     */
    行内资产五级分类_上市银行优先股(DictCode.行内资产五级分类,"142","上市银行优先股"),
    增值税资产分类_场外期权(DictCode.增值税资产分类,"P01","场外期权"),

    /**产品风险评级 add by shaohuchen 2020-01-20 start**/
	产品风险评级_谨慎型(DictCode.产品风险评级, "01", "PR1（谨慎型）"),
	产品风险评级_稳健型(DictCode.产品风险评级, "02", "PR2（稳健型）"),
	产品风险评级_平衡型(DictCode.产品风险评级, "03", "'PR3（平衡型）"),
	产品风险评级_进取型(DictCode.产品风险评级, "04", "'PR4（进取型）"),
	产品风险评级_激进型(DictCode.产品风险评级, "05", "PR4（激进型）"),
	/**产品风险评级 add by shaohuchen 2020-01-20 end**/
    /**债券借贷费用损益计入方式 add by yanya 2020-01-22 start**/
    债券借贷费用损益计入方式_计入投资收益(DictCode.债券借贷费用损益计入方式,"01","计入投资收益"),
    债券借贷费用损益计入方式_计入费用支出(DictCode.债券借贷费用损益计入方式,"02","计入费用支出"),
    /**债券借贷费用损益计入方式 add by yanya 2020-01-22 end**/

    /**费用交易管理 	20200205 **/
    共通业务类型_费用交易管理(DictCode.共通业务类型,"FEETRADE","费用交易管理"),

    计息基础_30U_360(DictCode.计息基础,"30U/360","330/360 US"),

    /** add by 谈旋 2020-03-05 **/
    金融产品类型_券商集合计划(DictCode.金融产品类型,"F55","券商集合计划"),
    共通业务类型_产品信息管理(DictCode.共通业务类型,"V28","产品信息管理"),
    共通业务类型_期权标的管理(DictCode.共通业务类型,"V29","期权标的管理"),
	//add by liupengfei for 多级法人改造估值接口S
//    共通业务类型_拆借标的信息(DictCode.共通业务类型,"V30","拆借标的信息"),
//    共通业务类型_回购标的信息(DictCode.共通业务类型,"V31","回购标的信息"),
//    共通业务类型_债券借贷标的信息(DictCode.共通业务类型,"V32","债券借贷标的信息"),

	//add by liupengfei for 多级法人改造估值接口E
    /**
     * 生僻字类型_全角半角
     */
    生僻字类型_全角半角(DictCode.生僻字类型,"01","全角半角"),
    /**
     * 生僻字类型_生僻字
     */
    生僻字类型_生僻字(DictCode.生僻字类型,"02","生僻字"),

    报送处理状态_警告(DictCode.报送处理状态,"05","警告"),

    平安业务类型_期权买入(DictCode.平安业务类型,"145","期权买入"),
    平安业务类型_期权卖出(DictCode.平安业务类型,"146","期权卖出"),
    平安业务类型_期权放弃行权(DictCode.平安业务类型,"147","期权-放弃行权"),
    平安业务类型_期权提前行权(DictCode.平安业务类型,"148","期权-提前行权"),
    平安业务类型_期权到期行权(DictCode.平安业务类型,"149","期权买-到期行权"),
    查询条件类型_主表(DictCode.查询条件类型,"02","主表"),
    查询条件类型_子表(DictCode.查询条件类型,"01","子表"),
    poi模板类型_EXCEL(DictCode.poi模板类型,"X","excel"),
    poi模板类型_WORD(DictCode.poi模板类型,"W","word"),
    poi表格类型_单表(DictCode.poi表格类型,"01","单表"),
    poi表格类型_多列表(DictCode.poi表格类型,"02","多列表"),
    poi表格类型_图表(DictCode.poi表格类型,"03","图表"),
    poi表格样式_参考模板(DictCode.poi表格样式,"01","参考模板"),
    poi表格样式_无(DictCode.poi表格样式,"99","无"),
    poi图表类型_柱状图(DictCode.poi图表类型,"01","柱状图"),
    poi图表类型_饼图(DictCode.poi图表类型,"02","饼图"),
    poi图表类型_折线图(DictCode.poi图表类型,"03","折线图"),
    poi表格宽度_窄边距(DictCode.poi表格宽度,"N","窄边距"),
    poi表格宽度_适中边距(DictCode.poi表格宽度,"M","适中边距"),
    poi表格宽度_宽边距(DictCode.poi表格宽度,"E","宽边距"),
    poi关联类型_子表(DictCode.poi关联类型,"01","子表"),
    poi关联类型_主表(DictCode.poi关联类型,"02","主表"),
 	共通业务类型_自定义参数管理(
            DictCode.共通业务类型, "RSK33", "自定义参数管理"
    ), 共通业务类型_固定值参数管理(
            DictCode.共通业务类型, "RSK28", "固定值参数管理"
    ),
 	名单主体明细类型_交易对手(DictCode.名单主体明细类型, "10", "交易对手"),
 	管理方式_发行登记_集合管理(DictCode.管理方式_发行登记,"01","集合管理"),
 	管理方式_发行登记_单独管理(DictCode.管理方式_发行登记,"02","单独管理"),
// 	价格模式_加权价格BP(DictCode.价格模式,"PRM04","加权价格+BP"),
 	资产计量方式_公允价值(DictCode.资产计量方式,"01","公允价值"),
 	资产计量方式_摊余成本(DictCode.资产计量方式,"02","摊余成本"),
 	对手方类型_住户(DictCode.对手方类型,"01","住户"),
 	对手方类型_广义政府(DictCode.对手方类型,"02","广义政府"),
 	对手方类型_非金融企业(DictCode.对手方类型,"03","非金融企业"),
 	对手方类型_银行业存款类金融机构(DictCode.对手方类型,"04","银行业存款类金融机构"),
 	对手方类型_银行业非存款类金融机构(DictCode.对手方类型,"05","银行业非存款类金融机构"),
 	对手方类型_非银行业金融机构(DictCode.对手方类型,"06","非银行业金融机构"),
 	对手方类型_银行非保本理财(DictCode.对手方类型,"07","银行非保本理财"),
 	对手方类型_信托公司资管产品(DictCode.对手方类型,"08","信托公司资管产品"),
 	对手方类型_证券公司及其子公司资管产品(DictCode.对手方类型,"09","证券公司及其子公司资管产品"),
 	对手方类型_基金管理公司及其子公司专户(DictCode.对手方类型,"10","基金管理公司及其子公司专户"),
 	对手方类型_期货公司及其子公司资管产品(DictCode.对手方类型,"11","期货公司及其子公司资管产品"),
 	对手方类型_保险资管产品(DictCode.对手方类型,"12","保险资管产品"),
 	对手方类型_金融资产投资公司资管产品(DictCode.对手方类型,"13","金融资产投资公司资管产品"),
 	对手方类型_公募基金(DictCode.对手方类型,"14","公募基金"),
 	对手方类型_私募基金(DictCode.对手方类型,"15","私募基金"),
 	对手方类型_其他特定目的载体(DictCode.对手方类型,"16","其他特定目的载体"),
 	对手方类型_境外(DictCode.对手方类型,"17","境外"),
 	对手方类型_其他(DictCode.对手方类型,"99","其他"),
    扣减对象_发行人(DictCode.扣减对象,"01","发行人"),
    扣减对象_融资人(DictCode.扣减对象,"02","融资人"),
    扣减对象_交易对手(DictCode.扣减对象,"03","交易对手"),
    扣减对象_担保人(DictCode.扣减对象,"04","担保人"),
    扣减对象_管理人(DictCode.扣减对象,"05","管理人"),
    扣减对象_存放行(DictCode.扣减对象,"06","存放行"),
    扣减对象_合作机构(DictCode.扣减对象,"09","合作机构"),
    额度规则类型_资产大类(DictCode.额度规则类型,"01","资产大类"),
    额度规则类型_单笔资产(DictCode.额度规则类型,"02","单笔资产"),
    共通业务类型_单笔资产额度校验规则(DictCode.共通业务类型,"RSK45","单笔资产额度校验规则"),
    共通业务类型_主体额度占用调整(DictCode.共通业务类型,"RSK46","主体额度占用调整"),
    额度调整类型_额度扣减(DictCode.额度调整类型,"01","额度扣减"),
    额度调整类型_额度释放(DictCode.额度调整类型,"02","额度释放"),

    清算状态_待处理(DictCode.清算状态,"W","待处理"),
    清算状态_清算中(DictCode.清算状态,"A","清算中"),
    清算状态_清算成功(DictCode.清算状态,"S","清算成功"),
    清算状态_清算失败(DictCode.清算状态,"F","清算失败"),
    清算状态_清算异常(DictCode.清算状态,"Y","清算异常"),
    清算状态_线下清算(DictCode.清算状态,"X","线下清算"),
    指标类型代码_产品分析综合指标(DictCode.指标类型代码,"04","产品分析综合指标"),
    指标类型代码_绩效评价(DictCode.指标类型代码,"05","绩效评价"),
    指标类型代码_盈亏指标(DictCode.指标类型代码,"06","盈亏指标"),
    指标类型代码_费用指标(DictCode.指标类型代码,"07","费用指标"),
    指标类型代码_产品表现分析(DictCode.菜单指标类型代码,"02","产品表现分析"),

    联社数据权限模式_查询(DictCode.联社数据权限模式,"01","查询"),

    联社数据权限模式_修改及删除(DictCode.联社数据权限模式,"02","修改及删除"),

    联社机构类型_省级机构(DictCode.联社机构类型, "01", "省级机构"),
    联社机构类型_市级机构(DictCode.联社机构类型, "02", "市级机构"),
    联社机构类型_成员行社机构(DictCode.联社机构类型, "03", "成员行社机构"),
    //add by wqg 20201021
    行内资产四级分类_可交换债券(DictCode.行内资产四级分类,"011","可交换债券"),
    行内资产四级分类_可转债(DictCode.行内资产四级分类,"013","可转债"),
    行内资产四级分类_优先股(DictCode.行内资产四级分类,"023","优先股"),

    中债债券类型_国债_央票(DictCode.中债债券类型, "01", "国债/央票"),
    中债债券类型_次级债券(DictCode.中债债券类型, "02", "政策性金融债"),
    中债债券类型_地方债(DictCode.中债债券类型, "03", "非金融公司的债券"),
    中债债券类型_短期融资券(DictCode.中债债券类型, "04", "金融公司的债券"),

    中债评级类型_国债_央票(DictCode.中债评级类型, "01", "评级AAA级"),
    中债评级类型_次级债券(DictCode.中债评级类型, "02", "评级AA-级以上"),
    中债评级类型_地方债(DictCode.中债评级类型, "03", "评级AA-级以下"),
    中债评级类型_短期融资券(DictCode.中债评级类型, "04", "无评级"),
    共通业务类型_手工交收(DictCode.共通业务类型,"STL06","手工交收"),

    /**
     * 分录类型_正常记账
     */
    记账顺序_交易前(
        DictCode.记账顺序, "01", "交易前"
    ),
    /**
     * 分录类型_单边记账
     */
    记账顺序_计提后(
        DictCode.记账顺序, "02", "计提后"
    ),
    /**
     * 报表生成配置表 add by jiangpeng on 20201205
     */
    报表生成配置表_理财产品状态表(
            DictCode.报表生成配置表,"REP_PROD_STATUS","理财产品状态表"
    ),
    报表生成配置表_理财产品信息表(
            DictCode.报表生成配置表,"REP_PROD_MESSAGE","理财产品信息表"
    ),

	投资端费用品种类型_账户维护费(DictCode.投资端费用品种类型, "08", "账户维护费"),
	/*合并模拟测算代码 panbin 2020-8-11 start*/
    共通业务类型_债券每日行情(DictCode.共通业务类型,"BONDMARKET","债券每日行情"),

    组合类型_虚拟组合(DictCode.组合类型,"04","虚拟组合"),
    组合开放类型_封闭式(DictCode.组合开放类型,"01","封闭式"),
    组合开放类型_定期开放(DictCode.组合开放类型,"02","定期开放"),
    组合开放类型_高频开放(DictCode.组合开放类型,"03","高频开放"),
    /*合并模拟测算代码 panbin 2020-8-11 end*/

	//add by wm 数据来源数据字典新增“手工录入”值 20200603 start
    数据来源_手工维护(DictCode.数据来源, "MN" , "手工维护" ),
    //add by wm 数据来源数据字典新增“手工录入”值 20200603 end

    银行资本补充工具_永续债_债性(DictCode.银行资本补充工具,"01","永续债（债性）"),
    银行资本补充工具_永续债_股性(DictCode.银行资本补充工具,"02","永续债（股性）"),
    银行资本补充工具_二级资本债(DictCode.银行资本补充工具,"03","二级资本债"),
    银行资本补充工具_可转债(DictCode.银行资本补充工具,"04","可转债"),
    银行资本补充工具_其他银行资本补充工具(DictCode.银行资本补充工具,"05","其他银行资本补充工具"),
    /**
     * 宁波中债个性化业务类型 add by qufangxu at 20210112
     */
    中债_上游资产四级分类_北金所债权融资计划(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","北金所债权融资计划"),
    中债_上游资产四级分类_理财直接融资工具(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","理财直接融资工具"),
    中债_上游资产四级分类_交易所委托债权(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","交易所委托债权"),
    中债_上游资产四级分类_同业借款(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","同业借款"),
    中债_上游资产四级分类_同业拆借(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","同业拆借"),
    中债_上游资产四级分类_同业存款(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","同业存款"),
    中债_上游资产四级分类_活期存放(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","活期存放"),
    中债_上游资产四级分类_应收账款(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","应收账款"),
    中债_上游资产四级分类_产业基金_债权类(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","产业基金_债权类"),
    中债_上游资产四级分类_产业基金_股权类(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","产业基金_股权类"),
    中债_上游资产四级分类_产业基金_混合类(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","产业基金_混合类"),
    中债_上游资产四级分类_定向增发(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","定向增发"),
    中债_上游资产四级分类_股权投资基金(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","股权投资基金"),
    中债_上游资产四级分类_股票质押式回购(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","股票质押式回购"),
    中债_上游资产四级分类_中层资本(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","中层资本"),
    中债_上游资产四级分类_债权融资类产品(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","债权融资类产品"),
    中债_上游资产四级分类_委债(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","委债"),
    中债_上游资产四级分类_员工持股计划(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","员工持股计划"),
    中债_上游资产四级分类_消费信贷结构化信托(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","消费信贷结构化信托"),
    中债_上游资产四级分类_券商收益凭证(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","券商收益凭证"),
    中债_上游资产四级分类_两融收益权回购(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","两融收益权回购"),
    中债_上游资产四级分类_银登项目_信托贷款(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","银登项目_信托贷款"),
    中债_上游资产四级分类_银登项目_委托贷(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","银登项目_委托贷"),
    中债_上游资产四级分类_银登项目_应收租赁资产(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","银登项目_应收租赁资产"),
    中债_上游资产四级分类_银登项目_资产证券化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","银登项目_资产证券化"),
    中债_上游资产四级分类_股票结构化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","股票结构化"),
    中债_上游资产四级分类_定向增发结构化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","定向增发结构化"),
    中债_上游资产四级分类_债券结构化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","债券结构化"),
    中债_上游资产四级分类_商品及衍生品类结构化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","商品及衍生品类结构化"),
    中债_上游资产四级分类_混合类结构化(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","混合类结构化"),
    中债_上游资产四级分类_QD(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","QD"),
    中债_上游资产四级分类_RQDII(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","RQDII"),
    中债_上游资产四级分类_可交换债专户(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","可交换债专户"),
    中债_上游资产四级分类_可转债专户(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","可转债专户"),
    中债_上游资产四级分类_量化对冲专户(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","量化对冲专户"),
    中债_上游资产四级分类_Mom专户(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","Mom专户"),
    中债_上游资产四级分类_债券投资(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","债券投资"),
    中债_上游资产四级分类_固收资产(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","固收资产"),
    中债_上游资产四级分类_非标资产(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","非标资产"),
    中债_上游资产四级分类_优先股(DictCode.中债_上游资产四级分类,"NB_BUSI_TYPE","优先股"),


    中债_上游资产一级分类_债券(DictCode.中债_上游资产一级分类,"F01","债券"),
    中债_上游资产一级分类_基金类资产(DictCode.中债_上游资产一级分类,"F02","基金类资产"),

    中债_上游资产一级分类_计划类利率型(DictCode.中债_上游资产一级分类,"F03","计划类（利率型）"),
    中债_上游资产一级分类_计划类净值型(DictCode.中债_上游资产一级分类,"F04","计划类（净值型）"),
    中债_上游资产一级分类_存款类资产(DictCode.中债_上游资产一级分类,"F05","存款类资产"),
    中债_上游资产一级分类_项目类资产(DictCode.中债_上游资产一级分类,"F06","项目类资产"),
    中债_上游资产一级分类_质押式回购(DictCode.中债_上游资产一级分类,"F07","质押式回购"),
    中债_上游资产一级分类_拆借(DictCode.中债_上游资产一级分类,"F08","拆借"),
    中债_上游资产一级分类_计划类货币型(DictCode.中债_上游资产一级分类,"F09","计划类（货币型）"),
    中债_上游资产一级分类_买断式回购(DictCode.中债_上游资产一级分类,"F10","买断式回购"),
    中债_上游资产一级分类_股票(DictCode.中债_上游资产一级分类,"F11","股票"),
    中债_上游资产一级分类_债券借贷(DictCode.中债_上游资产一级分类,"F12","债券借贷"),
    中债_上游资产一级分类_外汇即期(DictCode.中债_上游资产一级分类,"F13","外汇即期"),
    中债_上游资产一级分类_外汇远期(DictCode.中债_上游资产一级分类,"F14","外汇远期"),
    中债_上游资产一级分类_外汇掉期(DictCode.中债_上游资产一级分类,"F15","外汇掉期"),
    中债_上游资产一级分类_利率互换(DictCode.中债_上游资产一级分类,"F16","利率互换"),
    中债_上游资产一级分类_金融衍生品(DictCode.中债_上游资产一级分类,"F18","金融衍生品"),




    中债_上游资产二级分类_北金所债权融资计划(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","北金所债权融资计划"),
    中债_上游资产二级分类_理财直接融资工具(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","理财直接融资工具"),
    中债_上游资产二级分类_交易所委托债权(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","交易所委托债权"),
    中债_上游资产二级分类_同业借款(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","同业借款"),
    中债_上游资产二级分类_同业拆借(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","同业拆借"),
    中债_上游资产二级分类_同业存款(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","同业存款"),
    中债_上游资产二级分类_活期存放(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","活期存放"),
    中债_上游资产二级分类_应收账款(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","应收账款"),
    中债_上游资产二级分类_私募基金(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","私募基金"),
    中债_上游资产二级分类_券商收益凭证(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","券商收益凭证"),
    中债_上游资产二级分类_两融收益权回购(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","两融收益权回购"),
    中债_上游资产二级分类_银登项目(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","银登项目"),
    中债_上游资产二级分类_结构化资产管理产品(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","结构化资产管理产品"),
    中债_上游资产二级分类_资产管理计划(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","资产管理计划"),
    中债_上游资产二级分类_股票(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","股票"),
    中债_上游资产二级分类_非货币基金(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","非货币基金"),
    中债_上游资产二级分类_货币基金(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","货币基金"),
    中债_上游资产二级分类_优先股(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","优先股"),
    中债_上游资产二级分类_金融债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","金融债"),
    中债_上游资产二级分类_可转债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","可转债"),
    中债_上游资产二级分类_可交换债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","可交换债"),
    中债_上游资产二级分类_利率债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","利率债"),
    中债_上游资产二级分类_政府支持机构债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","政府支持机构债"),
    中债_上游资产二级分类_同业存单(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","同业存单"),
    中债_上游资产二级分类_信用债(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","信用债"),
    中债_上游资产二级分类_资产支持证券(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","资产支持证券"),
    中债_上游资产二级分类_债券质押式回购(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","债券质押式回购"),
    中债_上游资产二级分类_债券买断式回购(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","债券买断式回购"),
    中债_上游资产二级分类_外汇远期_掉期_即期(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","外汇远期_掉期_即期"),
    中债_上游资产二级分类_利率互换(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","利率互换"),
    中债_上游资产二级分类_期权(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","期权"),
    中债_上游资产二级分类_债券借贷(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","债券借贷"),
    中债_上游资产二级分类_信用违约互换(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","信用违约互换"),
    中债_上游资产二级分类_保证金(DictCode.中债_上游资产二级分类,"NB_WINDTYPEONE","保证金"),

    中债_上游资产三级分类_北金所债权融资计划(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","北金所债权融资计划"),
    中债_上游资产三级分类_理财直接融资工具(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","理财直接融资工具"),
    中债_上游资产三级分类_交易所委托债权(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","交易所委托债权"),
    中债_上游资产三级分类_同业借款(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","同业借款"),
    中债_上游资产三级分类_同业拆借(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","同业拆借"),
    中债_上游资产三级分类_同业存款(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","同业存款"),
    中债_上游资产三级分类_活期存放(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","活期存放"),
    中债_上游资产三级分类_应收账款(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","应收账款"),
    中债_上游资产三级分类_券商资管计划_基金资管计划_保险资管计划_信托计划(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","券商资管计划_基金资管计划_保险资管计划_信托计划"),
    中债_上游资产三级分类_私募股权投资基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","私募股权投资基金"),
    中债_上游资产三级分类_券商收益凭证(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","券商收益凭证"),
    中债_上游资产三级分类_两融收益权回购(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","两融收益权回购"),
    中债_上游资产三级分类_券商资管计划_基金资管计划_保险资管计划_期货资管计划_信托计划(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","券商资管计划_基金资管计划_保险资管计划_期货资管计划_信托计划"),
    中债_上游资产三级分类_股票(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","股票"),
    中债_上游资产三级分类_股票基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","股票基金"),
    中债_上游资产三级分类_债券基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券基金"),
    中债_上游资产三级分类_基金中基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","基金中基金"),
    中债_上游资产三级分类_其他公募基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","其他公募基金"),
    中债_上游资产三级分类_混合基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","混合基金"),
    中债_上游资产三级分类_货币基金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","货币基金"),
    中债_上游资产三级分类_优先股(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","优先股"),
    中债_上游资产三级分类_非银次级债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","非银次级债"),
    中债_上游资产三级分类_非银金融债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","非银金融债"),
    中债_上游资产三级分类_商业银行次级债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","商业银行次级债"),
    中债_上游资产三级分类_商业银行普通债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","商业银行普通债"),
    中债_上游资产三级分类_非银无固定期限金融债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","非银无固定期限金融债"),
    中债_上游资产三级分类_商业银行无固定期限资本债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","商业银行无固定期限资本债"),
    中债_上游资产三级分类_政策性银行次级债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","政策性银行次级债"),
    中债_上游资产三级分类_可转债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","可转债"),
    中债_上游资产三级分类_可交换债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","可交换债"),
    中债_上游资产三级分类_地方政府债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","地方政府债"),
    中债_上游资产三级分类_国债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","国债"),
    中债_上游资产三级分类_央行票据(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","央行票据"),
    中债_上游资产三级分类_政策性金融债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","政策性金融债"),
    中债_上游资产三级分类_政府支持机构债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","政府支持机构债"),
    中债_上游资产三级分类_同业存单(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","同业存单"),
    中债_上游资产三级分类_PPN(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","PPN"),
    中债_上游资产三级分类_短期融资券(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","短期融资券"),
    中债_上游资产三级分类_公司债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","公司债"),
    中债_上游资产三级分类_企业债(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","企业债"),
    中债_上游资产三级分类_中期票据(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","中期票据"),
    中债_上游资产三级分类_交易商协会ABN(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","交易商协会ABN"),
    中债_上游资产三级分类_银监会主管ABS(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","银监会主管ABS"),
    中债_上游资产三级分类_证监会主管ABS(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","证监会主管ABS"),
    中债_上游资产三级分类_交易商协会ABCP(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","交易商协会ABCP"),
    中债_上游资产三级分类_债券质押式正回购(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券质押式正回购"),
    中债_上游资产三级分类_债券质押式逆回购(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券质押式逆回购"),
    中债_上游资产三级分类_债券买断式正回购(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券买断式正回购"),
    中债_上游资产三级分类_债券买断式逆回购(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券买断式逆回购"),
    中债_上游资产三级分类_外汇远期(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","外汇远期"),
    中债_上游资产三级分类_外汇掉期(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","外汇掉期"),
    中债_上游资产三级分类_外汇即期(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","外汇即期"),
    中债_上游资产三级分类_利率互换(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","利率互换"),
    中债_上游资产三级分类_期权(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","期权"),
    中债_上游资产三级分类_债券借贷(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","债券借贷"),
    中债_上游资产三级分类_信用违约互换(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","信用违约互换"),
    中债_上游资产三级分类_保证金(DictCode.中债_上游资产三级分类,"NB_WINDTYPETWO","保证金"),


    /*中债_中债贷款分类_收益权(DictCode.中债贷款分类,"01","收益权"),
    中债_中债贷款分类_贷款(DictCode.中债贷款分类,"02","贷款"),*/
    中债_中债贷款分类_除回购或拆借外贷款(DictCode.中债贷款分类,"08","除回购或拆借外贷款"),
    中债_处理状态_待处理(DictCode.中债_处理状态,"01","待处理"),
    中债_处理状态_已处理(DictCode.中债_处理状态,"02","已处理"),
    中债一二三期文件处理状态_未处理(DictCode.中债一二三期文件处理状态,"01","未处理"),
    中债一二三期文件处理状态_已处理(DictCode.中债一二三期文件处理状态,"02","已处理"),
    中债_匹配结果_匹配成功(DictCode.中债_匹配结果,"01","匹配成功"),
    中债_匹配结果_匹配失败(DictCode.中债_匹配结果,"02","匹配失败"),
    批前检查_执行状态_未执行(DictCode.批前检查_执行状态,"UNR","未执行"),
    批前检查_执行状态_执行中(DictCode.批前检查_执行状态,"RUN","执行中"),
    批前检查_执行状态_成功(DictCode.批前检查_执行状态,"END","成功"),
    批前检查_执行状态_异常(DictCode.批前检查_执行状态,"EXP","异常"),
    批前检查_执行状态_错误(DictCode.批前检查_执行状态,"ERROR","错误"),
    批前检查_执行状态_预警(DictCode.批前检查_执行状态,"WARN","预警"),
    费用类型_佣金(DictCode.费用类型,"B05","佣金"),
    日志状态_生成成功(DictCode.日志状态,"01","生成成功"),
    日志状态_生成失败(DictCode.日志状态,"02","生成失败"),
    日志状态_上传文件成功(DictCode.日志状态,"03","上传文件成功"),
    日志状态_上传文件失败(DictCode.日志状态,"04","上传文件失败"),

    中债披露报告_成立公告(DictCode.中债披露报告,"01","成立公告"),
    中债披露报告_理财产品非标投资运作报告(DictCode.中债披露报告,"02","理财产品非标投资运作报告"),
    中债披露报告_到期公告(DictCode.中债披露报告,"03","到期公告"),
    中债披露报告_产品定期公告(DictCode.中债披露报告,"04","产品定期公告"),
    中债披露报告_产品净值披露(DictCode.中债披露报告,"05","产品净值披露"),

    中债定期报告类型_一季度报(DictCode.中债定期报告类型,"01","第1季度"),
    中债定期报告类型_二季度报(DictCode.中债定期报告类型,"02","第2季度"),
    中债定期报告类型_上半年报(DictCode.中债定期报告类型,"03","上半年度"),
    中债定期报告类型_三季度报(DictCode.中债定期报告类型,"04","第3季度"),
    中债定期报告类型_四季度报(DictCode.中债定期报告类型,"05","第4季度"),
    中债定期报告类型_下半年报(DictCode.中债定期报告类型,"06","下半年度"),
    中债定期报告类型_年报(DictCode.中债定期报告类型,"07","年度"),

    // add by baojunjie 20210601 start
    投资者明细核查检查结果_一致(DictCode.投资者明细核查检查结果,"01","一致"),
    投资者明细核查检查结果_不一致(DictCode.投资者明细核查检查结果,"02","不一致"),
    // add by baojunjie 20210601 end

    /** modify by yanya on 20210528 增加外管局估值来源字典值**/
    估值来源_外管局(DictCode.估值来源, "SAFE", "外管局"),

    是否压缩_不生成压缩文件(DictCode.是否压缩, "1", "不生成压缩文件"),
    是否压缩_生成压缩文件(DictCode.是否压缩, "2", "生成压缩文件"),
    是否压缩_按照业务日期(DictCode.压缩方式, "1", "按照业务日期"),
    是否压缩_整体压缩(DictCode.压缩方式, "2", "整体压缩"),


    zip包状态_已使用(DictCode.zip包状态, "01", "已使用"),
    zip包状态_可编辑(DictCode.zip包状态, "02", "可编辑"),


    新人行产品类型_固定收益类(DictCode.新人行产品类型, "1", "固定收益类"),
    新人行产品类型_权益类(DictCode.新人行产品类型, "2", "权益类"),
    新人行产品类型_商品及金融衍生品类(DictCode.新人行产品类型, "3", "商品及金融衍生品类"),
    新人行产品类型_混合类(DictCode.新人行产品类型, "4", "混合类"),


    新人行募集方式_公募(DictCode.新人行募集方式, "1", "公开募集"),
    新人行募集方式_私募(DictCode.新人行募集方式, "2", "非公开募集"),

    新人行产品运作模式_开放式净值型(DictCode.新人行产品运作模式, "1", "开放式净值型"),
    新人行产品运作模式_开放式非净值型(DictCode.新人行产品运作模式, "2", "开放式非净值型"),
    新人行产品运作模式_封闭式净值型(DictCode.新人行产品运作模式, "3", "封闭式净值型"),
    新人行产品运作模式_封闭式非净值型(DictCode.新人行产品运作模式, "4", "封闭式非净值型"),



    /******/

    客户性质_券商(DictCode.客户性质,"10","券商"),
    客户性质_交易对手(DictCode.客户性质,"12","交易对手"),

    金融产品其他代码类型_回售代码(DictCode.金融产品其他代码类型,"01","回售"),
    金融产品其他代码类型_质押代码(DictCode.金融产品其他代码类型,"02","标准券出入库"),
    金融产品其他代码类型_可转债信用申购代码(DictCode.金融产品其他代码类型,"03","可转债信用申购"),
    金融产品其他代码类型_可转债转股代码(DictCode.金融产品其他代码类型,"04","可转债转股"),
    金融产品其他代码类型_配债代码(DictCode.金融产品其他代码类型,"05","配债"),
    金融产品其他代码类型_配股代码(DictCode.金融产品其他代码类型,"06","配股"),
    金融产品其他代码类型_新股申购代码(DictCode.金融产品其他代码类型,"07","新股申购"),
    金融产品其他代码类型_基金分红设置代码(DictCode.金融产品其他代码类型,"12","基金分红设置"),
    金融产品其他代码类型_上市流通代码(DictCode.金融产品其他代码类型,"15","上市流通"),
    共通业务类型_产品账户维护(DictCode.共通业务类型, "PTL17", "产品账户维护"),


    /**
     * 账户性质
     */
    账户性质_银行账户(DictCode.账户性质,"01","银行账户"),
    账户性质_非银行账户(DictCode.账户性质,"02","非银行账户"),

    /**
     * add by yzg 20210411
     */
    申报单位_手(DictCode.申报单位,"1","手"),
    申报单位_张(DictCode.申报单位,"2","张"),
    特殊处理业务_质押出入库(DictCode.特殊处理业务,"1","质押出入库"),
    柜台接口类型_金证kcbp(DictCode.柜台接口类型,"1","金证kcbp"),
    柜台接口类型_恒生ufx(DictCode.柜台接口类型,"2","恒生ufx"),
    柜台接口类型_ctp(DictCode.柜台接口类型,"5","ctp"),

    // add by fuyongsheng 20211207 自动对账协议回购 start
    柜台接口类型_恒生(DictCode.柜台接口类型,"1","恒生"),
    柜台接口类型_金证w版(DictCode.柜台接口类型,"2","金证w版"),
    柜台接口类型_金证u版(DictCode.柜台接口类型,"4","金证u版"),
    // add by fuyongsheng 20211207 自动对账协议回购 end
    共通业务类型_席位信息管理(DictCode.共通业务类型,"MST26","席位信息管理"),
    共通业务类型_标准券再折算率(DictCode.共通业务类型,"SCRCR01","标准券再折算率"),

    减值处理方式_减值(DictCode.减值处理方式,"01","减值"),
    减值处理方式_转回(DictCode.减值处理方式,"02","转回"),
    减值处理方式_减值使用(DictCode.减值处理方式,"03","减值使用"),
    减值处理方式_清理核销(DictCode.减值处理方式,"04","清理核销"),
    阶段_初始买入时_P1(DictCode.减值阶段,"P1","一阶段"),
    阶段_买入后风险显著提升_P2(DictCode.减值阶段,"P2","二阶段"),
    阶段_买入后出现减值_P3(DictCode.减值阶段,"P3","三阶段"),
    阶段_买入后同处一二阶段_P12(DictCode.减值阶段,"P12","同处一二阶段"),

    // Added by JIAOXUJIN on 2020-10-16
    共通业务类型_SPPI测试(DictCode.共通业务类型,"FINASSET23","SPPI测试"),

    交易方向_清理核销(DictCode.交易方向,"T75","清理核销"),
    交易方向_其他应收款本金清理核销(DictCode.交易方向,"T76","其他应收款本金-清理核销"),
    交易方向_其他应收款利息清理核销(DictCode.交易方向,"T77","其他应收款利息-清理核销"),

    //add by yzg sppi测试状态
    SPPI测试状态_未测试(DictCode.SPPI测试状态,"0","未测试"),
    SPPI测试状态_测试中(DictCode.SPPI测试状态,"1","测试中"),
    SPPI测试状态_测试通过(DictCode.SPPI测试状态,"2","测试通过"),
    SPPI测试状态_测试不通过(DictCode.SPPI测试状态,"3","测试不通过"),
    //SPPI测试状态_已退回(DictCode.SPPI测试状态,"4","已退回"),
    是否不适用_是(DictCode.是否不适用,"Y","是"),
    是否不适用_否(DictCode.是否不适用,"N","否"),
    是否不适用_不适用(DictCode.是否不适用,"NA","不适用"),

    共通业务类型_资产减值清理(DictCode.共通业务类型,"TRD77","资产减值清理"),

    本位币差额处理方式_利息收入(DictCode.本位币差额处理方式,"01","利息收入"),
    本位币差额处理方式_减值准备(DictCode.本位币差额处理方式,"02","减值准备"),

    还本收息冲抵减值准备处理日_理论日(DictCode.还本收息冲抵减值准备处理日,"01","理论日"),
    还本收息冲抵减值准备处理日_资金到账日(DictCode.还本收息冲抵减值准备处理日,"02","资金到账日"),

    卖出冲抵减值准备处理方式_数量占比(DictCode.卖出冲抵减值准备处理方式,"01","数量占比"),
    卖出冲抵减值准备处理方式_金额占比(DictCode.卖出冲抵减值准备处理方式,"02","金额占比"),
    卖出冲抵减值准备处理方式_原金额占比(DictCode.卖出冲抵减值准备处理方式,"03","原金额占比"),

    收息冲抵减值准备处理方式_数量占比(DictCode.收息冲抵减值准备处理方式,"01","数量占比"),
    收息冲抵减值准备处理方式_金额占比(DictCode.收息冲抵减值准备处理方式,"02","金额占比"),
    收息冲抵减值准备处理方式_原金额占比(DictCode.收息冲抵减值准备处理方式,"03","原金额占比"),

    平安业务类型_资产减值清理_清理核销(DictCode.平安业务类型,"180","清理核销"),
    共通业务类型_清理核销(DictCode.共通业务类型,"TRD75","清理核销"),
    减值测算频率_年末(DictCode.减值测算频率,"01","年末"),
    减值测算频率_季末(DictCode.减值测算频率,"02","季末"),
    减值测算频率_月末(DictCode.减值测算频率,"03","月末"),
    减值测算频率_周(DictCode.减值测算频率,"04","周"),
    减值测算频率_日(DictCode.减值测算频率,"05","日"),
    减值测算频率_每次指定交易(DictCode.减值测算频率,"06","每次指定交易"),
    减值测算频率_每个开放日(DictCode.减值测算频率,"07","每个开放日"),
    减值测算频率_不规则(DictCode.减值测算频率,"08","不规则"),

    减值资产第三阶段利息计提摊销差额计入科目_减值准备(DictCode.减值资产第三阶段利息计提摊销差额计入科目,"01","减值准备"),
    减值资产第三阶段利息计提摊销差额计入科目_原科目(DictCode.减值资产第三阶段利息计提摊销差额计入科目,"02","原科目"),
    减值资产第三阶段是否重新计算实际利率_不重算(DictCode.减值资产第三阶段是否重新计算实际利率,"01","不重算"),
    减值资产第三阶段是否重新计算实际利率_重算(DictCode.减值资产第三阶段是否重新计算实际利率,"02","重算"),
    /**add by wujie on 20201130 start remark:累计科目余额**/
    累计余额_部分(DictCode.是否累计余额,"03","部分更新"),
    /**add by wujie on 20201130 end remark:累计科目余额**/

    交易方向_正回购(DictCode.交易方向, "03", "正回购"),
    交易方向_逆回购(DictCode.交易方向, "04", "逆回购"),
    交易方向_首期(DictCode.交易方向, "T92", "首期"),
    申报类型_不指定(DictCode.申报类型, "PRM05", "不指定"),
    申报类型_意向申报(DictCode.申报类型, "PRM06", "意向申报"),
    申报类型_定价申报(DictCode.申报类型, "PRM07", "定价申报"),
    申报类型_点击成交申报(DictCode.申报类型, "PRM08", "点击成交申报"),

    申报类型_成交申报(DictCode.申报类型, "PRM09", "成交申报"),
    申报类型_收盘价固定价格申报(DictCode.申报类型, "PRM10", "收盘价固定价格申报"),
    申报类型_日均价固定价格申报(DictCode.申报类型, "PRM11", "日均价固定价格申报"),
    申报类型_最优价成交申报(DictCode.申报类型, "PRM12", "最优价成交申报"),
    申报类型_可转换成交申报(DictCode.申报类型, "PRM13", "可转换成交申报"),
    申报类型_指定对手方成交申报(DictCode.申报类型, "PRM14", "指定对手方成交申报"),
    交易方向_配债(DictCode.交易方向, "T97", "配债"),
    债券计算模式_单位净价(DictCode.债券计算模式, "01", "单位净价"),
    债券计算模式_单位全价(DictCode.债券计算模式, "02", "单位全价"),
    债券计算模式_到期收益率(DictCode.债券计算模式, "03", "到期收益率"),
    交易方向_质押券入库(DictCode.交易方向, "T68", "质押券入库"),
    交易方向_质押券出库(DictCode.交易方向, "T69", "质押券出库"),
    交易方向_调整到(DictCode.交易方向, "T100", "调整到"),

    /**手工交收 begin*/
    交收状态_未交收(DictCode.交收状态,"01","未交收"),
    交收状态_已交收(DictCode.交收状态,"02","已交收"),
    交收状态_交收延期(DictCode.交收状态,"03","交收延期"),
    交收状态_交收失败(DictCode.交收状态,"04","交收失败"),
    交收操作类型_交收(DictCode.交收操作类型,"01","交收"),
    交收操作类型_回溯(DictCode.交收操作类型,"02","回溯"),
    交收操作类型_交收延期(DictCode.交收操作类型,"03","交收延期"),
    交收操作类型_交收失败(DictCode.交收操作类型,"04","交收失败"),
    交收操作类型_交收修改(DictCode.交收操作类型,"05","交收修改"),
    /**手工交收 end*/
    // add by dubaojun 2020-07-24 增加目标类型 start
    共通业务类型_股票竞价指令(DictCode.共通业务类型, "ETR25", "股票竞价指令"),
    共通业务类型_基金竞价指令(DictCode.共通业务类型, "ETR26", "基金竞价指令"),
    共通业务类型_大宗债券质押式回购指令(DictCode.共通业务类型, "ETR27", "大宗债券质押式回购指令"),
    共通业务类型_大宗股票指令(DictCode.共通业务类型, "ETR28", "大宗股票指令"),
    共通业务类型_大宗基金指令(DictCode.共通业务类型, "ETR29", "大宗基金指令"),
    共通业务类型_大宗债券指令(DictCode.共通业务类型, "ETR30", "大宗债券指令"),

    共通业务类型_债券竞价指令(DictCode.共通业务类型, "ETR31", "债券竞价指令"),
    共通业务类型_上交所固定收益平台现券交易指令(DictCode.共通业务类型, "ETR32", "上交所固定收益平台现券交易指令"),
    共通业务类型_债券回售指令(DictCode.共通业务类型, "ETR33", "债券回售指令"),
    共通业务类型_配股指令(DictCode.共通业务类型, "ETR34", "配股指令"),
    共通业务类型_新股申购指令(DictCode.共通业务类型, "ETR35", "新股申购指令"),
    共通业务类型_配债指令(DictCode.共通业务类型, "ETR36", "配债指令"),
    共通业务类型_可转债申购指令(DictCode.共通业务类型, "ETR37", "可转债申购指令"),
    共通业务类型_标准券出入库指令(DictCode.共通业务类型, "ETR38", "标准券出入库指令"),
    共通业务类型_债券质押式回购竞价指令(DictCode.共通业务类型, "ETR39", "债券质押式回购竞价指令"),
    共通业务类型_债转股指令(DictCode.上农商_指令业务类型, "ETR40", "债转股指令"),
    上农商_指令业务类型_股票竞价指令(DictCode.上农商_指令业务类型, "01", "股票竞价指令"),
    上农商_指令业务类型_基金竞价指令(DictCode.上农商_指令业务类型, "02", "基金竞价指令"),
    上农商_指令业务类型_大宗债券质押式回购指令(DictCode.上农商_指令业务类型, "03", "大宗债券质押式回购指令"),
    上农商_指令业务类型_大宗股票指令(DictCode.上农商_指令业务类型, "04", "大宗股票指令"),
    上农商_指令业务类型_大宗基金指令(DictCode.上农商_指令业务类型, "05", "大宗基金指令"),
    上农商_指令业务类型_大宗债券指令(DictCode.上农商_指令业务类型, "06", "大宗债券指令"),
    上农商_指令业务类型_债券竞价指令(DictCode.上农商_指令业务类型, "07", "债券竞价指令"),
    上农商_指令业务类型_上交所固定收益平台现券交易指令(DictCode.上农商_指令业务类型, "08", "上交所固定收益平台现券交易指令"),
    上农商_指令业务类型_债券回售指令(DictCode.上农商_指令业务类型, "09", "债券回售指令"),
    上农商_指令业务类型_配股指令(DictCode.上农商_指令业务类型, "10", "配股指令"),
    上农商_指令业务类型_新股申购指令(DictCode.上农商_指令业务类型, "11", "新股申购指令"),
    上农商_指令业务类型_配债指令(DictCode.上农商_指令业务类型, "12", "配债指令"),
    上农商_指令业务类型_可转债申购指令(DictCode.上农商_指令业务类型, "13", "可转债申购指令"),
    上农商_指令业务类型_标准券出入库指令(DictCode.上农商_指令业务类型, "14", "标准券出入库指令"),
    上农商_指令业务类型_债券质押式回购竞价指令(DictCode.上农商_指令业务类型, "15", "债券质押式回购竞价指令"),
    上农商_指令业务类型_债转股指令(DictCode.上农商_指令业务类型, "16", "债转股指令"),
    投资指令类型_单组合单资产指令(DictCode.投资指令类型, "01", "单组合单资产指令"),
    投资指令类型_多组合单资产指令(DictCode.投资指令类型, "02", "多组合单资产指令"),
    目标类型_数量(DictCode.目标类型,"01","数量"),
    目标类型_金额(DictCode.目标类型,"02","金额"),

    /**协议回购指令 begin*/
    委托状态_流程中(DictCode.委托状态,"08","流程中"),
    所有_所有(DictCode.所有,"BROKER","所有"),

    // add by zhangrui1 start
    共通业务类型_关联方管理(DictCode.共通业务类型,"RSK49","关联方管理"),
    // add by zhangrui1 end

    // add by wanshiwei 20210922：指令创建来源 start
    指令创建来源_场内簿记(DictCode.指令创建来源, "01", "场内簿记"),
    指令创建来源_场内实时(DictCode.指令创建来源, "02", "场内实时"),
    指令创建来源_银行间簿记(DictCode.指令创建来源, "03", "银行间簿记"),
    指令创建来源_银行间实时(DictCode.指令创建来源, "04", "银行间实时"),
    // add by wanshiwei 20210922：指令创建来源 end

    交易单位_张(DictCode.交易单位,"01","张"),
    交易单位_份(DictCode.交易单位,"02","份"),
    交易单位_股(DictCode.交易单位,"03","股"),
    交易单位_手(DictCode.交易单位,"04","手"),

    交易方向_提前购回(DictCode.交易方向, "T96", "提前购回"),
    交易方向_到期购回(DictCode.交易方向, "T95", "到期购回"),
    交易方向_中途换券(DictCode.交易方向, "T94", "中途换券"),
    交易方向_解除质押(DictCode.交易方向, "T93", "解除质押"),
    交易方向_到期续做(DictCode.交易方向, "T56", "到期续做"),

    共通业务类型_协议回购首期指令(DictCode.上农商_指令业务类型, "ETR42", "协议回购首期指令"),
    共通业务类型_协议回购提前购回指令(DictCode.上农商_指令业务类型, "ETR43", "协议回购提前购回指令"),
    共通业务类型_协议回购到期购回指令(DictCode.上农商_指令业务类型, "ETR44", "协议回购到期购回指令"),
    共通业务类型_协议回购到期续做指令(DictCode.上农商_指令业务类型, "ETR45", "协议回购到期续做指令"),
    共通业务类型_协议回购中途换券指令(DictCode.上农商_指令业务类型, "ETR46", "协议回购中途换券指令"),
    共通业务类型_协议回购解除质押指令(DictCode.上农商_指令业务类型, "ETR47", "协议回购解除质押指令"),
    共通业务类型_自主管理专户投资指令(DictCode.共通业务类型,"ETR50","自主管理专户投资指令"),
    /**
     * 上农商_指令业务类型_协议回购首期指令
     */
    上农商_指令业务类型_协议回购首期指令(
            DictCode.上农商_指令业务类型, "17", "协议回购首期指令"
    ),
    /**
     * 上农商_指令业务类型_协议回购提前购回指令
     */
    上农商_指令业务类型_协议回购提前购回指令(
            DictCode.上农商_指令业务类型, "18", "协议回购提前购回指令"
    ),
    /**
     * 上农商_指令业务类型_协议回购到期购回指令
     */
    上农商_指令业务类型_协议回购到期购回指令(
            DictCode.上农商_指令业务类型, "19", "协议回购到期购回指令"
    ),
    /**
     * 上农商_指令业务类型_协议回购到期续作指令
     */
    上农商_指令业务类型_协议回购到期续做指令(
            DictCode.上农商_指令业务类型, "20", "协议回购到期续做指令"
    ),
    /**
     * 上农商_指令业务类型_协议回购中途换券指令
     */
    上农商_指令业务类型_协议回购中途换券指令(
            DictCode.上农商_指令业务类型, "21", "协议回购中途换券指令"
    ),
    /**
     * 上农商_指令业务类型_协议回购解除质押指令
     */
    上农商_指令业务类型_协议回购解除质押指令(
            DictCode.上农商_指令业务类型, "22", "协议回购解除质押指令"
    ),

    // add by zwq on 2021/02/26 start为账套参数管理增加字段：参数类型
    账套参数类型_资产类(DictCode.账套参数类型,"01","资产类"),
    账套参数类型_费用类(DictCode.账套参数类型,"02","费用类"),
    账套参数类型_产品类(DictCode.账套参数类型,"03","产品类"),
    账套参数类型_其他类(DictCode.账套参数类型,"04","其他类"),
    账套参数类型_估值表(DictCode.账套参数类型,"05","估值表"),
    账套参数类型_增值税(DictCode.账套参数类型,"06","增值税"),
    账套参数类型_减值类(DictCode.账套参数类型,"07","减值类"),
    // add by zwq on 2021/02/26 end为账套参数管理增加字段：参数类型

    /**协议回购指令 end**/

    交易方向_买入开仓(DictCode.交易方向,"T100","买入开仓"),
    交易方向_卖出平仓(DictCode.交易方向,"T101","卖出平仓"),
    交易方向_卖出开仓(DictCode.交易方向,"T102","卖出开仓"),
    交易方向_买入平仓(DictCode.交易方向,"T103","买入平仓"),


    平安资产类型_期货(DictCode.平安资产类型,"F20","期货"),
    // 期货相关枚举值 start yufei 20201110
    资产二级分类_国债期货(DictCode.资产二级分类,"FU01","国债期货"),
    资产二级分类_股指期货(DictCode.资产二级分类,"FU02","股指期货"),
    交易场所_中国金融期货交易所(DictCode.交易场所,"12","上证50指数"),
    金融产品类型_投管用_期货(DictCode.金融产品类型_投管用,"F36","期货"),
    // 期货相关枚举值 end yufei 20201110
    投资目的_多头(DictCode.投资目的, "LONG", "多头"),
    投资目的_空头(DictCode.投资目的, "SHORT", "空头"),
    /**
     * 上农商_指令业务类型_期货指令
     */
    上农商_指令业务类型_期货指令(
            DictCode.上农商_指令业务类型, "23", "期货指令"
    ),
    /**
     * 上农商_指令业务类型_期货指令
     */
    上农商_指令业务类型_ETF申购赎回指令(
            DictCode.上农商_指令业务类型, "24", "ETF申购赎回指令"
    ),
    // add by lijie2 2020-11-10 start
    共通业务类型_期货指令(DictCode.上农商_指令业务类型, "ETR48", "期货指令"),
    共通业务类型_ETF申购赎回指令(DictCode.上农商_指令业务类型, "ETR50", "ETF申购赎回指令"),
    平安业务类型_期货交易(DictCode.平安业务类型,"166","期货交易"),
    共通业务类型_期货交易(DictCode.共通业务类型,"TRD82","期货交易"),
    // add by lijie2 2020-11-10 end
    // add by yufei 2020-11-10 start
    共通业务类型_期货类资产(DictCode.共通业务类型, "FINASSET22", "期货类资产"),
    // add by yufei 2020-11-10 end
    //add by sunhui 20201123 项目类资产评级改造
    评级类型_资产评级(DictCode.评级类型,"03","资产评级"),

    //add by lijie2 20201215 银行间上行
    共通业务类型_银行间上行(DictCode.共通业务类型,"TRD83","银行间上行"),
    共通业务类型_本币业务交易_登记(DictCode.共通业务类型,"TRD85","本币业务交易-登记"),
    共通业务类型_本币业务交易_对话(DictCode.共通业务类型,"TRD86","本币业务交易-对话"),
    共通业务类型_本币业务交易_请求(DictCode.共通业务类型,"TRD87","本币业务交易-请求"),
    共通业务类型_CFETS账户关联(DictCode.共通业务类型,"MST33","CFETS账户关联"),
    报价系统区分类型_现券对话报价(DictCode.报价系统区分类型,"01","现券对话报价"),
    报价系统区分类型_现券请求报价(DictCode.报价系统区分类型,"02","现券请求报价"),
    报价系统区分类型_质押式回购对话报价(DictCode.报价系统区分类型,"03","质押式回购对话报价"),
    报价系统区分类型_现券登记报价(DictCode.报价系统区分类型,"04","现券登记报价"),
    报价系统区分类型_质押式回购登记报价(DictCode.报价系统区分类型,"05","质押式回购登记报价"),
    行内资产三级分类_正回购(DictCode.行内资产三级分类,"H03","正回购"),
    行内资产三级分类_逆回购(DictCode.行内资产三级分类,"H04","逆回购"),
    下行交易匹配类型_自动匹配(DictCode.下行交易匹配类型,"0","自动匹配"),
    下行交易匹配类型_手动匹配(DictCode.下行交易匹配类型,"1","手动匹配"),
	//20200804 自动加卷处理 njl add start
	确认速度_T_0(DictCode.申购确认速度,"0","t+0"),
	确认速度_T_1(DictCode.赎回确认速度,"1","t+1"),
	//20200804 自动加卷处理 njl add start
	交割方式_实物交割(DictCode.交割方式,"01","实物交割"),
    交割方式_现金交割(DictCode.交割方式,"02","现金交割"),
	合约标的_2年期国债(DictCode.合约标的,"01","2年期国债"),
    合约标的_5年期国债(DictCode.合约标的,"02","5年期国债"),
    合约标的_10年期国债(DictCode.合约标的,"03","10年期国债"),
    合约标的_沪深300指数(DictCode.合约标的,"04","沪深300指数"),
    合约标的_中证500指数(DictCode.合约标的,"05","中证500指数"),
    合约标的_上证50指数(DictCode.合约标的,"06","上证50指数"),
	期货类型_国债期货(DictCode.期货类型,"FU01","国债期货"),
    期货类型_股指期货(DictCode.期货类型,"FU02","股指期货"),

    // 期货相关枚举值 start yufei 20201110
    期货合约代码前缀_TS(DictCode.期货合约代码前缀,"TS","TS"),
    期货合约代码前缀_TF(DictCode.期货合约代码前缀,"TF","TF"),
    期货合约代码前缀_T(DictCode.期货合约代码前缀,"T","T"),
    期货合约代码前缀_IF(DictCode.期货合约代码前缀,"IF","IF"),
    期货合约代码前缀_IC(DictCode.期货合约代码前缀,"IC","IC"),
    期货合约代码前缀_IH(DictCode.期货合约代码前缀,"IH","IH"),
    /** add by yanya on 20210309 添加行权的交易方向：行权-回售申请、行权-赎回结转 start**/
    交易方向_行权回售申请(DictCode.交易方向,"T67","行权-回售申请"),
    交易方向_行权赎回结转(DictCode.交易方向,"T68","行权-赎回结转"),
    /** add by yanya on 20210309 添加行权的交易方向：行权-回售申请、行权-赎回结转 end**/
    /** add by yanya on 20210309 添加分支序号类型：行权 start**/
    分支类型_行权(DictCode.分支类型,"D03","行权"),
    /** add by yanya on 20210309 添加分支序号类型：行权 end**/

    /** add by yanya on 20210309 行权状态增加放弃行权 start**/
    行权状态_放弃行权(DictCode.行权状态,"04","放弃行权"),
    /** add by yanya on 20210309 行权状态增加放弃行权 end**/

    /** add by yanya on 20210309 新增数据字典：行权回售申请交易处理 start**/
    行权回售申请交易处理_保留原数据(DictCode.行权回售申请交易处理,"01","保留原数据"),
    行权回售申请交易处理_重新估值(DictCode.行权回售申请交易处理,"02","重新估值"),
    /** add by yanya on 20210309 新增数据字典：行权回售申请交易处理 end**/

    // add by etliu 2021-04-20 权益类资产功能合并 start
    金融产品类型_投管用_权益类资产(DictCode.金融产品类型_投管用,"F37","权益类资产"),
    平安资产类型_权益类资产(DictCode.平安资产类型,"F19","权益类资产"),
    共通业务类型_权益类资产信息(DictCode.共通业务类型,"FINASSET21","权益类资产信息"),
    共通业务类型_权益类资产委托(DictCode.共通业务类型,"ETR41","权益类资产指令"),
    //共通业务类型_权益类资产申购(DictCode.共通业务类型,"TRD77","权益类资产申购"),
    //共通业务类型_权益类资产赎回(DictCode.共通业务类型,"TRD78","权益类资产赎回"),
    //共通业务类型_权益类资产买入(DictCode.共通业务类型,"TRD79","权益类资产买入"),
    //共通业务类型_权益类资产卖出(DictCode.共通业务类型,"TRD80","权益类资产卖出"),
    共通业务类型_权益类资产投资交易(DictCode.共通业务类型,"TRD77","权益类资产交易"),
    平安业务类型_权益类资产_申购申请(DictCode.平安业务类型,"155","权益类资产申购申请"),
    平安业务类型_权益类资产_申购确认(DictCode.平安业务类型,"156","权益类资产申购确认"),
    平安业务类型_权益类资产_赎回申请(DictCode.平安业务类型,"157","权益类资产赎回申请"),
    平安业务类型_权益类资产_赎回确认(DictCode.平安业务类型,"158","权益类资产赎回确认"),
    平安业务类型_权益类资产_赎回到账(DictCode.平安业务类型,"159","权益类资产赎回到账"),
    平安业务类型_权益类资产_买入(DictCode.平安业务类型,"160","权益类资产买入"),
    平安业务类型_权益类资产_卖出(DictCode.平安业务类型,"161","权益类资产卖出"),
    共通业务类型_权益类资产存续期(DictCode.共通业务类型,"TRD81","权益类资产存续期"),
    平安业务类型_权益类资产_现金分红(DictCode.平安业务类型,"162","权益类资产现金分红"),
    共通业务类型_权益类资产估值行情信息(DictCode.共通业务类型,"MST30","权益类资产估值行情信息"),
    // add by etliu 2021-04-20 权益类资产功能合并 end
    /** add by tanxuan on 20210310 多级法人权限控制改造 start**/
    权限模式_银行模式(DictCode.权限模式,"01","银行模式"),
    权限模式_联社模式(DictCode.权限模式,"02","联社模式"),
    /** add by tanxuan on 20210310 多级法人权限控制改造 end**/

    /** add by yanya on 20210309 添加现金流一级类型-行权 start**/
    现金流一级类型_行权(DictCode.现金流一级类型,"05","行权"),
    /** add by yanya on 20210309 添加现金流一级类型-行权 end**/

    //add by yzg 20210422 start
    佣金计算方式_按证券代码汇总(DictCode.佣金计算方式, "01", "按证券代码汇总"),
    佣金计算方式_按成交编号计算(DictCode.佣金计算方式, "02", "按成交编号计算"),
    佣金计算方式_按申请编号汇总(DictCode.佣金计算方式, "03", "按申请编号汇总"),
    分档模式_逐档计算汇总(DictCode.分档模式, "01", "逐档计算汇总"),
    分档条件_小于等于(DictCode.分档条件,"01", "小于等于"),
    分档条件_大于(DictCode.分档条件,"02", "大于"),
    //add by yzg 20210422 end
    /** add by yanya on 20210316 增加一次性费用赎回费（产品留存）**/
    一次性费用类型_赎回费_产品留存(DictCode.一次性费用类型, "B16", "赎回费（产品留存）"),

	/**add by yanya on 20201229 增加辅助工具类科目变更处理方式 start**/
    科目号变更处理方式_默认(DictCode.科目号变更处理方式,"01","默认"),
    科目号变更处理方式_批量(DictCode.科目号变更处理方式,"02","批量"),
    /**add by yanya on 20201229 增加辅助工具类科目变更处理方式 end**/

	/** add by tanxuan on 20210315 多级法人权限控制改造 start**/
    共通业务类型_拆借类资产(DictCode.共通业务类型,"V33","拆借类资产"),
    共通业务类型_回购类资产(DictCode.共通业务类型,"V34","回购类资产"),
    共通业务类型_债券借贷标的信息(DictCode.共通业务类型,"V35","债券借贷标的信息"),
    /** add by tanxuan on 20210315 多级法人权限控制改造 end**/
	/** add by fanyunhan on 20210811 风险五级分类 start**/
    风险五级分类_关注(DictCode.风险五级分类,"01","关注"),
    风险五级分类_次级(DictCode.风险五级分类,"02","次级"),
    风险五级分类_可疑(DictCode.风险五级分类,"03","可疑"),
    风险五级分类_损失(DictCode.风险五级分类,"04","损失"),
    风险五级分类_正常(DictCode.风险五级分类,"05","正常"),
	/** add by fanyunhan on 20210811 风险五级分类 end**/
     /** add by tanxuan on 20210318 新增功能费用预提配置 start**/
    共通业务类型_预提费用配置(DictCode.共通业务类型,"V36","预提费用配置"),
    /** add by tanxuan on 20210318 新增功能费用预提配置 end**/

	估值数据来源_手工(DictCode.估值数据来源,"01","手工"),
    估值数据来源_Wind(DictCode.估值数据来源,"02","Wind"),
    估值数据来源_资管系统(DictCode.估值数据来源,"03","资管系统"),
    估值数据来源_投管系统(DictCode.估值数据来源,"04","投管系统"),
    平安业务类型_计划类资产_净值型_买入(DictCode.平安业务类型,"151","计划类资产（净值型）买入"),
    平安业务类型_计划类资产_净值型_卖出(DictCode.平安业务类型,"152","计划类资产（净值型）卖出"),
    平安业务类型_计划类资产_货币型_买入(DictCode.平安业务类型,"153","计划类资产（货币型）买入"),
    平安业务类型_计划类资产_货币型_卖出(DictCode.平安业务类型,"154","计划类资产（货币型）卖出"),
    共通业务类型_每日债券行情信息(DictCode.共通业务类型,"MST27","每日债券行情信息"),
    共通业务类型_每日基金行情信息(DictCode.共通业务类型,"MST28","每日基金行情信息"),
    指令类型_债券类资产_申购确认(DictCode.指令类型,"2740","资金划款-债券类资产申购确认"),
    银行账场景代码_产品固定管理费支付(DictCode.银行账场景代码,"B8103","产品固定管理费支付"),
    银行账场景代码_产品固定管理费计提(DictCode.银行账场景代码,"B8104","产品固定管理费计提"),
    银行账场景代码_产品浮动管理费支付(DictCode.银行账场景代码,"B8105","产品浮动管理费支付"),
    银行账场景代码_产品浮动管理费计提(DictCode.银行账场景代码,"B8104","产品浮动管理费计提"),
    委托状态_待分发(DictCode.委托状态,"09","待分发"),
    共通业务类型_证券组合费支付(DictCode.共通业务类型,"FINPROD31","证券组合费支付"),

    /** 港股通**/
    是否开通港股通_是(DictCode.是否开通港股通,"01","是"),
    是否开通港股通_否(DictCode.是否开通港股通,"02","否"),

    共通业务类型_港股通投资委托(DictCode.共通业务类型,"ETR_HKSE","港股通投资委托"),
    共通业务类型_额度管理(DictCode.共通业务类型,"RSK25","额度管理"),
    风险管理_质押式回购导入白名单(DictCode.共通业务类型,"REPRISKWHITE","质押式回购导入白名单"),

    /**add by fanyunhan on 20210804 start**/
    平滑区间_3个月(DictCode.平滑区间,"02","3个月"),
    收益率曲线类型_SP即期(DictCode.收益率曲线类型,"01","SP即期"),
    共通业务类型_现金流折现模型曲线配置(DictCode.共通业务类型,"MOD06","现金流折现模型曲线配置"),
    共通业务类型_风险溢价调整配置(DictCode.共通业务类型,"MOD12","风险溢价调整配置"),
    资产四级分类_优先股(DictCode.资产四级分类,"023","优先股"), // add by zhangfei 2021年6月30日18:00:24
    共通业务类型_预期股息增长率配置(DictCode.共通业务类型,"STCOKDIVITRATE","预期股息增长率配置"),

    /**add by fanyunhan on 20210804 end**/

    //20210803 by yuzj start
    共通业务类型_评级PD维护信息(DictCode.共通业务类型,"MOD07","评级PD维护信息"),
    共通业务类型_资产重分类交易(DictCode.共通业务类型,"TRD77","资产重分类交易"),
    共通业务类型_资产大类评级配置(DictCode.共通业务类型,"MOD01","资产大类评级配置"),
    共通业务类型_特殊资产评级配置(DictCode.共通业务类型,"MOD02","特殊资产评级配置"),
    共通业务类型_LGD违约损失率维护(DictCode.共通业务类型,"MOD05","LGD违约损失率维护"),
    共通业务类型_二叉树模型参数配置(DictCode.共通业务类型,"MOD09","二叉树模型参数配置"),
    共通业务类型_内外部评级映射管理(DictCode.共通业务类型,"MOD03","内外部评级映射管理"),
    共通业务类型_前瞻因子维护(DictCode.共通业务类型,"PDFACTOR","前瞻因子维护"),
    共通业务类型_特殊资产LGD维护信息(DictCode.共通业务类型,"MOD08","特殊资产LGD维护信息"),
    共通业务类型_减值阶段参数管理(DictCode.共通业务类型,"STAGEPARA","减值阶段参数管理"),
    共通业务类型_前瞻因子权重配置(DictCode.共通业务类型,"PDWEIGHT","前瞻因子权重配置"),

    减值要素_本金逾期超过天数(DictCode.减值要素,"01","本金逾期超过天数（含）"),
    减值要素_利息逾期超过天数(DictCode.减值要素,"02","利息逾期超过天数（含）"),
    减值要素_公司评级信息低于(DictCode.减值要素,"03","公司评级信息低于（含）"),
    减值要素_风险五级分类(DictCode.减值要素,"04","风险五级分类"),
    减值要素_公司评级信息下调级数(DictCode.减值要素,"05","公司评级信息下调级数"),

    评级PD类型_债券_其他债权(DictCode.评级PD类型,"01","债券、其他债权"),
    评级PD类型_回购(DictCode.评级PD类型,"02","回购"),
    评级PD类型_存款(DictCode.评级PD类型,"03","存款"),

    代偿期类型_行权(DictCode.代偿期类型,"01","行权"),
    代偿期类型_到期(DictCode.代偿期类型,"02","到期"),

    减值数据来源_手工(DictCode.减值数据来源,"01","手工"),
    减值数据来源_中债接入(DictCode.减值数据来源,"02","中债"),
    减值数据来源_wind接入(DictCode.减值数据来源,"03","wind"),
    减值数据来源_模型(DictCode.减值数据来源,"04","模型"),



    人行月度明细_期限类型_1个月(DictCode.人行月度明细_期限类型,"01","1个月（含）以下"),
    人行月度明细_期限类型_1到3个月(DictCode.人行月度明细_期限类型,"02","1-3个月（含）"),
    人行月度明细_期限类型_3到6个月(DictCode.人行月度明细_期限类型,"03","3-6个月（含）"),
    人行月度明细_期限类型_6到12个月(DictCode.人行月度明细_期限类型,"04","6-12个月（含）"),
    人行月度明细_期限类型_1到2年(DictCode.人行月度明细_期限类型,"05","1-2年（含）"),
    人行月度明细_期限类型_2到3年(DictCode.人行月度明细_期限类型,"06","2-3年（含）"),
    人行月度明细_期限类型_3年以上(DictCode.人行月度明细_期限类型,"07","3年以上"),
    人行月度明细_期限类型_无固定期限(DictCode.人行月度明细_期限类型,"08","无固定期限"),

    中债月度明细_期限类型_90天以内(DictCode.中债月度明细_期限类型,"A","90天以内"),
    中债月度明细_期限类型_90天到6个月(DictCode.中债月度明细_期限类型,"B","90天（含）-6个月(含)"),
    中债月度明细_期限类型_6到12个月(DictCode.中债月度明细_期限类型,"C","6-12个月（含）"),
    中债月度明细_期限类型_1到3年(DictCode.中债月度明细_期限类型,"D","1-3年（含）"),
    中债月度明细_期限类型_3年以上(DictCode.中债月度明细_期限类型,"E","3年以上"),

    中债月度明细_银行资本补充工具_优先股(DictCode.中债月度明细_银行资本补充工具,"01","3.2.1 优先股"),
    中债月度明细_银行资本补充工具_永续债(DictCode.中债月度明细_银行资本补充工具,"02","3.2.2 永续债"),
    中债月度明细_银行资本补充工具_二级资本债(DictCode.中债月度明细_银行资本补充工具,"03","3.2.3 二级资本债"),
    中债月度明细_银行资本补充工具_可转债(DictCode.中债月度明细_银行资本补充工具,"04","3.2.4 可转债"),
    中债月度明细_银行资本补充工具_其他银行资本补充工具(DictCode.中债月度明细_银行资本补充工具,"05","3.2.5 其他银行资本补充工具"),


    中债月度明细_非标行业_农林牧渔业(DictCode.中债月度明细_非标行业,"01","3.3.1 农林牧渔业"),
    中债月度明细_非标行业_制造业(DictCode.中债月度明细_非标行业,"02","3.3.2 制造业"),
    中债月度明细_非标行业_采矿业(DictCode.中债月度明细_非标行业,"03","3.3.3 采矿业"),
    中债月度明细_非标行业_建筑业(DictCode.中债月度明细_非标行业,"04","3.3.4 建筑业"),
    中债月度明细_非标行业_基础设施建设(DictCode.中债月度明细_非标行业,"05","3.3.5 基础设施建设"),
    中债月度明细_非标行业_房地产业(DictCode.中债月度明细_非标行业,"06","3.3.6 房地产业"),
    中债月度明细_非标行业_金融业(DictCode.中债月度明细_非标行业,"07","3.3.7 金融业"),
    中债月度明细_非标行业_其他服务业(DictCode.中债月度明细_非标行业,"08","3.3.8 其他服务业"),


    //20210803 by yuzj end
    //modify by yanya on 20210824 增值税资产分类_股票
    增值税资产分类_股票_上海股票(DictCode.增值税资产分类,"L01","上海股票"),
    增值税资产分类_股票_深圳股票(DictCode.增值税资产分类,"L02","深圳股票"),
    增值税资产分类_股票_沪港通(DictCode.增值税资产分类,"L03","沪港通"),
    增值税资产分类_股票_深港通(DictCode.增值税资产分类,"L04","深港通"),

    // add by weipeng：增加减值方案类型
    减值方案类型_毕马威(DictCode.减值方案类型,"01","毕马威方案"),
    减值方案类型_普华(DictCode.减值方案类型,"02","普华方案"),

    // 增加评级机构类型
    评级机构类型_最新(DictCode.评级机构类型,"01","最新"),
    评级机构类型_指定(DictCode.评级机构类型,"02","指定"),

    // 添加曲线来源
    曲线来源_自定义曲线(DictCode.曲线来源,"01","自定义曲线"),
    曲线来源_第三方曲线(DictCode.曲线来源,"02","第三方曲线"),

    共通业务类型_收益率曲线管理(DictCode.共通业务类型,"MOD13","收益率曲线管理"),

    内部评级_AAA(DictCode.内部评级,"02","内部评级_AAA"),
    内部评级_AA_PLUS(DictCode.内部评级,"04","内部评级_AA+"),
    内部评级_AA(DictCode.内部评级,"05","内部评级_AA"),
    内部评级_AA_MINUS(DictCode.内部评级,"06","内部评级_AA-"),
    内部评级_C(DictCode.内部评级,"26","内部评级_C"),

    兜底评级_AAA(DictCode.系统参数兜底评级,"04","兜底评级_AAA"),
    兜底评级_AA_PLUS(DictCode.系统参数兜底评级,"03","兜底评级_AA+"),
    兜底评级_AA(DictCode.系统参数兜底评级,"02","兜底评级_AA"),
    兜底评级_AA_MINUS(DictCode.系统参数兜底评级,"01","兜底评级_AA-"),


    //20210922 从DictCodeList迁移过来  by yflv start
    共通业务类型_资产要素信息维护(DictCode.共通业务类型,"MST26","资产要素信息维护"),
	共通业务类型_资产基本信息维护(DictCode.共通业务类型,"SVR01","资产基本信息维护"),
    项目类计提区间倒减方式_倒减科目余额(DictCode.项目类计提区间倒减方式,"01","倒减科目余额"),
	项目类计提区间倒减方式_倒减前一日计算结果(DictCode.项目类计提区间倒减方式,"02","倒减前一日计算结果"),
	//20210922 从DictCodeList迁移过来  by yflv end
	
	//20211008 从DictCodeList迁移过来  by yflv start
	估值来源_第三方估值_OTH(DictCode.估值来源,"OTH","第三方估值(OTH)"),
	估值市价_第三方估值(DictCode.估值市价, "13", "第三方估值"),
	评级对象显示类型_发行人评级(DictCode.评级对象显示类型,"91","发行人评级"),
	//20211008 从DictCodeList迁移过来  by yflv end
	
	//20211213 从DictCodeList迁移过来  by yflv start
	CSTP资产类型_现券买卖(DictCode.CSTP资产类型,"BOND","现券买卖"),
	CSTP资产类型_质押式回购(DictCode.CSTP资产类型,"REPO","质押式回购"),
	//20211213 从DictCodeList迁移过来  by yflv end

    估值市价_外管局(DictCode.估值市价, "10", "外管局"),
    估值市价_央行(DictCode.估值市价, "11", "央行"),
    估值市价_外汇交易中心(DictCode.估值市价, "12", "外汇交易中心"),
    录入方式_模型生成(DictCode.录入方式,"07","模型"),

    //add by chenjiaxing 20211015 start
    共通业务类型_券商流水核对(DictCode.共通业务类型,"STL07","券商流水核对"),
    对账状态结果_不一致(DictCode.对账状态结果,"0","不一致"),
    对账状态结果_一致(DictCode.对账状态结果,"1","一致"),
    对账状态结果_待处理(DictCode.对账状态结果,"2","待处理"),
    对账状态结果_手工完成(DictCode.对账状态结果,"3","手工完成"),
    //add by chenjiaxing 20211015 end
	
	下行交易匹配状态_未匹配(DictCode.下行交易匹配状态,"0","未匹配"),
    下行交易匹配状态_部分匹配(DictCode.下行交易匹配状态,"1","部分匹配"),
    下行交易匹配状态_匹配完成(DictCode.下行交易匹配状态,"2","匹配完成"),

    /**
     * 头寸使用流程节点
     */
    流程节点_流程提交(DictCode.流程节点,"01","流程提交"),
    流程节点_审批生效(DictCode.流程节点,"02","审批生效"),
    流程节点_流程退回(DictCode.流程节点,"03","流程退回"),
    /**
     * 头寸系统动作
     */
    系统动作_新建(DictCode.系统动作,"01","新建"),
    系统动作_修改(DictCode.系统动作,"02","撤销"),
    系统动作_撤回(DictCode.系统动作,"03","撤回"),
    系统动作_退回(DictCode.系统动作,"04","退回"),
    系统动作_关闭(DictCode.系统动作,"05","关闭"),
    系统动作_成交(DictCode.系统动作,"06","成交"),
    系统动作_完成(DictCode.系统动作,"07","完成"),
    系统动作_作废(DictCode.系统动作,"08","作废"),
    系统动作_回滚(DictCode.系统动作,"09","回滚"),
    系统动作_撤销(DictCode.系统动作,"10","撤销"),
    系统动作_检查(DictCode.系统动作,"11","检查"),
    /**
     * 头寸业务类型
     */
    头寸业务类型_债券一级投标(DictCode.头寸业务类型,"01","债券一级投标"),
    头寸业务类型_现券交易(DictCode.头寸业务类型,"02","现券交易"),
    头寸业务类型_债券行权交易(DictCode.头寸业务类型,"03","债券行权交易"),
    头寸业务类型_债券存续期交易(DictCode.头寸业务类型,"04","债券存续期交易"),
    头寸业务类型_质押式回购首期(DictCode.头寸业务类型,"05","质押式回购首期"),
    头寸业务类型_买断式回购首期(DictCode.头寸业务类型,"10","买断式回购首期"),
    头寸业务类型_质押式回购到期(DictCode.头寸业务类型,"06","质押式回购到期"),
    头寸业务类型_债券借贷首期(DictCode.头寸业务类型,"12","债券借贷首期"),
	头寸业务类型_拆借首期(DictCode.头寸业务类型,"18","拆借首期"),
    头寸业务类型_协议回购首期(DictCode.头寸业务类型, "09", "协议回购首期"),
    头寸业务类型_协议回购中途换券(DictCode.头寸业务类型, "10", "协议回购中途换券"),
    头寸业务类型_协议回购提前购回(DictCode.头寸业务类型, "11", "协议回购提前购回"),
    头寸业务类型_协议回购到期购回(DictCode.头寸业务类型, "12", "协议回购到期购回"),
    头寸业务类型_协议回购到期续作(DictCode.头寸业务类型, "13", "协议回购到期续作"),
    头寸业务类型_协议回购解除质押(DictCode.头寸业务类型, "14", "协议回购解除质押"),
    头寸业务类型_网下申购(DictCode.头寸业务类型, "15", "网下申购"),
    头寸业务类型_网上申购(DictCode.头寸业务类型, "16", "网上申购"),
    头寸业务类型_配债(DictCode.头寸业务类型, "17", "配债"),
    头寸业务类型_债转股(DictCode.头寸业务类型, "18", "债转股"),
    头寸业务类型_通用回购债券入库(DictCode.头寸业务类型, "19", "通用回购债券入库"),
    头寸业务类型_通用回购债券出库(DictCode.头寸业务类型, "20", "通用回购债券出库"),
    头寸业务类型_通用回购首期(DictCode.头寸业务类型, "21", "通用回购首期"),
    头寸业务类型_通用回购到期(DictCode.头寸业务类型, "22", "通用回购到期"),
    头寸业务类型_上市流通(DictCode.头寸业务类型, "23", "上市流通"),
    头寸业务类型_限售解禁(DictCode.头寸业务类型, "24", "限售解禁"),
    头寸业务类型_股票交易(DictCode.头寸业务类型, "25", "股票交易"),
    头寸业务类型_配股(DictCode.头寸业务类型, "26", "配股"),
    头寸业务类型_股票分红(DictCode.头寸业务类型, "27", "股票分红"),
    头寸业务类型_股票送股(DictCode.头寸业务类型, "28", "股票送股"),
    头寸业务类型_红股上市(DictCode.头寸业务类型, "29", "红股上市"),
    头寸业务类型_基金交易(DictCode.头寸业务类型, "30", "基金交易"),
    头寸业务类型_基金存续期(DictCode.头寸业务类型, "31", "基金存续期"),
    头寸业务类型_银证转账(DictCode.头寸业务类型, "32", "银证转账"),
    头寸业务类型_证银转账(DictCode.头寸业务类型, "33", "证银转账"),
    头寸业务类型_债券一级申购(DictCode.头寸业务类型, "34", "债券一级申购"),
    头寸业务类型_信用保护凭证交易(DictCode.头寸业务类型, "35", "信用保护凭证交易"),

    /**
     * 头寸业务动作
     */
    业务动作_投资指令(DictCode.业务动作,"01","投资指令"),
    业务动作_交易登记(DictCode.业务动作,"02","交易登记"),
    业务动作_汇总确认(DictCode.业务动作,"03","汇总确认"),
    业务动作_中标结果维护(DictCode.业务动作,"04","中标结果维护"),
    业务动作_预录入(DictCode.业务动作,"05","预录入"),
    业务动作_成交确认(DictCode.业务动作,"06","成交确认"),
    业务动作_清算成功(DictCode.业务动作,"07","清算成功"),
    业务动作_清算失败(DictCode.业务动作,"08","清算失败"),
    业务动作_交收确认(DictCode.业务动作,"09","交收确认"),
    业务动作_交收失败(DictCode.业务动作,"10","交收失败"),
    业务动作_对话报价(DictCode.业务动作,"11","对话报价"),
    业务动作_请求报价(DictCode.业务动作,"12","请求报价"),
    业务动作_指令日终关闭(DictCode.业务动作,"13","指令日终关闭"),
    业务动作_指令手动关闭(DictCode.业务动作,"14","指令手动关闭"),
    业务动作_指令自动完成(DictCode.业务动作,"15","指令自动完成"),
    业务动作_交易下单(DictCode.业务动作,"16","交易下单"),
    业务动作_成交回报(DictCode.业务动作,"17","成交回报"),
    业务动作_撤委托(DictCode.业务动作,"18","撤委托"),
    业务动作_交收回溯(DictCode.业务动作,"20","交收回溯"),
    业务动作_待交收(DictCode.业务动作,"22","待交收"),
    业务动作_成交匹配(DictCode.业务动作,"19","成交匹配"),
    业务动作_资金划拨新建(DictCode.业务动作,"29","资金划拨新建"),
    业务动作_资金划拨撤回(DictCode.业务动作,"30","资金划拨撤回"),
    业务动作_中签(DictCode.业务动作,"26","中签"),
    业务动作_缴款(DictCode.业务动作,"27","缴款"),
    业务动作_上市(DictCode.业务动作,"28","上市"),


    资产类型_现金账户持仓(DictCode.头寸资产类型, "C_01", "现金账户持仓"),
    资产类型_托管户可用资金(DictCode.头寸资产类型, "C_02", "托管户可用资金"),
    资产类型_证券户可取资金(DictCode.头寸资产类型, "C_03", "证券户可取资金"),
    资产类型_证券户可用资金(DictCode.头寸资产类型, "C_04", "证券户可用资金"),
    资产类型_冻结资金(DictCode.头寸资产类型, "C_05", "净额中间值"),
    资产类型_预增资金(DictCode.头寸资产类型, "C_06", "预增资金"),
    资产类型_预减资金(DictCode.头寸资产类型, "C_07", "预减资金"),
    资产类型_在途资金(DictCode.头寸资产类型, "C_08", "在途资金"),
    资产类型_手工调整资金(DictCode.头寸资产类型, "C_09", "手工调整资金"),
    资产类型_实时净申赎资金(DictCode.头寸资产类型, "C_10", "实时净申赎资金"),
    
    资产类型_资产账户持仓(DictCode.头寸资产类型,"A_001","资产账户持仓"),


    资产类型_本方券手工调整(DictCode.头寸资产类型,"A_002","本方券手工调整"),
    资产类型_融入券手工调整(DictCode.头寸资产类型,"A_003","融入券手工调整"),

    资产类型_债券本方券可用持仓(DictCode.头寸资产类型,"A_004","债券本方券可用持仓"),
    资产类型_债券融入券可用持仓(DictCode.头寸资产类型,"A_005","债券融入券可用持仓"),
    资产类型_债券本方券冻结持仓(DictCode.头寸资产类型,"A_006","债券本方券冻结持仓"),
    资产类型_债券融入券冻结持仓(DictCode.头寸资产类型,"A_007","债券融入券冻结持仓"),
    资产类型_债券本方券在途持仓(DictCode.头寸资产类型,"A_008","债券本方券在途持仓"),
    资产类型_债券融入券在途持仓(DictCode.头寸资产类型,"A_009","债券融入券在途持仓"),

    资产类型_质押式双边回购本方券可用持仓(DictCode.头寸资产类型,"A_010","质押式双边回购本方券可用持仓"),
    资产类型_质押式双边回购融入券可用持仓(DictCode.头寸资产类型,"A_011","质押式双边回购融入券可用持仓"),
    资产类型_质押式双边回购本方券已质押持仓(DictCode.头寸资产类型,"A_012","质押式双边回购本方券已质押持仓"),
    资产类型_质押式双边回购融入券已质押持仓(DictCode.头寸资产类型,"A_013","质押式双边回购融入券已质押持仓"),
    资产类型_质押式双边回购本方券在途持仓(DictCode.头寸资产类型,"A_014","质押式双边回购本方券在途持仓"),
    资产类型_质押式双边回购融入券在途持仓(DictCode.头寸资产类型,"A_015","质押式双边回购融入券在途持仓"),

    资产类型_买断式回购本方券可用持仓(DictCode.头寸资产类型,"A_016","买断式回购本方券可用持仓"),
    资产类型_买断式回购融入券可用持仓(DictCode.头寸资产类型,"A_017","买断式回购融入券可用持仓"),
    资产类型_买断式回购本方券已融入持仓(DictCode.头寸资产类型,"A_018","买断式回购本方券已融入持仓"),
    资产类型_买断式回购融入券已融入持仓(DictCode.头寸资产类型,"A_019","买断式回购融入券已融入持仓"),
    资产类型_买断式回购本方券已融出持仓(DictCode.头寸资产类型,"A_020","买断式回购本方券已融出持仓"),
    资产类型_买断式回购融入券已融出持仓(DictCode.头寸资产类型,"A_021","买断式回购融入券已融出持仓"),
    资产类型_买断式回购本方券冻结持仓(DictCode.头寸资产类型,"A_022","买断式回购本方券冻结持仓"),
    资产类型_买断式回购融入券冻结持仓(DictCode.头寸资产类型,"A_023","买断式回购融入券冻结持仓"),
    资产类型_买断式回购本方券在途持仓(DictCode.头寸资产类型,"A_024","买断式回购本方券在途持仓"),
    资产类型_买断式回购融入券在途持仓(DictCode.头寸资产类型,"A_025","买断式回购融入券在途持仓"),

    资产类型_债券借贷本方券可用持仓(DictCode.头寸资产类型,"A_026","债券借贷本方券可用持仓"),
    资产类型_债券借贷融入券可用持仓(DictCode.头寸资产类型,"A_027","债券借贷融入券可用持仓"),
    资产类型_债券借贷本方券已融入持仓(DictCode.头寸资产类型,"A_028","债券借贷本方券已融入持仓"),
    资产类型_债券借贷融入券已融入持仓(DictCode.头寸资产类型,"A_029","债券借贷融入券已融入持仓"),
    资产类型_债券借贷本方券已融出持仓(DictCode.头寸资产类型,"A_030","债券借贷本方券已融出持仓"),
    资产类型_债券借贷融入券已融出持仓(DictCode.头寸资产类型,"A_031","债券借贷融入券已融出持仓"),
    资产类型_债券借贷本方券已质押持仓(DictCode.头寸资产类型,"A_032","债券借贷本方券已质押持仓"),
    资产类型_债券借贷融入券已质押持仓(DictCode.头寸资产类型,"A_033","债券借贷融入券已质押持仓"),
    资产类型_债券借贷本方券冻结持仓(DictCode.头寸资产类型,"A_034","债券借贷本方券冻结持仓"),
    资产类型_债券借贷融入券冻结持仓(DictCode.头寸资产类型,"A_035","债券借贷融入券冻结持仓"),
    资产类型_债券借贷本方券在途持仓(DictCode.头寸资产类型,"A_036","债券借贷本方券在途持仓"),
    资产类型_债券借贷融入券在途持仓(DictCode.头寸资产类型,"A_037","债券借贷融入券在途持仓"),
    资产类型_债券本方券上交所净额结算可用持仓(DictCode.头寸资产类型,"A_038","债券本方券上交所净额结算可用持仓"),
    资产类型_债券本方券非净额结算可用持仓(DictCode.头寸资产类型,"A_039","债券本方券非净额结算可用持仓"),
    资产类型_债券本方券深交所净额结算竞价可用持仓(DictCode.头寸资产类型,"A_040","资产类型_债券本方券深交所净额结算竞价可用持仓"),
    资产类型_债券本方券深交所净额结算大宗可用持仓(DictCode.头寸资产类型,"A_041","债券本方券深交所净额结算大宗可用持仓"),
    资产类型_质押式协议回购本方券非净额结算可用持仓(DictCode.头寸资产类型,"A_053","质押式协议回购本方券非净额结算可用持仓"),
    资产类型_质押式通用回购入库质押券持仓(DictCode.头寸资产类型,"A_070","资产类型_质押式通用回购入库质押券持仓"),
    资产类型_质押式通用回购已使用融资券总额度(DictCode.头寸资产类型,"A_071","质押式通用回购已使用融资券总额度"),
    资产类型_冻结持仓(DictCode.头寸资产类型,"A_076","资产类型_冻结持仓"),
    资产类型_股票上交所可用持仓(DictCode.头寸资产类型,"A_079","资产类型_股票上交所可用持仓"),
    资产类型_股票深交所竞价可用持仓(DictCode.头寸资产类型,"A_080","资产类型_股票深交所竞价可用持仓"),
    资产类型_股票深交所大宗可用持仓(DictCode.头寸资产类型,"A_081","资产类型_股票深交所大宗可用持仓"),
    资产类型_封闭式基金上交所可用持仓(DictCode.头寸资产类型,"A_093","资产类型_封闭式基金上交所可用持仓"),
    资产类型_封闭式基金深交所竞价可用持仓(DictCode.头寸资产类型,"A_095","资产类型_封闭式基金深交所竞价可用持仓"),
    资产类型_封闭式基金深交所大宗可用持仓(DictCode.头寸资产类型,"A_096","资产类型_封闭式基金深交所大宗可用持仓"),
    资产类型_通用回购融资券可用持仓(DictCode.头寸资产类型,"A_148","通用回购融资券可用持仓"),
    资产类型_通用回购融资券折算前额度(DictCode.头寸资产类型,"A_158","资产类型_通用回购融资券折算前额度"),
    资产类型_通用回购融资券折算后额度(DictCode.头寸资产类型,"A_159","资产类型_通用回购融资券折算后额度"),



    资产类型_指令汇总可用持仓(DictCode.头寸资产类型,"S_001","指令汇总可用持仓"),
    资产类型_可质押持仓(DictCode.头寸资产类型,"S_002","可质押持仓"),
    资产类型_融入券卖空待购回持仓(DictCode.头寸资产类型,"S_003","融入券卖空待购回持仓"),
    资产类型_汇总可用现金(DictCode.头寸资产类型,"S_004","汇总可用现金"),
    资产类型_指令汇总可用现金(DictCode.头寸资产类型,"S_005","指令汇总可用现金"),
    资产类型_交易汇总可用持仓(DictCode.头寸资产类型,"S_007","交易汇总可用持仓"),

    //头寸交易方向
    交易方向_银证转账(DictCode.交易方向,"HK01","银证转账"),
    交易方向_证银转账(DictCode.交易方向,"HK02","证银转账"),

    //共通业务类型-固收类资产交易
    共通业务类型_固收类资产交易(DictCode.共通业务类型,"TRD85","固收类资产交易"),

    /**
     * 操作类型
     */
    操作类型_新建(DictCode.操作类型,"01","新建"),
    操作类型_修改(DictCode.操作类型,"02","修改"),
    操作类型_撤回(DictCode.操作类型,"03","撤销"),
    操作类型_关闭(DictCode.操作类型,"04","关闭"),
    操作类型_退回(DictCode.操作类型,"05","退回"),
    操作类型_分发(DictCode.操作类型,"06","分发"),
    操作类型_接收(DictCode.操作类型,"07","接收"),
    操作类型_放弃(DictCode.操作类型,"08","放弃"),
    操作类型_导出(DictCode.操作类型,"09","导出"),
    操作类型_成交(DictCode.操作类型,"10","成交"),
    操作类型_拒绝(DictCode.操作类型,"11","拒绝"),
    操作类型_成交确认(DictCode.操作类型,"12","成交确认"),
    操作类型_手工匹配确认(DictCode.操作类型,"13","手工匹配确认"),
    操作类型_自动匹配确认(DictCode.操作类型,"14","自动匹配确认"),
    操作类型_业务模式变更确认(DictCode.操作类型,"15","业务模式变更确认"),
    操作类型_强制完成(DictCode.操作类型,"15","强制完成"),

    操作类型_自动加券(DictCode.操作类型,"17","自动加券"),
    操作类型_上市流通(DictCode.操作类型,"18","上市流通"),
    操作类型_上市流通撤销(DictCode.操作类型,"19","上市流通撤销"),
    操作类型_资讯数据覆盖(DictCode.操作类型,"20","资讯数据覆盖"),
    操作类型_利率调整(DictCode.操作类型,"21","利率调整"),
    操作类型_中标结果维护(DictCode.操作类型,"22","中标结果维护"),
    操作类型_中标结果撤销(DictCode.操作类型,"23","中标结果撤销"),
    债券性质_债性(DictCode.债券性质, "01", "债性"),
    债券性质_股性(DictCode.债券性质, "02", "股性"),

    报表名称_理财产品转型情况月度统计表(DictCode.报表名称,"35","理财产品转型情况月度统计表"),

    上游接口文件类型_产品利率基本信息(DictCode.上游接口文件类型,"32","产品利率基本信息"),
    上游接口文件类型_资产利率基本信息(DictCode.上游接口文件类型,"33","资产利率基本信息"),
    //modify by yanya on 20220301 增加作业规则 产品系列、投资性质
    作业规则1_产品系列(DictCode.作业规则1,"PROD_SERIES","产品系列"),
    作业规则1_投资性质(DictCode.作业规则1,"NATURE_INVEST","投资性质"),
    上游接口文件类型_销售结算资金交易信息表(DictCode.上游接口文件类型, "35", "销售结算资金交易信息表"),
    共通业务类型_赎回登记(DictCode.共通业务类型,"TRD91","赎回登记"),
    回购方式_双边回购(DictCode.回购方式,"1","双边回购"),
    共通业务类型_本币业务指令_债券(DictCode.共通业务类型,"ETR52","本币业务指令-债券"),
    共通业务类型_本币业务指令_质押式回购(DictCode.共通业务类型,"ETR53","本币业务指令-质押式回购"),
    共通业务类型_一级投标指令(DictCode.共通业务类型,"ETR18","一级投标指令"),
    共通业务类型_本币业务交易_债券_登记(DictCode.共通业务类型,"TRD85","本币业务交易-债券-登记"),
    共通业务类型_本币业务交易_债券_对话(DictCode.共通业务类型,"TRD86","本币业务交易-债券-对话"),
    共通业务类型_本币业务交易_债券_请求(DictCode.共通业务类型,"TRD87","本币业务交易-债券-请求"),
    共通业务类型_本币业务交易_质押式回购_登记(DictCode.共通业务类型,"TRD88","本币业务交易-质押式回购-登记"),
    共通业务类型_本币业务交易_质押式回购_对话(DictCode.共通业务类型,"TRD89","本币业务交易-债券-对话"),
    共通业务类型_交收管理(DictCode.共通业务类型,"TRD90","交收管理"),
    共通业务类型_指令强制完成(DictCode.共通业务类型,"ETR_FINISH","指令强制完成"),
    行内资产四级分类_交易商协会ABN(DictCode.行内资产四级分类,"127","交易商协会ABN"),
    行内资产四级分类_银保监会主管ABS(DictCode.行内资产四级分类,"128","银保监会主管ABS"),
    业务模式_收取合同约定的现金流(DictCode.业务模式,"AC","收取合同约定的现金流"),
    业务模式_出售(DictCode.业务模式,"FVTPL","出售"),
    投管业务类型_竞价交易(DictCode.投管业务类型,"EX001","竞价交易"),
    投管业务类型_大宗交易(DictCode.投管业务类型,"EX002","大宗交易"),
    投管业务类型_行权(DictCode.投管业务类型,"EX003","行权"),
    投管业务类型_债转股(DictCode.投管业务类型,"EX004","债转股"),
    投管业务类型_质押券出入库(DictCode.投管业务类型,"EX005","质押券出入库"),
    投管业务类型_配债(DictCode.投管业务类型,"EX006","配债"),
    投管业务类型_可转债申购(DictCode.投管业务类型,"EX007","可转债申购"),
    投管业务类型_配股(DictCode.投管业务类型,"EX008","配股"),
    投管业务类型_新股申购(DictCode.投管业务类型,"EX009","新股申购"),
    投管业务类型_首期(DictCode.投管业务类型,"EX010","首期"),
    投管业务类型_提前购回(DictCode.投管业务类型,"EX011","提前购回"),
    投管业务类型_到期购回(DictCode.投管业务类型,"EX012","到期购回"),
    投管业务类型_到期续做(DictCode.投管业务类型,"EX013","到期续做"),
    投管业务类型_中途换券(DictCode.投管业务类型,"EX014","中途换券"),
    投管业务类型_解除质押(DictCode.投管业务类型,"EX015","解除质押"),
    投管业务类型_协议现券(DictCode.投管业务类型,"EX016","协议现券"),
    投管业务类型_现券交易(DictCode.投管业务类型,"EX017","现券交易"),
    投管业务类型_通用式质押回购(DictCode.投管业务类型,"EX018","通用式质押回购"),
    投管业务类型_信用保护凭证(DictCode.投管业务类型,"EX019","信用保护凭证"),

	场内多组合分配方式_单笔数量(DictCode.场内多组合分配方式,"01","单笔数量"),
    场内多组合分配方式_单笔金额(DictCode.场内多组合分配方式,"02","单笔金额"),
    场内多组合分配方式_总数量(DictCode.场内多组合分配方式,"03","总数量"),
    场内多组合分配方式_总金额(DictCode.场内多组合分配方式,"04","总金额"),
    场内多组合分配方式_持仓数量比例(DictCode.场内多组合分配方式,"05","持仓数量比例"),
    场内多组合分配方式_可用金额比例(DictCode.场内多组合分配方式,"06","可用金额比例"),
    场内多组合分配方式_可用标准券比例(DictCode.场内多组合分配方式,"07","可用标准券比例"),
    场内多组合分配方式_产品净资产比例(DictCode.场内多组合分配方式,"08","产品净资产比例"),
    场内多组合分配方式_目标可用金额(DictCode.场内多组合分配方式,"09","目标可用金额"),
    场内多组合分配方式_目标标准券使用率(DictCode.场内多组合分配方式,"10","目标标准券使用率"),

    权重方式_平均分配(DictCode.权重方式,"01","平均分配"),
    权重方式_组合净资产比例(DictCode.权重方式,"02","组合净资产比例"),
    权重方式_组合可用金额比例(DictCode.权重方式,"03","组合可用金额比例"),
    权重方式_组合持仓数量比例(DictCode.权重方式,"04","组合持仓数量比例"),
    权重方式_自定义(DictCode.权重方式,"05","自定义"),

    目标值单位_股(DictCode.目标值单位,"01","股"),
    目标值单位_份(DictCode.目标值单位,"02","份"),
    目标值单位_张(DictCode.目标值单位,"03","张"),
    目标值单位_手(DictCode.目标值单位,"04","手"),
    目标值单位_百分比(DictCode.目标值单位,"05","%"),
    目标值单位_元(DictCode.目标值单位,"06","元"),
    目标值单位_万元(DictCode.目标值单位,"07","万元"),

    申购方式_网下申购(DictCode.申购方式,"02","网下申购"),
    平安业务类型_债券质押式逆回购(DictCode.平安业务类型,"19","债券质押式逆回购"),
    平安业务类型_债券质押式正回购(DictCode.平安业务类型,"20","债券质押式正回购"),

    金融产品其他代码类型_上市流通(DictCode.金融产品其他代码类型,"15","上市流通"),
    平安业务类型_债券上市流通(DictCode.平安业务类型,"150","债券上市流通"),

    共通业务类型_质押券出入库交易(DictCode.共通业务类型,"TRD92","质押券出入库交易"),

    平安业务类型_质押券出入库(DictCode.平安业务类型,"160","质押券出入库"),

    平安业务类型_质押式正回购到期(DictCode.平安业务类型,"52","质押式正回购到期"),
    平安业务类型_质押式逆回购到期(DictCode.平安业务类型,"51","质押式逆回购到期"),
    
    共通业务类型_可转债申购交易(DictCode.共通业务类型,"TRD62","可转债申购交易"),
    持仓类型_场内上市前冻结(DictCode.持仓类型,"15","场内上市前冻结"),
    
    产品数据来源_母行代销TA(DictCode.产品数据来源, "01", "母行代销TA"),
	产品数据来源_三方分销TA(DictCode.产品数据来源, "02", "三方分销TA"),
	结算方式_头寸引擎_净额结算(DictCode.结算方式_头寸引擎, "01", "净额结算"),
	结算方式_头寸引擎_RTGS(DictCode.结算方式_头寸引擎, "02", "RTGS"),
	结算方式_头寸引擎_逐笔全额结算(DictCode.结算方式_头寸引擎, "03", "逐笔全额结算"),

    共通业务类型_场内债券现券指令(DictCode.共通业务类型, "ETR54", "场内债券现券指令"),
    共通业务类型_场内通用质押式回购指令(DictCode.共通业务类型, "ETR55", "场内通用质押式回购指令"),
    计价方式_净价(DictCode.计价方式, "01", "净价"),
    计价方式_全价(DictCode.计价方式, "02", "全价"),
    指定交易方式_匹配成交(DictCode.指定交易方式, "0", "匹配成交"),
    指定交易方式_协商成交(DictCode.指定交易方式, "FI9", "协商成交"),
    价格申报范围类型_开盘集合竞价(DictCode.价格申报范围类型, "01", "开盘集合竞价"),
    价格申报范围类型_连续竞价(DictCode.价格申报范围类型, "02", "连续竞价"),
    价格申报范围类型_收盘集合竞价(DictCode.价格申报范围类型, "03", "收盘集合竞价"),
    价格申报范围类型_开市停牌阶段(DictCode.价格申报范围类型, "04", "开市停牌阶段"),

    上农商_指令业务类型_债券现券交易指令(DictCode.上农商_指令业务类型, "28", "债券现券交易指令"),
    上农商_指令业务类型_通用式质押回购指令(DictCode.上农商_指令业务类型, "29", "通用式质押回购指令"),


    交易主体类型_自营(DictCode.交易主体类型,"01","自营"),
    交易主体类型_资管(DictCode.交易主体类型,"02","资管"),
    交易主体类型_机构经纪(DictCode.交易主体类型,"03","机构经纪"),
    交易主体类型_个人经纪(DictCode.交易主体类型,"04","个人经纪"),
    交易平台_新债平台(DictCode.交易平台,"06","新债平台"),

    交易场所_银行间(DictCode.交易场所,"01","银行间"),
    交易场所_商业银行柜台(DictCode.交易场所,"02","商业银行柜台"),
    交易场所_上海证券交易所(DictCode.交易场所,"03","上海证券交易所"),
    交易场所_深圳证券交易所(DictCode.交易场所,"04","深圳证券交易所"),
    交易场所_机构间私募系统(DictCode.交易场所,"05","机构间私募系统"),
    交易场所_OTC场外(DictCode.交易场所,"09","OTC场外"),
    交易场所_境外交易场所(DictCode.交易场所,"10","境外交易场所"),
    交易场所_北京金融资产交易所(DictCode.交易场所,"11","北京金融资产交易所"),
    交易场所_香港联合交易所(DictCode.交易场所,"12","香港联合交易所"),
    共通业务类型_一级市场债中标结果维护(DictCode.共通业务类型,"TRD61","一级市场债中标结果维护"),
    ;
    /**
     * 对应于数据字典code
     */
    private String value;

    /**
     * 数据字典枚举
     */
    private DictCode dictCode;

    /**
     * 明细名称
     */
    private String codeName;

    DictCodeListExt3(DictCode dictCode, String value, String codeName) {
        this.dictCode = dictCode;
        this.value = value;
        this.setCodeName(codeName);
    }

    /**
     * 获得数据字典详细类
     *
     * @param value 数据字典值
     * @param dictCode 数据字典DictCode
     * @return DictCodeList
     * @see
     * @since 1.0
     */
    public static DictCodeListExt3 from(DictCode dictCode, String value) {
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (StringUtil.equals(value, code.getValue()) && code.getDictCode() == dictCode) {
                return code;
            }
        }
        return null;
    }

    /**
     * 转换成DICTCODELIST
     * @param dictCodeListExt2
     * @return
     */
    public static Map<String,Object> fromDictCodeList(DictCodeListExt3 dictCodeListExt2){
        Map<String,Object> retMap=new HashMap<String,Object>();
        retMap.put("codeName",dictCodeListExt2.codeName);
        retMap.put("value",dictCodeListExt2.value);
        retMap.put("dictCode",dictCodeListExt2.dictCode);
        return retMap;
    }
    /**
     * 获取数据字典明细List
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<SelectOptionDto> fromDictCode(DictCode dictCode) {
        List<SelectOptionDto> result = new ArrayList<>();
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (code.getDictCode() == dictCode) {
                SelectOptionDto option = new SelectOptionDto();
                option.setId(code.getValue());
                option.setText(code.getCodeName());
                result.add(option);
            }
        }
        return result;
    }

    /**
     * 获取数据字典明细valueList
     *
     * @param dictCode DictCode
     * @return List&lt;SelectOptionDto&gt;
     * @see
     * @since 1.0
     */
    public static List<String> valuesfromDictCode(DictCode dictCode) {
        List<String> result = new ArrayList<>();
        DictCodeListExt3[] values = DictCodeListExt3.values();
        for (DictCodeListExt3 code : values) {
            if (code.getDictCode() == dictCode) {
                result.add(code.getValue());
            }
        }
        return result;
    }

    /**
     * 获取 DictCode
     *
     * @return value.
     */
    @Override
    public DictCode getDictCode() {
        return dictCode;
    }

    /**
     * 获取 value
     *
     * @return value.
     */
    @Override
    public String getValue() {
        return value;
    }

    /**
     * 设置 value
     *
     * @param value value
     */
    @Override
    public void setValue(String value) {
        this.value = value;
    }

    /**
     * 获取 codeName
     *
     * @return codeName.
     */
    @Override
    public String getCodeName() {
        return codeName;
    }

    /**
     * 获取 带有引号的名称
     *
     * @return 带有引号的名称.
     */
    public String getQuotesCodeName() {
        return "“" + codeName + "”";
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public Integer getIntegerCodeName() {
        Integer result = null;
        try {
            result = Integer.parseInt(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 获取Integer value
     *
     * @return Integer value
     */
    public BigDecimal getBigDecimalCodeName() {
        BigDecimal result = null;
        try {
            result = new BigDecimal(codeName);
        }
        catch (Exception e) {
        }
        return result;
    }

    /**
     * 设置 codeName
     *
     * @param codeName codeName
     */
    @Override
    public void setCodeName(String codeName) {
        this.codeName = codeName;
    }

}

